{
  "schema_version": 1,
  "jobs": [
    {
      "pipeline_id": "20260222T142657Z-15ae7fc3",
      "status": "summarize_running",
      "interest_job_name": "batches/91opddsfdc7yx0kvn032jk0wqlx5xg5bf8eq",
      "summarize_job_name": "batches/pn0s4e2qhtc4ltkmpa3shbo9x790m8kfojte",
      "papers": [
        {
          "paper_id": "http://arxiv.org/abs/2602.17661v1",
          "entry_id": "http://arxiv.org/abs/2602.17661v1",
          "title": "Dehn quandles of surfaces and their bounded cohomology",
          "summary": "We introduce new families of quandles that serve as invariants for classifying closed orientable surfaces. These families generalize the classical Dehn quandle and are defined, respectively, on isotopy classes of unoriented closed curves and on integral weighted multicurves. We establish their fundamental algebraic properties and construct a natural quandle covering that relates them. We then analyze their metric properties, showing that these quandles are unbounded with respect to the quandle metric. Next, we compute their second bounded quandle cohomology, proving it to be infinite-dimensional. We also establish a version of the Gromov Mapping Theorem, showing that the natural map from an abelian quandle extension onto the original quandle induces an injection on bounded quandle cohomology in every dimension. Finally, inspired by recent developments in quandle rings, we analyze idempotents in the integral quandle rings arising from the classical Dehn quandle of a surface.",
          "authors": [
            "Pankaj Kapari",
            "Deepanshi Saraf",
            "Mahender Singh"
          ],
          "published": "2026-02-19T18:59:36+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17637v1",
          "entry_id": "http://arxiv.org/abs/2602.17637v1",
          "title": "On Sets of Monochromatic Objects in Bicolored Point Sets",
          "summary": "Let $P$ be a set of $n$ points in the plane, not all on a line, each colored \\emph{red} or \\emph{blue}. The classical Motzkin--Rabin theorem guarantees the existence of a \\emph{monochromatic} line. Motivated by the seminal work of Green and Tao (2013) on the Sylvester-Gallai theorem, we investigate the quantitative and structural properties of monochromatic geometric objects, such as lines, circles, and conics.\n  We first show that if no line contains more than three points, then for all sufficiently large $n$ there are at least $n^{2}/24 - O(1)$ monochromatic lines. We then show a converse of a theorem of Jamison (1986): Given $n\\ge 6$ blue points and $n$ red points, if the blue points lie on a conic and every line through two blue points contains a red point, then all red points are collinear. We also settle the smallest nontrivial case of a conjecture of Milićević (2018) by showing that if we have $5$ blue points with no three collinear and $5$ red points, if the blue points lie on a conic and every line through two blue points contains a red point, then all $10$ points lie on a cubic curve. Further, we analyze the random setting and show that, for any non-collinear set of $n\\ge 10$ points independently colored red or blue, the expected number of monochromatic lines is minimized by the \\emph{near-pencil} configuration. Finally, we examine monochromatic circles and conics, and exhibit several natural families in which no such monochromatic objects exist.",
          "authors": [
            "Sujoy Bhore",
            "Konrad Swanepoel"
          ],
          "published": "2026-02-19T18:50:35+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17631v1",
          "entry_id": "http://arxiv.org/abs/2602.17631v1",
          "title": "The Hidden Nature of Non-Markovianity",
          "summary": "The theory of open quantum systems served as a tool to prepare entanglement at the beginning stage of quantum technology and more recently provides an important tool for state preparation. Dynamics given by time dependent Lindbladians are Markovian and lead to decoherence, decay of correlation and convergence to equilibrium. In contrast Non-Markovian evolutions can outperform their Markovian counterparts by enhancing memory. In this letter we compare the trajectories of Markovian and Non-Markovian evolutions starting from a fixed initial value. It turns out that under mild assumptions every trajectory can be obtained from a family of time dependent Lindbladians. Hence Non-Markovianity is invisible if single trajectories are concerned.",
          "authors": [
            "Jihong Cai",
            "Advith Govindarajan",
            "Marius Junge"
          ],
          "published": "2026-02-19T18:47:28+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17567v1",
          "entry_id": "http://arxiv.org/abs/2602.17567v1",
          "title": "Canonical labelling of random regular graphs",
          "summary": "We prove that whenever $d=d(n)\\to\\infty$ and $n-d\\to\\infty$ as $n\\to\\infty$, then with high probability for any non-trivial initial colouring, the colour refinement algorithm distinguishes all vertices of the random regular graph $\\mathcal{G}_{n,d}$. This, in particular, implies that with high probability $\\mathcal{G}_{n,d}$ admits a canonical labelling computable in time $O(\\min\\{n^ω,nd^2+nd\\log n\\})$, where $ω<2.372$ is the matrix multiplication exponent.",
          "authors": [
            "Mikhail Isaev",
            "Tamás Makai",
            "Brendan McKay",
            "Pawel Pralat",
            "Jane Tan",
            "Maksim Zhukovskii"
          ],
          "published": "2026-02-19T17:23:31+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17562v1",
          "entry_id": "http://arxiv.org/abs/2602.17562v1",
          "title": "On the Linearization of Flat Multi-Input Systems via Prolongations",
          "summary": "We examine when differentially flat nonlinear control systems with more than two inputs can be rendered static feedback linearizable by prolongations of suitably chosen inputs after applying a static input transformation. Building on the structure of the time derivatives of a flat output, we derive sufficient conditions that guarantee such prolongations yield a static feedback linearizable system. In the two-input case, prior work established precise links between relative degrees, the highest derivative orders occurring in a flat parameterization, and the minimal dimension of a linearizing dynamic extension, leading to necessary and sufficient criteria for systems that become static feedback linearizable after at most two prolongations of such suitably chosen inputs. This work extends this analysis to systems with more than two inputs and derives particular results for the three-input case.",
          "authors": [
            "Georg Hartl",
            "Conrad Gstöttner",
            "Markus Schöberl"
          ],
          "published": "2026-02-19T17:17:59+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17530v1",
          "entry_id": "http://arxiv.org/abs/2602.17530v1",
          "title": "Provably Explaining Neural Additive Models",
          "summary": "Despite significant progress in post-hoc explanation methods for neural networks, many remain heuristic and lack provable guarantees. A key approach for obtaining explanations with provable guarantees is by identifying a cardinally-minimal subset of input features which by itself is provably sufficient to determine the prediction. However, for standard neural networks, this task is often computationally infeasible, as it demands a worst-case exponential number of verification queries in the number of input features, each of which is NP-hard.\n  In this work, we show that for Neural Additive Models (NAMs), a recent and more interpretable neural network family, we can efficiently generate explanations with such guarantees. We present a new model-specific algorithm for NAMs that generates provably cardinally-minimal explanations using only a logarithmic number of verification queries\n  in the number of input features, after a parallelized preprocessing step with logarithmic runtime in the required precision is applied to each small univariate NAM component.\n  Our algorithm not only makes the task of obtaining cardinally-minimal explanations feasible, but even outperforms existing algorithms designed to find the relaxed variant of subset-minimal explanations - which may be larger and less informative but easier to compute - despite our algorithm solving a much more difficult task.\n  Our experiments demonstrate that, compared to previous algorithms, our approach provides provably smaller explanations than existing works and substantially reduces the computation time. Moreover, we show that our generated provable explanations offer benefits that are unattainable by standard sampling-based techniques typically used to interpret NAMs.",
          "authors": [
            "Shahaf Bassan",
            "Yizhak Yisrael Elboher",
            "Tobias Ladner",
            "Volkan Şahin",
            "Jan Kretinsky",
            "Matthias Althoff",
            "Guy Katz"
          ],
          "published": "2026-02-19T16:42:29+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17506v1",
          "entry_id": "http://arxiv.org/abs/2602.17506v1",
          "title": "Scattering in the Positive Energy Isosceles Three-Body Problem",
          "summary": "In the three-body problem with positive energy, solutions which avoid triple collision have the property that the size of the triangle formed by the bodies tends to infinity as $t\\rightarrow \\pm\\infty$. Furthermore, the triangles have well-defined asymptotic shapes $s_\\pm$. The scattering problems asks which asymptotic shape $s_+$ can occur for a given choice of $s_-$. Previous work shows that this can be viewed as the problem of finding heteroclinic orbits connecting equilibrium points on a boundary manifold ``at infinity'' and some results were obtained for solutions which avoid collisions. The goal of this paper is to study the scattering effect of binary and near-triple collisions in a simple setting -- the isosceles three-body problem. The details depend on the mass parameters but in many cases, a fixed isosceles initial shape $s_-$ scatters to essentially all possible isosceles shapes $s_+$.",
          "authors": [
            "Richard Moeckel"
          ],
          "published": "2026-02-19T16:21:22+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17482v1",
          "entry_id": "http://arxiv.org/abs/2602.17482v1",
          "title": "Compiling Quantum Lambda-Terms into Circuits via the Geometry of Interaction",
          "summary": "We present an algorithm turning any term of a linear quantum $λ$-calculus into a quantum circuit. The essential ingredient behind the proposed algorithm is Girard's geometry of interaction, which, differently from its well-known uses from the literature, is here leveraged to perform as much of the classical computation as possible, at the same time producing a circuit that, when evaluated, performs all the quantum operations in the underlying $λ$-term. We identify higher-order control flow as the primary obstacle towards efficient solutions to the problem at hand. Notably, geometry of interaction proves sufficiently flexible to enable efficient compilation in many cases, while still supporting a total compilation procedure. Finally, we characterize through a type system those $λ$-terms for which compilation can be performed efficiently.",
          "authors": [
            "Kostia Chardonnet",
            "Ugo Dal Lago",
            "Naohiko Hoshino",
            "Paolo Pistone"
          ],
          "published": "2026-02-19T15:50:47+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17480v1",
          "entry_id": "http://arxiv.org/abs/2602.17480v1",
          "title": "Directed type theory, with a twist",
          "summary": "In recent years, Homotopy Type Theory (HoTT) has had great success both as a foundation of mathematics and as internal language to reason about $\\infty$-groupoids (a.k.a. spaces). However, in many areas of mathematics and computer science, it is often the case that it is categories, not groupoids, which are the more important structures to consider. For this reason, multiple directed type theories have been proposed, i.e., theories whose semantics are based on categories. In this paper, we present a new such type theory, Twisted Type Theory (TTT). It features a novel ``twisting'' operation on types: given a type that depends both contravariantly and covariantly on some variables, its twist is a new type that depends only covariantly on the same variables. To provide the semantics of this operation, we introduce the notion of dependent 2-sided fibrations (D2SFibs), which generalize Street's notion of 2-sided fibrations. We develop the basic theory of D2SFibs, as well as characterize them through a straightening-unstraightening theorem. With these results in hand, we introduce a new elimination rule for Hom-types. We argue that our syntax and semantics satisfy key features that allow reasoning in a HoTT-like style, which allows us to mimic the proof techniques of that setting. We end the paper by exemplifying this, and use TTT to reason about categories, giving a syntactic proof of Yoneda's lemma.",
          "authors": [
            "Fernando Rafael Chu Rivera",
            "Paige Randall North"
          ],
          "published": "2026-02-19T15:48:43+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17459v1",
          "entry_id": "http://arxiv.org/abs/2602.17459v1",
          "title": "Uniform Set Systems with Uniform Witnesses",
          "summary": "Frankl--Pach and Erdős conjectured that any $(d+1)$-uniform set family $\\mathcal{F}\\subseteq \\binom{[n]}{d+1}$ with VC-dimension at most $d$ has size at most $\\binom{n-1}{d}$ when $n$ is sufficiently large. Ahlswede and Khachatrian showed that the conjecture is false by giving a counterexample of size $\\binom{n-1}{d}+\\binom{n-4}{d-2}$.\n  For a set family $\\mathcal{F}\\subseteq \\binom{[n]}{d+1}$, the condition that its VC-dimension is at most $d$ can be reformulated as follows: for any $F\\in\\mathcal{F}$, there exists a set $B_F\\subseteq F$ such that $F\\cap F'\\neq B_F$ for all $F'\\in\\mathcal{F}$. In this direction, the first author, Xu, Yip, and Zhang conjectured that the bound $\\binom{n-1}{d}$ holds if we further assume that $|B_F|=s$ for every $F\\in \\mathcal{F}$ and for some fixed $0\\leq s\\leq d$.\n  The case $s=0$ is exactly the Erdős--Ko--Rado theorem, and the cases $s\\in \\{1,d\\}$ were proved in the paper by the first author, Xu, Yip, and Zhang. In this short note, we show that the conjecture holds when $s\\leq d/2$, and the maximal constructions are stars. Moreover, we construct non-star set families of size $\\binom{n-1}{d}$ satisfying the condition for $d/2<s\\leq d-1$, which suggests that the problem is substantially different in these cases.",
          "authors": [
            "Ting-Wei Chao",
            "Zixuan Xu",
            "Dmitrii Zakharov"
          ],
          "published": "2026-02-19T15:25:56+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17444v1",
          "entry_id": "http://arxiv.org/abs/2602.17444v1",
          "title": "Design of low-energy transfers in cislunar space using sequences of lobe dynamics",
          "summary": "Dynamical structures in the circular restricted three-body problem (CR3BP) are fundamental for designing low-energy transfers, as they aid in analyzing phase space transport and designing desirable trajectories. This study focuses on lobe dynamics to exploit local chaotic transport around celestial bodies, and proposes a new method for systematically designing low-energy transfers by combining multiple lobe dynamics. A graph-based framework is constructed to explore possible transfer paths between departure and arrival orbits, reducing the complexity of the combinatorial optimization problem for designing fuel-efficient transfers. Based on this graph, low-energy transfer trajectories are constructed by connecting chaotic orbits within lobes. The resulting optimal trajectory in the Earth--Moon CR3BP is then converted into an optimal transfer in the bicircular restricted four-body problem using multiple shooting. The obtained transfer is compared with existing optimal solutions to demonstrate the effectiveness of the proposed method.",
          "authors": [
            "Naoki Hiraiwa",
            "Mai Bando",
            "Yuzuru Sato",
            "Shinji Hokamoto"
          ],
          "published": "2026-02-19T15:12:22+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17412v1",
          "entry_id": "http://arxiv.org/abs/2602.17412v1",
          "title": "On problems of Erdős and Baumann-Briggs on minimising the density of $s$-cliques in graphs with forbidden subgraphs",
          "summary": "Using flag algebras, we prove that the minimum density of $8$-cliques in a large graph without an independent set of size $3$ is $491411/268435456+o(1)$, thus resolving a new case of an old problem of Erdős [Magyar Tud. Akad. Mat. Kutató Int. Közl. 7 (1962) 459-464]. Also, we establish some other results of this type; for example, we show that the minimum $s$-clique density in a large graph with no independent set of size 3 nor an induced 5-cycle is $2^{1-s}+o(1)$ when $s=4,5,6$. For each of these results, we also describe the structure of all extremal and almost extremal graphs of large order $n$.\n  These results are applied to give an asymptotic solution to a number of cases of the problem of Baumann and Briggs [Electronic J Comb 32 (2025) P1.22] which asks for the minimum number of $s$-cliques in an $n$-vertex graph in which every $k$-set spans a $t$-clique.",
          "authors": [
            "Levente Bodnár",
            "Oleg Pikhurko"
          ],
          "published": "2026-02-19T14:42:49+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17411v1",
          "entry_id": "http://arxiv.org/abs/2602.17411v1",
          "title": "Cohomological and quasi-isometric diversity of groups with property $R_\\infty$",
          "summary": "How rich is the collection of groups with a given prominent property? In this work we approach this question for property~$R_\\infty$, which says that every automorphism $\\varphi$ of a given group has infinitely many orbits under the $\\varphi$-twisted conjugation action $(g,x) \\mapsto gx\\varphi(g)^{-1}$. Generalising the soluble groups of Herbert Abels to a large family over many integral domains, we prove that most such groups have property~$R_\\infty$ drawing from a classical result of Levchuk and a swift observation by Jabara. Within the broad programme of cataloguing finitely generated groups up to quasi-isometry, our groups can then be separated by finiteness properties and cohomological dimension whilst having~$R_\\infty$. Abandoning finite presentability, we establish that property~$R_\\infty$ is very abundant in a strong sense: there are uncountably many finitely generated groups (which can all be chosen to be amenable or non-amenable) that have~$R_\\infty$ and are pairwise not quasi-isometric. The proofs vary in flavour. On the amenable side we use carefully constructed quotients of Abels' groups and a general strategy for quasi-isometric diversity established by Minasyan, Osin, and Witzel. For the non-amenable constructions we rely on modifications of Leary's type $\\mathtt{FP}$ groups, further cohomological arguments, and recent powerful criteria for~$R_\\infty$ due to Iveson, Martino, Sgobbi, Wong, and Fournier-Facio.",
          "authors": [
            "Karel Dekimpe",
            "Paula M. Lins de Araujo",
            "Yuri Santos Rego"
          ],
          "published": "2026-02-19T14:39:28+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17401v1",
          "entry_id": "http://arxiv.org/abs/2602.17401v1",
          "title": "On a Quadratic Relation Between Stanley-Wilf Limits and Füredi-Hajnal Limits",
          "summary": "For a permutation matrix $P$, let $s_P$ denote its Stanley-Wilf limit, the exponential growth rate of the number of $n\\times n$ permutation matrices avoiding $P$. Let $c_P$ denote its Füredi-Hajnal limit, which is the limit $\\displaystyle \\lim_{n \\to \\infty} \\text{ex}(n,P)/n$ where $\\text{ex}(n,P)$ is the maximum number of ones in an $n\\times n$ $0$-$1$ matrix avoiding $P$. Cibulka proved the universal quadratic bound $s_P\\leq 2.88\\,c_P^2$. In this note we improve the constants in Cibulka's result through a so-called ``block contraction\" argument. Defining \\[ F(c)=\\inf_{t\\in\\mathbb{N}} \\frac{(t!)^{1/t}\\,15^{\\,c/t}}{c}, \\] for $c>0$, this leads us to the revised inequality $s_P\\leq F(c_P)\\,c_P^2$. In particular, $F(c)=\\log 15+o(1) \\approx 2.70805\\ldots +o(1)$ as $c\\to\\infty$, and the constant improves $2.88$ once $c_P \\geq 17$.",
          "authors": [
            "Mohamed Omar"
          ],
          "published": "2026-02-19T14:29:30+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17346v1",
          "entry_id": "http://arxiv.org/abs/2602.17346v1",
          "title": "Partial Optimality in the Preordering Problem",
          "summary": "Preordering is a generalization of clustering and partial ordering with applications in bioinformatics and social network analysis. Given a finite set $V$ and a value $c_{ab} \\in \\mathbb{R}$ for every ordered pair $ab$ of elements of $V$, the preordering problem asks for a preorder $\\lesssim$ on $V$ that maximizes the sum of the values of those pairs $ab$ for which $a \\lesssim b$. Building on the state of the art in solving this NP-hard problem partially, we contribute new partial optimality conditions and efficient algorithms for deciding these conditions. In experiments with real and synthetic data, these new conditions increase, in particular, the fraction of pairs $ab$ for which it is decided efficiently that $a \\not\\lesssim b$ in an optimal preorder.",
          "authors": [
            "David Stein",
            "Jannik Irmai",
            "Bjoern Andres"
          ],
          "published": "2026-02-19T13:29:09+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17309v1",
          "entry_id": "http://arxiv.org/abs/2602.17309v1",
          "title": "Some Remarks on Marginal Code Languages",
          "summary": "A prefix code L satisfies the condition that no word of L is a proper prefix of another word of L. Recently, Ko, Han and Salomaa relaxed this condition by allowing a word of L to be a proper prefix of at most k words of L, for some `margin' k, introducing thus the class of k-prefix-free languages, as well as the similar classes of k-suffix-free and k-infix-free languages. Here we unify the definitions of these three classes of languages into one uniform definition in two ways: via the method of partial orders and via the method of transducers. Thus, for any known class of code-related languages definable via the transducer method, one gets a marginal version of that class. Building on the techniques of Ko, Han and Salomaa, we discuss the \\emph{uniform} satisfaction and maximality problems for marginal classes of languages.",
          "authors": [
            "Stavros Konstantinidis"
          ],
          "published": "2026-02-19T12:19:43+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17301v1",
          "entry_id": "http://arxiv.org/abs/2602.17301v1",
          "title": "Grothendieck Topologies and Sheaf-Theoretic Foundations of Cryptographic Security: Attacker Models and $Σ$-Protocols as the First Step",
          "summary": "Cryptographic security is traditionally formulated using game-based or simulation-based definitions. In this paper, we propose a structural reformulation of cryptographic security based on Grothendieck topologies and sheaf theory.\n  Our key idea is to model attacker observations as a Grothendieck site, where covering families represent admissible decompositions of partial information determined by efficient simulation. Within this framework, protocol transcripts naturally form sheaves, and security properties arise as geometric conditions.\n  As a first step, we focus on $Σ$-protocols. We show that the transcript structure of any $Σ$-protocol defines a torsor in the associated topos of sheaves. Local triviality of this torsor corresponds to zero-knowledge, while the absence of global sections reflects soundness. A concrete analysis of the Schnorr $Σ$-protocol is provided to illustrate the construction.\n  This sheaf-theoretic perspective offers a conceptual explanation of simulation-based security and suggests a geometric foundation for further cryptographic abstractions.",
          "authors": [
            "Takao Inoué"
          ],
          "published": "2026-02-19T12:11:35+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17286v1",
          "entry_id": "http://arxiv.org/abs/2602.17286v1",
          "title": "Comparing Numbers of Diagonal Subsemigroups and Congruences for Semigroups",
          "summary": "Given a semigroup $S$, a diagonal subsemigroup $ρ$ is defined to be a reflexive and compatible relation on $S$, i.e. a subsemigroup of the direct square $S\\times S$ containing the diagonal $\\{ (s,s)\\colon s\\in S\\}$. When $S$ is finite, we define the DSC coefficient $χ(S)$ to be the ratio of the number of congruences to the number of diagonal subsemigroups. In a previous work we observed that $χ(S) = 1$ if and only if $S$ is a group. Here we show that for any rational $α$ with $0 < α\\leq 1$, there exists a semigroup with $χ(S) = α$. We do this by utilizing the Rees matrix construction and adapting the congruence classification of such semigroups to describe their diagonal subsemigroups.",
          "authors": [
            "Callum Barber",
            "Nik Ruškuc"
          ],
          "published": "2026-02-19T11:46:06+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17276v1",
          "entry_id": "http://arxiv.org/abs/2602.17276v1",
          "title": "RLGT: A reinforcement learning framework for extremal graph theory",
          "summary": "Reinforcement learning (RL) is a subfield of machine learning that focuses on developing models that can autonomously learn optimal decision-making strategies over time. In a recent pioneering paper, Wagner demonstrated how the Deep Cross-Entropy RL method can be applied to tackle various problems from extremal graph theory by reformulating them as combinatorial optimization problems. Subsequently, many researchers became interested in refining and extending the framework introduced by Wagner, thereby creating various RL environments specialized for graph theory. Moreover, a number of problems from extremal graph theory were solved through the use of RL. In particular, several inequalities concerning the Laplacian spectral radius of graphs were refuted, new lower bounds were obtained for certain Ramsey numbers, and contributions were made to the Turán-type extremal problem in which the forbidden structures are cycles of length three and four. Here, we present Reinforcement Learning for Graph Theory (RLGT), a novel RL framework that systematizes the previous work and provides support for both undirected and directed graphs, with or without loops, and with an arbitrary number of edge colors. The framework efficiently represents graphs and aims to facilitate future RL-based research in extremal graph theory through optimized computational performance and a clean and modular design.",
          "authors": [
            "Ivan Damnjanović",
            "Uroš Milivojević",
            "Irena Đorđević",
            "Dragan Stevanović"
          ],
          "published": "2026-02-19T11:25:22+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17253v1",
          "entry_id": "http://arxiv.org/abs/2602.17253v1",
          "title": "Symmetric (co)homology polytopes",
          "summary": "Symmetric edge polytopes are a recent and well-studied family of centrally symmetric polytopes arising from graphs. In this paper, we introduce a generalization of this family to arbitrary simplicial complexes. We show how topological properties of a simplicial complex can be translated into geometric properties of such polytopes, and vice versa. We study the integer decomposition property, facets and reflexivity of these polytopes. Using Gröbner basis techniques, we obtain a (not necessarily unimodular) triangulation of these polytopes. Due to the tools we use, most of our results hold in the more general setting of arbitrary centrally symmetric polytopes.",
          "authors": [
            "Torben Donzelmann",
            "Thiago Holleben",
            "Martina Juhnke"
          ],
          "published": "2026-02-19T10:57:00+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17242v1",
          "entry_id": "http://arxiv.org/abs/2602.17242v1",
          "title": "TAPO-Structured Description Logic for Information Behavior: Procedural and Oracle-Based Extensions",
          "summary": "We introduce \\emph{TAPO-Structured Description Logic} (TAPO--DL), a formal extension of classical description logic designed to model \\emph{information behavior} as a structured, dynamic process.\n  TAPO--DL extends the standard T--Box/A--Box architecture with two additional layers: a \\emph{Procedural Box} (P--Box), which supports concept-driven, imperative-style programs such as conditional and iterative actions, and an \\emph{Oracle Box} (O--Box), which formalizes controlled interaction with external information sources. While the terminological and assertional components capture static conceptual and factual knowledge, the procedural and oracle-based components enable the explicit representation of information-generating actions and external validation.\n  We provide a unified semantic framework for TAPO--DL based on a co-generative, sheaf-theoretic interpretation, in which local informational states are modeled as sections and informational stability corresponds to the existence of coherent global structures. Within this setting, informational truth is characterized as stability under repeated agentive interaction rather than correspondence to a fixed global state.\n  By integrating description logic with procedural dynamics, oracle-based reasoning, and sheaf-theoretic semantics, TAPO--DL offers a principled formal framework for analyzing information behavior in contexts involving interaction, uncertainty, and contextuality.",
          "authors": [
            "Takao Inoué"
          ],
          "published": "2026-02-19T10:43:21+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17240v1",
          "entry_id": "http://arxiv.org/abs/2602.17240v1",
          "title": "Serre depth and local cohomology",
          "summary": "We introduce a fundamental homological invariant, called \\emph{Serre depth}, which stratifies Serre's conditions in the same way that depth stratifies the Cohen-Macaulay property. We study the Serre depths of modules over arbitrary Noetherian local rings and over standard graded algebras over a field, extending the polynomial ring case due to Muta and Terai. Under mild hypotheses, we show that the $r$-th Serre depth of a finitely generated module $M$ measures the deviation of $M$ from satisfying Serre's condition $(S_r)$. The main results of the paper can be summarized as follows:\n  (i) We establish the basic properties of Serre depth and prove that it is invariant under completion.\n  (ii) If the base ring $R$ is a homomorphic image of a Gorenstein ring, we show that a finitely generated $R$-module $M$ is equidimensional and satisfies $(S_r)$ if and only if its $r$-th Serre depth equals its Krull dimension. Analogous statements are obtained for schemes.\n  (iii) For a homogeneous ideal in a standard graded polynomial ring over a field, we compare its Serre depths with those of its initial ideal.\n  (iv) We characterize the Serre depths of a monomial ideal in terms of its skeletons and prove that the Serre depths of sufficiently large powers of a monomial ideal stabilize; the proof uses Presburger arithmetic.",
          "authors": [
            "Antonino Ficarra"
          ],
          "published": "2026-02-19T10:37:30+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17237v1",
          "entry_id": "http://arxiv.org/abs/2602.17237v1",
          "title": "Disjunction Composition of BDD Transition Systems for Model-Based Testing",
          "summary": "We introduce a compositional approach to model-based test generation in Behavior-Driven Development (BDD). BDD is an agile methodology in which system behavior is specified through textual scenarios that, in our approach, are translated into transition systems used for model-based testing. This paper formally defines disjunction composition, to combine BDD transition systems that represent alternative system behaviors. Disjunction composition allows for modeling and testing the integrated behavior while ensuring that the testing power of the original set of scenarios is preserved. This is proved using a symbolic semantics for BDD transition systems, with the property that the symbolic equivalence of two BDD transition systems guarantees that they fail the same test cases. Also, we demonstrate the potential of disjunction composition by applying the composition in an industrial case study.",
          "authors": [
            "Tannaz Zameni",
            "Petra van den Bos",
            "Arend Rensink"
          ],
          "published": "2026-02-19T10:33:50+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17236v1",
          "entry_id": "http://arxiv.org/abs/2602.17236v1",
          "title": "Characterization of tangent quasicircles and quasiannuli",
          "summary": "We give a necessary and sufficient condition so that a pair of disjoint Jordan regions in the sphere can be quasiconformally mapped to a pair of disks. As a consequence, we obtain a simple characterization that involves Lipschitz functions for the case that one of the Jordan regions is a half-plane. We apply these results to prove that all polynomial cusps are quasiconformally equivalent and that a quasisymmetric embedding of the union of two disjoint disks extends to a quasiconformal map of the sphere, quantitatively. Also, in combination with previous work of the author, we obtain a new characterization of compact sets that are quasiconformally equivalent to Schottky sets.",
          "authors": [
            "Dimitrios Ntalampekos"
          ],
          "published": "2026-02-19T10:30:48+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17210v1",
          "entry_id": "http://arxiv.org/abs/2602.17210v1",
          "title": "Bilateral parking procedures",
          "summary": "We introduce the class of bilateral parking procedures on the integer line. While cars try to park in the nearest available spot to their right in the classical case, we consider more general parking rules that allow cars to use the nearest available spot to their left. We show that for a natural subclass of local procedures, the number of corresponding parking functions of length $r$ is always equal to $(r+1)^{r-1}$. The setting can be extended to probabilistic procedures, in which the decision to park left or right is random. We finally describe how bilateral procedures can naturally be encoded by certain labeled binary forests, whose combinatorics shed light on several results from the literature.",
          "authors": [
            "Philippe Nadeau"
          ],
          "published": "2026-02-19T10:02:09+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17179v1",
          "entry_id": "http://arxiv.org/abs/2602.17179v1",
          "title": "Multispecies inhomogeneous $t$-PushTASEP with general capacity",
          "summary": "We study an $n$-species $t$-PushTASEP, an integrable long-range stochastic process, on a one-dimensional periodic lattice with inhomogeneities $x_1,\\ldots,x_L$ and arbitrary capacity $l$ at each lattice site. The Markov matrix is identified with an alternating sum of commuting transfer matrices over all fundamental representations of $U_t(\\widehat{sl}_{n+1})$. Stationary probabilities are expressed in a matrix product form involving a fusion of quantized corner transfer matrices for the strange five-vertex model introduced by Okado, Scrimshaw, and the second author. The resulting partition function, which serves as the normalization factor of the stationary probabilities, is obtained from the $l=1$ case by a finite plethystic substitution of length $l$.",
          "authors": [
            "Arvind Ayyer",
            "Atsuo Kuniba"
          ],
          "published": "2026-02-19T08:52:26+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17142v1",
          "entry_id": "http://arxiv.org/abs/2602.17142v1",
          "title": "Generating Rely-Guarantee Conditions with the Conditional-Writes Domain",
          "summary": "Abstract interpretation has been shown to be a promising technique for the thread-modular verification of concurrent programs. Central to this is the generation of interferences, in the form of rely-guarantee conditions, conforming to a user-chosen structure. In this work, we introduce one such structure called the conditional-writes domain, designed for programs where it suffices to establish only the conditions under which particular variables are written to by each thread. We formalise our analysis within a novel abstract interpretation framework that is highly modular and can be easily extended to capture other structures for rely-guarantee conditions. We formalise two versions of our approach and evaluate their implementations on a simple programming language.",
          "authors": [
            "James Tobler",
            "Graeme Smith"
          ],
          "published": "2026-02-19T07:34:25+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17089v1",
          "entry_id": "http://arxiv.org/abs/2602.17089v1",
          "title": "Synergizing Transport-Based Generative Models and Latent Geometry for Stochastic Closure Modeling",
          "summary": "Diffusion models recently developed for generative AI tasks can produce high-quality samples while still maintaining diversity among samples to promote mode coverage, providing a promising path for learning stochastic closure models. Compared to other types of generative AI models, such as GANs and VAEs, the sampling speed is known as a key disadvantage of diffusion models. By systematically comparing transport-based generative models on a numerical example of 2D Kolmogorov flows, we show that flow matching in a lower-dimensional latent space is suited for fast sampling of stochastic closure models, enabling single-step sampling that is up to two orders of magnitude faster than iterative diffusion-based approaches. To control the latent space distortion and thus ensure the physical fidelity of the sampled closure term, we compare the implicit regularization offered by a joint training scheme against two explicit regularizers: metric-preserving (MP) and geometry-aware (GA) constraints. Besides offering a faster sampling speed, both explicitly and implicitly regularized latent spaces inherit the key topological information from the lower-dimensional manifold of the original complex dynamical system, which enables the learning of stochastic closure models without demanding a huge amount of training data.",
          "authors": [
            "Xinghao Dong",
            "Huchen Yang",
            "Jin-long Wu"
          ],
          "published": "2026-02-19T05:24:00+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.16993v1",
          "entry_id": "http://arxiv.org/abs/2602.16993v1",
          "title": "Neural codes via homological invariants of polarized neural ideals",
          "summary": "For a neural code $\\mathcal{C}\\subseteq\\mathbb{F}_2^n$, polarizing the canonical form generators of the neural ideal $J_{\\mathcal{C}}$ yields a squarefree monomial ideal $\\mathcal{P}(J_{\\mathcal{C}})\\subset k[x_1,\\dots,x_n,y_1,\\dots,y_n]$, the polarized neural ideal, and an associated simplicial complex $Δ_{\\mathcal{C}}$, the polar complex. We study the graded invariants $\\operatorname{pd}(\\mathcal{P}(J_{\\mathcal{C}}))$ and $\\operatorname{reg}(\\mathcal{P}(J_{\\mathcal{C}}))$ via the topology of $Δ_{\\mathcal{C}}$, showing that simple geometric features of the Hamming cube $\\mathbb{F}_2^n$ (with Hamming distance) organize their extremal behavior. We prove $\\operatorname{reg}(\\mathcal{P}(J_{\\mathcal{C}}))\\le 2n-1$, with equality precisely when $\\mathcal{C}$ is obtained from $\\mathbb{F}_2^n$ by deleting an antipodal pair. Using connectedness properties of induced subcomplexes of $Δ_{\\mathcal{C}}$, we obtain $\\operatorname{pd}(\\mathcal{P}(J_{\\mathcal{C}}))\\le 2n-3$, and we give an explicit family of codes attaining equality, each consisting of antipodal pairs. At the opposite end, we identify the cube geometry behind the smallest values: $\\operatorname{reg}(\\mathcal{P}(J_{\\mathcal{C}}))=1$ forces $\\mathcal{C}$ to be a coordinate subcube of $\\mathbb{F}_2^n$, while $\\operatorname{pd}(\\mathcal{P}(J_{\\mathcal{C}}))=0$ forces $\\mathcal{C}$ to be the complement of one. Finally, we construct families realizing large regions of the $(\\operatorname{pd},\\operatorname{reg})$-plot for fixed $n$.",
          "authors": [
            "Selvi Kara",
            "Ellie Lew"
          ],
          "published": "2026-02-19T01:37:44+00:00"
        }
      ],
      "interested_paper_ids": [
        "http://arxiv.org/abs/2602.17661v1",
        "http://arxiv.org/abs/2602.17459v1",
        "http://arxiv.org/abs/2602.17444v1",
        "http://arxiv.org/abs/2602.17411v1",
        "http://arxiv.org/abs/2602.17401v1",
        "http://arxiv.org/abs/2602.17309v1",
        "http://arxiv.org/abs/2602.17237v1",
        "http://arxiv.org/abs/2602.17236v1",
        "http://arxiv.org/abs/2602.17210v1"
      ],
      "summaries": {},
      "sent_paper_ids": [],
      "notification_sent": false,
      "retry_count": 0,
      "last_error": null,
      "created_at": "2026-02-22T14:26:57.007907+00:00",
      "updated_at": "2026-02-25T18:54:27.627945+00:00",
      "finalized_at": null
    },
    {
      "pipeline_id": "20260223T023632Z-04906c7c",
      "status": "summarize_running",
      "interest_job_name": "batches/1mm4e2c460i9ega61utz5gadwk64bcpauuyf",
      "summarize_job_name": "batches/r13ieu4fowoxk266xqrxdiy2z1kzwlvwrmf6",
      "papers": [
        {
          "paper_id": "http://arxiv.org/abs/2602.17859v1",
          "entry_id": "http://arxiv.org/abs/2602.17859v1",
          "title": "A discrete view of Gromov's filling area conjecture",
          "summary": "A compact metric surface $M$ isometrically fills a closed metric curve $C$ if $\\partial M=C$ and $d_M(x,y)=d_C(x,y)$ for every $x,y\\in C=\\partial M$; that is, $M$ does not introduce any ``shortcuts'' between points on its boundary. Gromov's filling area conjecture in differential geometry from 1983 asserts that among all compact, orientable Riemannian surfaces which isometrically fill the Riemannian circle, the one with the smallest surface area is the hemisphere. Gromov demonstrated that this is indeed the case if $M$ is homeomorphic to the disk. While Gromov's conjecture has since been verified in some other cases, the full conjecture remains unresolved.\n  In this paper, we consider a discrete analogue of Gromov's problem, which is likely natural to those who study graph embeddings on arbitrary surfaces. Using standard graph-theoretic tools, such as Menger's theorem, we obtain reasonable asymptotic bounds on this discrete variant. We then demonstrate how these discrete bounds can be translated to the continuous setting, showing that any isometric filling of the Riemannian circle of length $2π$ has surface area at least $1.36π$ (the hemisphere has surface area $2π$). This appears to be the first quantitative lower-bound on Gromov's problem that applies to arbitrary isometric fillings.",
          "authors": [
            "Joseph Briggs",
            "Chris Wells"
          ],
          "published": "2026-02-19T21:46:25+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17852v1",
          "entry_id": "http://arxiv.org/abs/2602.17852v1",
          "title": "Mean-field dynamics of attractive resource interaction: From uniform to aggregated states",
          "summary": "We introduce and study a nonlinear discrete dynamical system describing the evolution of a resource distribution among interacting agents. The model generalizes several classical mean-field and opinion-dynamics frameworks and is defined on the standard simplex, where each coordinate evolves according to an interaction rule depending on pairwise preference functions. We provide a complete analytical description of the long-term behavior of the system.",
          "authors": [
            "Oksana Satur"
          ],
          "published": "2026-02-19T21:36:00+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17833v1",
          "entry_id": "http://arxiv.org/abs/2602.17833v1",
          "title": "Periodic orbits of reversible Lagrangian systems without self-intersections and Mañé genericity",
          "summary": "Bernard [3] showed that a Mañé generic convex Hamiltonian has only non-degenerate periodic orbits on a given energy level. We show that one can use this result to prove that for a generic potential the prime periodic orbits of fixed energy of a Lagrangian system of classical type on a compact manifold of dimension $n\\ge 3$ do not have self-intersections and do not intersect each other.",
          "authors": [
            "Hans-Bert Rademacher"
          ],
          "published": "2026-02-19T20:53:43+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17788v1",
          "entry_id": "http://arxiv.org/abs/2602.17788v1",
          "title": "Enumeration of Nilpotent Loops by Orbit Counting",
          "summary": "We study central extensions of nilpotent loops by elementary abelian $p$-groups using normalized cocycles. By introducing an affine automorphism group acting on the full cocycle space, we obtain a direct correspondence between affine orbits and isomorphism classes of central extensions. This framework yields an efficient orbit-counting method for enumerating nilpotent loops. We reproduce the known results for orders less than 24, and enumerate the nilpotent loops of order 24 with center of size at least 3.",
          "authors": [
            "Fariha Iftikhar",
            "Gábor P. Nagy"
          ],
          "published": "2026-02-19T19:45:59+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17661v1",
          "entry_id": "http://arxiv.org/abs/2602.17661v1",
          "title": "Dehn quandles of surfaces and their bounded cohomology",
          "summary": "We introduce new families of quandles that serve as invariants for classifying closed orientable surfaces. These families generalize the classical Dehn quandle and are defined, respectively, on isotopy classes of unoriented closed curves and on integral weighted multicurves. We establish their fundamental algebraic properties and construct a natural quandle covering that relates them. We then analyze their metric properties, showing that these quandles are unbounded with respect to the quandle metric. Next, we compute their second bounded quandle cohomology, proving it to be infinite-dimensional. We also establish a version of the Gromov Mapping Theorem, showing that the natural map from an abelian quandle extension onto the original quandle induces an injection on bounded quandle cohomology in every dimension. Finally, inspired by recent developments in quandle rings, we analyze idempotents in the integral quandle rings arising from the classical Dehn quandle of a surface.",
          "authors": [
            "Pankaj Kapari",
            "Deepanshi Saraf",
            "Mahender Singh"
          ],
          "published": "2026-02-19T18:59:36+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17637v1",
          "entry_id": "http://arxiv.org/abs/2602.17637v1",
          "title": "On Sets of Monochromatic Objects in Bicolored Point Sets",
          "summary": "Let $P$ be a set of $n$ points in the plane, not all on a line, each colored \\emph{red} or \\emph{blue}. The classical Motzkin--Rabin theorem guarantees the existence of a \\emph{monochromatic} line. Motivated by the seminal work of Green and Tao (2013) on the Sylvester-Gallai theorem, we investigate the quantitative and structural properties of monochromatic geometric objects, such as lines, circles, and conics.\n  We first show that if no line contains more than three points, then for all sufficiently large $n$ there are at least $n^{2}/24 - O(1)$ monochromatic lines. We then show a converse of a theorem of Jamison (1986): Given $n\\ge 6$ blue points and $n$ red points, if the blue points lie on a conic and every line through two blue points contains a red point, then all red points are collinear. We also settle the smallest nontrivial case of a conjecture of Milićević (2018) by showing that if we have $5$ blue points with no three collinear and $5$ red points, if the blue points lie on a conic and every line through two blue points contains a red point, then all $10$ points lie on a cubic curve. Further, we analyze the random setting and show that, for any non-collinear set of $n\\ge 10$ points independently colored red or blue, the expected number of monochromatic lines is minimized by the \\emph{near-pencil} configuration. Finally, we examine monochromatic circles and conics, and exhibit several natural families in which no such monochromatic objects exist.",
          "authors": [
            "Sujoy Bhore",
            "Konrad Swanepoel"
          ],
          "published": "2026-02-19T18:50:35+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17631v1",
          "entry_id": "http://arxiv.org/abs/2602.17631v1",
          "title": "The Hidden Nature of Non-Markovianity",
          "summary": "The theory of open quantum systems served as a tool to prepare entanglement at the beginning stage of quantum technology and more recently provides an important tool for state preparation. Dynamics given by time dependent Lindbladians are Markovian and lead to decoherence, decay of correlation and convergence to equilibrium. In contrast Non-Markovian evolutions can outperform their Markovian counterparts by enhancing memory. In this letter we compare the trajectories of Markovian and Non-Markovian evolutions starting from a fixed initial value. It turns out that under mild assumptions every trajectory can be obtained from a family of time dependent Lindbladians. Hence Non-Markovianity is invisible if single trajectories are concerned.",
          "authors": [
            "Jihong Cai",
            "Advith Govindarajan",
            "Marius Junge"
          ],
          "published": "2026-02-19T18:47:28+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17752v1",
          "entry_id": "http://arxiv.org/abs/2602.17752v1",
          "title": "A logical approach to concentration",
          "summary": "Concentration results say that a sequence of random variables becomes progressively concentrated around the mean. Such results are common in the study of functions of random graphs. We introduce a real-valued logic with various aggregate operators on graphs, including summation, and prove that every term in the language, seen as a random variable on random graphs within the classical Erdős-Rényi random graph model, is concentrated. We prove this for dense and sparse variants of Erdős-Rényi graphs. On the one hand, our results extend the line of work originating with Fagin and Glebskii et al. on zero-one laws for dense random graphs, as well as the zero-one law of Shelah and Spencer for sparse random graphs. On the other hand, they can be seen as a meta-theorem for inferring concentration results on random graphs, and we give examples of such applications.",
          "authors": [
            "Michael Benedikt",
            "Maksim Zhukovskii"
          ],
          "published": "2026-02-19T18:40:49+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17567v1",
          "entry_id": "http://arxiv.org/abs/2602.17567v1",
          "title": "Canonical labelling of random regular graphs",
          "summary": "We prove that whenever $d=d(n)\\to\\infty$ and $n-d\\to\\infty$ as $n\\to\\infty$, then with high probability for any non-trivial initial colouring, the colour refinement algorithm distinguishes all vertices of the random regular graph $\\mathcal{G}_{n,d}$. This, in particular, implies that with high probability $\\mathcal{G}_{n,d}$ admits a canonical labelling computable in time $O(\\min\\{n^ω,nd^2+nd\\log n\\})$, where $ω<2.372$ is the matrix multiplication exponent.",
          "authors": [
            "Mikhail Isaev",
            "Tamás Makai",
            "Brendan McKay",
            "Pawel Pralat",
            "Jane Tan",
            "Maksim Zhukovskii"
          ],
          "published": "2026-02-19T17:23:31+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17562v1",
          "entry_id": "http://arxiv.org/abs/2602.17562v1",
          "title": "On the Linearization of Flat Multi-Input Systems via Prolongations",
          "summary": "We examine when differentially flat nonlinear control systems with more than two inputs can be rendered static feedback linearizable by prolongations of suitably chosen inputs after applying a static input transformation. Building on the structure of the time derivatives of a flat output, we derive sufficient conditions that guarantee such prolongations yield a static feedback linearizable system. In the two-input case, prior work established precise links between relative degrees, the highest derivative orders occurring in a flat parameterization, and the minimal dimension of a linearizing dynamic extension, leading to necessary and sufficient criteria for systems that become static feedback linearizable after at most two prolongations of such suitably chosen inputs. This work extends this analysis to systems with more than two inputs and derives particular results for the three-input case.",
          "authors": [
            "Georg Hartl",
            "Conrad Gstöttner",
            "Markus Schöberl"
          ],
          "published": "2026-02-19T17:17:59+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17530v1",
          "entry_id": "http://arxiv.org/abs/2602.17530v1",
          "title": "Provably Explaining Neural Additive Models",
          "summary": "Despite significant progress in post-hoc explanation methods for neural networks, many remain heuristic and lack provable guarantees. A key approach for obtaining explanations with provable guarantees is by identifying a cardinally-minimal subset of input features which by itself is provably sufficient to determine the prediction. However, for standard neural networks, this task is often computationally infeasible, as it demands a worst-case exponential number of verification queries in the number of input features, each of which is NP-hard.\n  In this work, we show that for Neural Additive Models (NAMs), a recent and more interpretable neural network family, we can efficiently generate explanations with such guarantees. We present a new model-specific algorithm for NAMs that generates provably cardinally-minimal explanations using only a logarithmic number of verification queries\n  in the number of input features, after a parallelized preprocessing step with logarithmic runtime in the required precision is applied to each small univariate NAM component.\n  Our algorithm not only makes the task of obtaining cardinally-minimal explanations feasible, but even outperforms existing algorithms designed to find the relaxed variant of subset-minimal explanations - which may be larger and less informative but easier to compute - despite our algorithm solving a much more difficult task.\n  Our experiments demonstrate that, compared to previous algorithms, our approach provides provably smaller explanations than existing works and substantially reduces the computation time. Moreover, we show that our generated provable explanations offer benefits that are unattainable by standard sampling-based techniques typically used to interpret NAMs.",
          "authors": [
            "Shahaf Bassan",
            "Yizhak Yisrael Elboher",
            "Tobias Ladner",
            "Volkan Şahin",
            "Jan Kretinsky",
            "Matthias Althoff",
            "Guy Katz"
          ],
          "published": "2026-02-19T16:42:29+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17506v1",
          "entry_id": "http://arxiv.org/abs/2602.17506v1",
          "title": "Scattering in the Positive Energy Isosceles Three-Body Problem",
          "summary": "In the three-body problem with positive energy, solutions which avoid triple collision have the property that the size of the triangle formed by the bodies tends to infinity as $t\\rightarrow \\pm\\infty$. Furthermore, the triangles have well-defined asymptotic shapes $s_\\pm$. The scattering problems asks which asymptotic shape $s_+$ can occur for a given choice of $s_-$. Previous work shows that this can be viewed as the problem of finding heteroclinic orbits connecting equilibrium points on a boundary manifold ``at infinity'' and some results were obtained for solutions which avoid collisions. The goal of this paper is to study the scattering effect of binary and near-triple collisions in a simple setting -- the isosceles three-body problem. The details depend on the mass parameters but in many cases, a fixed isosceles initial shape $s_-$ scatters to essentially all possible isosceles shapes $s_+$.",
          "authors": [
            "Richard Moeckel"
          ],
          "published": "2026-02-19T16:21:22+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17482v1",
          "entry_id": "http://arxiv.org/abs/2602.17482v1",
          "title": "Compiling Quantum Lambda-Terms into Circuits via the Geometry of Interaction",
          "summary": "We present an algorithm turning any term of a linear quantum $λ$-calculus into a quantum circuit. The essential ingredient behind the proposed algorithm is Girard's geometry of interaction, which, differently from its well-known uses from the literature, is here leveraged to perform as much of the classical computation as possible, at the same time producing a circuit that, when evaluated, performs all the quantum operations in the underlying $λ$-term. We identify higher-order control flow as the primary obstacle towards efficient solutions to the problem at hand. Notably, geometry of interaction proves sufficiently flexible to enable efficient compilation in many cases, while still supporting a total compilation procedure. Finally, we characterize through a type system those $λ$-terms for which compilation can be performed efficiently.",
          "authors": [
            "Kostia Chardonnet",
            "Ugo Dal Lago",
            "Naohiko Hoshino",
            "Paolo Pistone"
          ],
          "published": "2026-02-19T15:50:47+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17480v1",
          "entry_id": "http://arxiv.org/abs/2602.17480v1",
          "title": "Directed type theory, with a twist",
          "summary": "In recent years, Homotopy Type Theory (HoTT) has had great success both as a foundation of mathematics and as internal language to reason about $\\infty$-groupoids (a.k.a. spaces). However, in many areas of mathematics and computer science, it is often the case that it is categories, not groupoids, which are the more important structures to consider. For this reason, multiple directed type theories have been proposed, i.e., theories whose semantics are based on categories. In this paper, we present a new such type theory, Twisted Type Theory (TTT). It features a novel ``twisting'' operation on types: given a type that depends both contravariantly and covariantly on some variables, its twist is a new type that depends only covariantly on the same variables. To provide the semantics of this operation, we introduce the notion of dependent 2-sided fibrations (D2SFibs), which generalize Street's notion of 2-sided fibrations. We develop the basic theory of D2SFibs, as well as characterize them through a straightening-unstraightening theorem. With these results in hand, we introduce a new elimination rule for Hom-types. We argue that our syntax and semantics satisfy key features that allow reasoning in a HoTT-like style, which allows us to mimic the proof techniques of that setting. We end the paper by exemplifying this, and use TTT to reason about categories, giving a syntactic proof of Yoneda's lemma.",
          "authors": [
            "Fernando Rafael Chu Rivera",
            "Paige Randall North"
          ],
          "published": "2026-02-19T15:48:43+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17459v1",
          "entry_id": "http://arxiv.org/abs/2602.17459v1",
          "title": "Uniform Set Systems with Uniform Witnesses",
          "summary": "Frankl--Pach and Erdős conjectured that any $(d+1)$-uniform set family $\\mathcal{F}\\subseteq \\binom{[n]}{d+1}$ with VC-dimension at most $d$ has size at most $\\binom{n-1}{d}$ when $n$ is sufficiently large. Ahlswede and Khachatrian showed that the conjecture is false by giving a counterexample of size $\\binom{n-1}{d}+\\binom{n-4}{d-2}$.\n  For a set family $\\mathcal{F}\\subseteq \\binom{[n]}{d+1}$, the condition that its VC-dimension is at most $d$ can be reformulated as follows: for any $F\\in\\mathcal{F}$, there exists a set $B_F\\subseteq F$ such that $F\\cap F'\\neq B_F$ for all $F'\\in\\mathcal{F}$. In this direction, the first author, Xu, Yip, and Zhang conjectured that the bound $\\binom{n-1}{d}$ holds if we further assume that $|B_F|=s$ for every $F\\in \\mathcal{F}$ and for some fixed $0\\leq s\\leq d$.\n  The case $s=0$ is exactly the Erdős--Ko--Rado theorem, and the cases $s\\in \\{1,d\\}$ were proved in the paper by the first author, Xu, Yip, and Zhang. In this short note, we show that the conjecture holds when $s\\leq d/2$, and the maximal constructions are stars. Moreover, we construct non-star set families of size $\\binom{n-1}{d}$ satisfying the condition for $d/2<s\\leq d-1$, which suggests that the problem is substantially different in these cases.",
          "authors": [
            "Ting-Wei Chao",
            "Zixuan Xu",
            "Dmitrii Zakharov"
          ],
          "published": "2026-02-19T15:25:56+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17444v1",
          "entry_id": "http://arxiv.org/abs/2602.17444v1",
          "title": "Design of low-energy transfers in cislunar space using sequences of lobe dynamics",
          "summary": "Dynamical structures in the circular restricted three-body problem (CR3BP) are fundamental for designing low-energy transfers, as they aid in analyzing phase space transport and designing desirable trajectories. This study focuses on lobe dynamics to exploit local chaotic transport around celestial bodies, and proposes a new method for systematically designing low-energy transfers by combining multiple lobe dynamics. A graph-based framework is constructed to explore possible transfer paths between departure and arrival orbits, reducing the complexity of the combinatorial optimization problem for designing fuel-efficient transfers. Based on this graph, low-energy transfer trajectories are constructed by connecting chaotic orbits within lobes. The resulting optimal trajectory in the Earth--Moon CR3BP is then converted into an optimal transfer in the bicircular restricted four-body problem using multiple shooting. The obtained transfer is compared with existing optimal solutions to demonstrate the effectiveness of the proposed method.",
          "authors": [
            "Naoki Hiraiwa",
            "Mai Bando",
            "Yuzuru Sato",
            "Shinji Hokamoto"
          ],
          "published": "2026-02-19T15:12:22+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17412v2",
          "entry_id": "http://arxiv.org/abs/2602.17412v2",
          "title": "On problems of Erdős and Baumann-Briggs on minimising the density of $s$-cliques in graphs with forbidden subgraphs",
          "summary": "Using flag algebras, we prove that the minimum density of $8$-cliques in a large graph without an independent set of size $3$ is $491411/268435456+o(1)$, thus resolving a new case of an old problem of Erdős [Magyar Tud. Akad. Mat. Kutató Int. Közl. 7 (1962) 459-464]. Also, we establish some other results of this type; for example, we show that the minimum $s$-clique density in a large graph with no independent set of size 3 nor an induced 5-cycle is $2^{1-s}+o(1)$ when $s=4,5,6$. For each of these results, we also describe the structure of all extremal and almost extremal graphs of large order $n$.\n  These results are applied to give an asymptotic solution to a number of cases of the problem of Baumann and Briggs [Electronic J Comb 32 (2025) P1.22] which asks for the minimum number of $s$-cliques in an $n$-vertex graph in which every $k$-set spans a $t$-clique.",
          "authors": [
            "Levente Bodnár",
            "Oleg Pikhurko"
          ],
          "published": "2026-02-19T14:42:49+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17411v1",
          "entry_id": "http://arxiv.org/abs/2602.17411v1",
          "title": "Cohomological and quasi-isometric diversity of groups with property $R_\\infty$",
          "summary": "How rich is the collection of groups with a given prominent property? In this work we approach this question for property~$R_\\infty$, which says that every automorphism $\\varphi$ of a given group has infinitely many orbits under the $\\varphi$-twisted conjugation action $(g,x) \\mapsto gx\\varphi(g)^{-1}$. Generalising the soluble groups of Herbert Abels to a large family over many integral domains, we prove that most such groups have property~$R_\\infty$ drawing from a classical result of Levchuk and a swift observation by Jabara. Within the broad programme of cataloguing finitely generated groups up to quasi-isometry, our groups can then be separated by finiteness properties and cohomological dimension whilst having~$R_\\infty$. Abandoning finite presentability, we establish that property~$R_\\infty$ is very abundant in a strong sense: there are uncountably many finitely generated groups (which can all be chosen to be amenable or non-amenable) that have~$R_\\infty$ and are pairwise not quasi-isometric. The proofs vary in flavour. On the amenable side we use carefully constructed quotients of Abels' groups and a general strategy for quasi-isometric diversity established by Minasyan, Osin, and Witzel. For the non-amenable constructions we rely on modifications of Leary's type $\\mathtt{FP}$ groups, further cohomological arguments, and recent powerful criteria for~$R_\\infty$ due to Iveson, Martino, Sgobbi, Wong, and Fournier-Facio.",
          "authors": [
            "Karel Dekimpe",
            "Paula M. Lins de Araujo",
            "Yuri Santos Rego"
          ],
          "published": "2026-02-19T14:39:28+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17401v1",
          "entry_id": "http://arxiv.org/abs/2602.17401v1",
          "title": "On a Quadratic Relation Between Stanley-Wilf Limits and Füredi-Hajnal Limits",
          "summary": "For a permutation matrix $P$, let $s_P$ denote its Stanley-Wilf limit, the exponential growth rate of the number of $n\\times n$ permutation matrices avoiding $P$. Let $c_P$ denote its Füredi-Hajnal limit, which is the limit $\\displaystyle \\lim_{n \\to \\infty} \\text{ex}(n,P)/n$ where $\\text{ex}(n,P)$ is the maximum number of ones in an $n\\times n$ $0$-$1$ matrix avoiding $P$. Cibulka proved the universal quadratic bound $s_P\\leq 2.88\\,c_P^2$. In this note we improve the constants in Cibulka's result through a so-called ``block contraction\" argument. Defining \\[ F(c)=\\inf_{t\\in\\mathbb{N}} \\frac{(t!)^{1/t}\\,15^{\\,c/t}}{c}, \\] for $c>0$, this leads us to the revised inequality $s_P\\leq F(c_P)\\,c_P^2$. In particular, $F(c)=\\log 15+o(1) \\approx 2.70805\\ldots +o(1)$ as $c\\to\\infty$, and the constant improves $2.88$ once $c_P \\geq 17$.",
          "authors": [
            "Mohamed Omar"
          ],
          "published": "2026-02-19T14:29:30+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17346v1",
          "entry_id": "http://arxiv.org/abs/2602.17346v1",
          "title": "Partial Optimality in the Preordering Problem",
          "summary": "Preordering is a generalization of clustering and partial ordering with applications in bioinformatics and social network analysis. Given a finite set $V$ and a value $c_{ab} \\in \\mathbb{R}$ for every ordered pair $ab$ of elements of $V$, the preordering problem asks for a preorder $\\lesssim$ on $V$ that maximizes the sum of the values of those pairs $ab$ for which $a \\lesssim b$. Building on the state of the art in solving this NP-hard problem partially, we contribute new partial optimality conditions and efficient algorithms for deciding these conditions. In experiments with real and synthetic data, these new conditions increase, in particular, the fraction of pairs $ab$ for which it is decided efficiently that $a \\not\\lesssim b$ in an optimal preorder.",
          "authors": [
            "David Stein",
            "Jannik Irmai",
            "Bjoern Andres"
          ],
          "published": "2026-02-19T13:29:09+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17309v1",
          "entry_id": "http://arxiv.org/abs/2602.17309v1",
          "title": "Some Remarks on Marginal Code Languages",
          "summary": "A prefix code L satisfies the condition that no word of L is a proper prefix of another word of L. Recently, Ko, Han and Salomaa relaxed this condition by allowing a word of L to be a proper prefix of at most k words of L, for some `margin' k, introducing thus the class of k-prefix-free languages, as well as the similar classes of k-suffix-free and k-infix-free languages. Here we unify the definitions of these three classes of languages into one uniform definition in two ways: via the method of partial orders and via the method of transducers. Thus, for any known class of code-related languages definable via the transducer method, one gets a marginal version of that class. Building on the techniques of Ko, Han and Salomaa, we discuss the \\emph{uniform} satisfaction and maximality problems for marginal classes of languages.",
          "authors": [
            "Stavros Konstantinidis"
          ],
          "published": "2026-02-19T12:19:43+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17301v1",
          "entry_id": "http://arxiv.org/abs/2602.17301v1",
          "title": "Grothendieck Topologies and Sheaf-Theoretic Foundations of Cryptographic Security: Attacker Models and $Σ$-Protocols as the First Step",
          "summary": "Cryptographic security is traditionally formulated using game-based or simulation-based definitions. In this paper, we propose a structural reformulation of cryptographic security based on Grothendieck topologies and sheaf theory.\n  Our key idea is to model attacker observations as a Grothendieck site, where covering families represent admissible decompositions of partial information determined by efficient simulation. Within this framework, protocol transcripts naturally form sheaves, and security properties arise as geometric conditions.\n  As a first step, we focus on $Σ$-protocols. We show that the transcript structure of any $Σ$-protocol defines a torsor in the associated topos of sheaves. Local triviality of this torsor corresponds to zero-knowledge, while the absence of global sections reflects soundness. A concrete analysis of the Schnorr $Σ$-protocol is provided to illustrate the construction.\n  This sheaf-theoretic perspective offers a conceptual explanation of simulation-based security and suggests a geometric foundation for further cryptographic abstractions.",
          "authors": [
            "Takao Inoué"
          ],
          "published": "2026-02-19T12:11:35+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17286v1",
          "entry_id": "http://arxiv.org/abs/2602.17286v1",
          "title": "Comparing Numbers of Diagonal Subsemigroups and Congruences for Semigroups",
          "summary": "Given a semigroup $S$, a diagonal subsemigroup $ρ$ is defined to be a reflexive and compatible relation on $S$, i.e. a subsemigroup of the direct square $S\\times S$ containing the diagonal $\\{ (s,s)\\colon s\\in S\\}$. When $S$ is finite, we define the DSC coefficient $χ(S)$ to be the ratio of the number of congruences to the number of diagonal subsemigroups. In a previous work we observed that $χ(S) = 1$ if and only if $S$ is a group. Here we show that for any rational $α$ with $0 < α\\leq 1$, there exists a semigroup with $χ(S) = α$. We do this by utilizing the Rees matrix construction and adapting the congruence classification of such semigroups to describe their diagonal subsemigroups.",
          "authors": [
            "Callum Barber",
            "Nik Ruškuc"
          ],
          "published": "2026-02-19T11:46:06+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17276v1",
          "entry_id": "http://arxiv.org/abs/2602.17276v1",
          "title": "RLGT: A reinforcement learning framework for extremal graph theory",
          "summary": "Reinforcement learning (RL) is a subfield of machine learning that focuses on developing models that can autonomously learn optimal decision-making strategies over time. In a recent pioneering paper, Wagner demonstrated how the Deep Cross-Entropy RL method can be applied to tackle various problems from extremal graph theory by reformulating them as combinatorial optimization problems. Subsequently, many researchers became interested in refining and extending the framework introduced by Wagner, thereby creating various RL environments specialized for graph theory. Moreover, a number of problems from extremal graph theory were solved through the use of RL. In particular, several inequalities concerning the Laplacian spectral radius of graphs were refuted, new lower bounds were obtained for certain Ramsey numbers, and contributions were made to the Turán-type extremal problem in which the forbidden structures are cycles of length three and four. Here, we present Reinforcement Learning for Graph Theory (RLGT), a novel RL framework that systematizes the previous work and provides support for both undirected and directed graphs, with or without loops, and with an arbitrary number of edge colors. The framework efficiently represents graphs and aims to facilitate future RL-based research in extremal graph theory through optimized computational performance and a clean and modular design.",
          "authors": [
            "Ivan Damnjanović",
            "Uroš Milivojević",
            "Irena Đorđević",
            "Dragan Stevanović"
          ],
          "published": "2026-02-19T11:25:22+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17741v1",
          "entry_id": "http://arxiv.org/abs/2602.17741v1",
          "title": "On the Vertex Seidel Energy of Graphs",
          "summary": "We introduce the vertex Seidel energy via the diagonal entries of the absolute Seidel matrix. We establish a spectral formula, compute exact values for several graph families, derive bounds, and present a Coulson-type integral representation for analytical study of this invariant. We also show that vertex Seidel energy is invariant under Seidel switching and complementation.",
          "authors": [
            "Kalpesh M. Popat",
            "Enide Andrade"
          ],
          "published": "2026-02-19T10:58:11+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17253v1",
          "entry_id": "http://arxiv.org/abs/2602.17253v1",
          "title": "Symmetric (co)homology polytopes",
          "summary": "Symmetric edge polytopes are a recent and well-studied family of centrally symmetric polytopes arising from graphs. In this paper, we introduce a generalization of this family to arbitrary simplicial complexes. We show how topological properties of a simplicial complex can be translated into geometric properties of such polytopes, and vice versa. We study the integer decomposition property, facets and reflexivity of these polytopes. Using Gröbner basis techniques, we obtain a (not necessarily unimodular) triangulation of these polytopes. Due to the tools we use, most of our results hold in the more general setting of arbitrary centrally symmetric polytopes.",
          "authors": [
            "Torben Donzelmann",
            "Thiago Holleben",
            "Martina Juhnke"
          ],
          "published": "2026-02-19T10:57:00+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17242v1",
          "entry_id": "http://arxiv.org/abs/2602.17242v1",
          "title": "TAPO-Structured Description Logic for Information Behavior: Procedural and Oracle-Based Extensions",
          "summary": "We introduce \\emph{TAPO-Structured Description Logic} (TAPO--DL), a formal extension of classical description logic designed to model \\emph{information behavior} as a structured, dynamic process.\n  TAPO--DL extends the standard T--Box/A--Box architecture with two additional layers: a \\emph{Procedural Box} (P--Box), which supports concept-driven, imperative-style programs such as conditional and iterative actions, and an \\emph{Oracle Box} (O--Box), which formalizes controlled interaction with external information sources. While the terminological and assertional components capture static conceptual and factual knowledge, the procedural and oracle-based components enable the explicit representation of information-generating actions and external validation.\n  We provide a unified semantic framework for TAPO--DL based on a co-generative, sheaf-theoretic interpretation, in which local informational states are modeled as sections and informational stability corresponds to the existence of coherent global structures. Within this setting, informational truth is characterized as stability under repeated agentive interaction rather than correspondence to a fixed global state.\n  By integrating description logic with procedural dynamics, oracle-based reasoning, and sheaf-theoretic semantics, TAPO--DL offers a principled formal framework for analyzing information behavior in contexts involving interaction, uncertainty, and contextuality.",
          "authors": [
            "Takao Inoué"
          ],
          "published": "2026-02-19T10:43:21+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17240v1",
          "entry_id": "http://arxiv.org/abs/2602.17240v1",
          "title": "Serre depth and local cohomology",
          "summary": "We introduce a fundamental homological invariant, called \\emph{Serre depth}, which stratifies Serre's conditions in the same way that depth stratifies the Cohen-Macaulay property. We study the Serre depths of modules over arbitrary Noetherian local rings and over standard graded algebras over a field, extending the polynomial ring case due to Muta and Terai. Under mild hypotheses, we show that the $r$-th Serre depth of a finitely generated module $M$ measures the deviation of $M$ from satisfying Serre's condition $(S_r)$. The main results of the paper can be summarized as follows:\n  (i) We establish the basic properties of Serre depth and prove that it is invariant under completion.\n  (ii) If the base ring $R$ is a homomorphic image of a Gorenstein ring, we show that a finitely generated $R$-module $M$ is equidimensional and satisfies $(S_r)$ if and only if its $r$-th Serre depth equals its Krull dimension. Analogous statements are obtained for schemes.\n  (iii) For a homogeneous ideal in a standard graded polynomial ring over a field, we compare its Serre depths with those of its initial ideal.\n  (iv) We characterize the Serre depths of a monomial ideal in terms of its skeletons and prove that the Serre depths of sufficiently large powers of a monomial ideal stabilize; the proof uses Presburger arithmetic.",
          "authors": [
            "Antonino Ficarra"
          ],
          "published": "2026-02-19T10:37:30+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17237v1",
          "entry_id": "http://arxiv.org/abs/2602.17237v1",
          "title": "Disjunction Composition of BDD Transition Systems for Model-Based Testing",
          "summary": "We introduce a compositional approach to model-based test generation in Behavior-Driven Development (BDD). BDD is an agile methodology in which system behavior is specified through textual scenarios that, in our approach, are translated into transition systems used for model-based testing. This paper formally defines disjunction composition, to combine BDD transition systems that represent alternative system behaviors. Disjunction composition allows for modeling and testing the integrated behavior while ensuring that the testing power of the original set of scenarios is preserved. This is proved using a symbolic semantics for BDD transition systems, with the property that the symbolic equivalence of two BDD transition systems guarantees that they fail the same test cases. Also, we demonstrate the potential of disjunction composition by applying the composition in an industrial case study.",
          "authors": [
            "Tannaz Zameni",
            "Petra van den Bos",
            "Arend Rensink"
          ],
          "published": "2026-02-19T10:33:50+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17236v1",
          "entry_id": "http://arxiv.org/abs/2602.17236v1",
          "title": "Characterization of tangent quasicircles and quasiannuli",
          "summary": "We give a necessary and sufficient condition so that a pair of disjoint Jordan regions in the sphere can be quasiconformally mapped to a pair of disks. As a consequence, we obtain a simple characterization that involves Lipschitz functions for the case that one of the Jordan regions is a half-plane. We apply these results to prove that all polynomial cusps are quasiconformally equivalent and that a quasisymmetric embedding of the union of two disjoint disks extends to a quasiconformal map of the sphere, quantitatively. Also, in combination with previous work of the author, we obtain a new characterization of compact sets that are quasiconformally equivalent to Schottky sets.",
          "authors": [
            "Dimitrios Ntalampekos"
          ],
          "published": "2026-02-19T10:30:48+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17210v1",
          "entry_id": "http://arxiv.org/abs/2602.17210v1",
          "title": "Bilateral parking procedures",
          "summary": "We introduce the class of bilateral parking procedures on the integer line. While cars try to park in the nearest available spot to their right in the classical case, we consider more general parking rules that allow cars to use the nearest available spot to their left. We show that for a natural subclass of local procedures, the number of corresponding parking functions of length $r$ is always equal to $(r+1)^{r-1}$. The setting can be extended to probabilistic procedures, in which the decision to park left or right is random. We finally describe how bilateral procedures can naturally be encoded by certain labeled binary forests, whose combinatorics shed light on several results from the literature.",
          "authors": [
            "Philippe Nadeau"
          ],
          "published": "2026-02-19T10:02:09+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17179v1",
          "entry_id": "http://arxiv.org/abs/2602.17179v1",
          "title": "Multispecies inhomogeneous $t$-PushTASEP with general capacity",
          "summary": "We study an $n$-species $t$-PushTASEP, an integrable long-range stochastic process, on a one-dimensional periodic lattice with inhomogeneities $x_1,\\ldots,x_L$ and arbitrary capacity $l$ at each lattice site. The Markov matrix is identified with an alternating sum of commuting transfer matrices over all fundamental representations of $U_t(\\widehat{sl}_{n+1})$. Stationary probabilities are expressed in a matrix product form involving a fusion of quantized corner transfer matrices for the strange five-vertex model introduced by Okado, Scrimshaw, and the second author. The resulting partition function, which serves as the normalization factor of the stationary probabilities, is obtained from the $l=1$ case by a finite plethystic substitution of length $l$.",
          "authors": [
            "Arvind Ayyer",
            "Atsuo Kuniba"
          ],
          "published": "2026-02-19T08:52:26+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17142v1",
          "entry_id": "http://arxiv.org/abs/2602.17142v1",
          "title": "Generating Rely-Guarantee Conditions with the Conditional-Writes Domain",
          "summary": "Abstract interpretation has been shown to be a promising technique for the thread-modular verification of concurrent programs. Central to this is the generation of interferences, in the form of rely-guarantee conditions, conforming to a user-chosen structure. In this work, we introduce one such structure called the conditional-writes domain, designed for programs where it suffices to establish only the conditions under which particular variables are written to by each thread. We formalise our analysis within a novel abstract interpretation framework that is highly modular and can be easily extended to capture other structures for rely-guarantee conditions. We formalise two versions of our approach and evaluate their implementations on a simple programming language.",
          "authors": [
            "James Tobler",
            "Graeme Smith"
          ],
          "published": "2026-02-19T07:34:25+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17089v1",
          "entry_id": "http://arxiv.org/abs/2602.17089v1",
          "title": "Synergizing Transport-Based Generative Models and Latent Geometry for Stochastic Closure Modeling",
          "summary": "Diffusion models recently developed for generative AI tasks can produce high-quality samples while still maintaining diversity among samples to promote mode coverage, providing a promising path for learning stochastic closure models. Compared to other types of generative AI models, such as GANs and VAEs, the sampling speed is known as a key disadvantage of diffusion models. By systematically comparing transport-based generative models on a numerical example of 2D Kolmogorov flows, we show that flow matching in a lower-dimensional latent space is suited for fast sampling of stochastic closure models, enabling single-step sampling that is up to two orders of magnitude faster than iterative diffusion-based approaches. To control the latent space distortion and thus ensure the physical fidelity of the sampled closure term, we compare the implicit regularization offered by a joint training scheme against two explicit regularizers: metric-preserving (MP) and geometry-aware (GA) constraints. Besides offering a faster sampling speed, both explicitly and implicitly regularized latent spaces inherit the key topological information from the lower-dimensional manifold of the original complex dynamical system, which enables the learning of stochastic closure models without demanding a huge amount of training data.",
          "authors": [
            "Xinghao Dong",
            "Huchen Yang",
            "Jin-long Wu"
          ],
          "published": "2026-02-19T05:24:00+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.16993v1",
          "entry_id": "http://arxiv.org/abs/2602.16993v1",
          "title": "Neural codes via homological invariants of polarized neural ideals",
          "summary": "For a neural code $\\mathcal{C}\\subseteq\\mathbb{F}_2^n$, polarizing the canonical form generators of the neural ideal $J_{\\mathcal{C}}$ yields a squarefree monomial ideal $\\mathcal{P}(J_{\\mathcal{C}})\\subset k[x_1,\\dots,x_n,y_1,\\dots,y_n]$, the polarized neural ideal, and an associated simplicial complex $Δ_{\\mathcal{C}}$, the polar complex. We study the graded invariants $\\operatorname{pd}(\\mathcal{P}(J_{\\mathcal{C}}))$ and $\\operatorname{reg}(\\mathcal{P}(J_{\\mathcal{C}}))$ via the topology of $Δ_{\\mathcal{C}}$, showing that simple geometric features of the Hamming cube $\\mathbb{F}_2^n$ (with Hamming distance) organize their extremal behavior. We prove $\\operatorname{reg}(\\mathcal{P}(J_{\\mathcal{C}}))\\le 2n-1$, with equality precisely when $\\mathcal{C}$ is obtained from $\\mathbb{F}_2^n$ by deleting an antipodal pair. Using connectedness properties of induced subcomplexes of $Δ_{\\mathcal{C}}$, we obtain $\\operatorname{pd}(\\mathcal{P}(J_{\\mathcal{C}}))\\le 2n-3$, and we give an explicit family of codes attaining equality, each consisting of antipodal pairs. At the opposite end, we identify the cube geometry behind the smallest values: $\\operatorname{reg}(\\mathcal{P}(J_{\\mathcal{C}}))=1$ forces $\\mathcal{C}$ to be a coordinate subcube of $\\mathbb{F}_2^n$, while $\\operatorname{pd}(\\mathcal{P}(J_{\\mathcal{C}}))=0$ forces $\\mathcal{C}$ to be the complement of one. Finally, we construct families realizing large regions of the $(\\operatorname{pd},\\operatorname{reg})$-plot for fixed $n$.",
          "authors": [
            "Selvi Kara",
            "Ellie Lew"
          ],
          "published": "2026-02-19T01:37:44+00:00"
        }
      ],
      "interested_paper_ids": [
        "http://arxiv.org/abs/2602.17852v1",
        "http://arxiv.org/abs/2602.17444v1",
        "http://arxiv.org/abs/2602.17411v1",
        "http://arxiv.org/abs/2602.17309v1",
        "http://arxiv.org/abs/2602.17242v1",
        "http://arxiv.org/abs/2602.17237v1",
        "http://arxiv.org/abs/2602.17236v1",
        "http://arxiv.org/abs/2602.17210v1"
      ],
      "summaries": {},
      "sent_paper_ids": [],
      "notification_sent": false,
      "retry_count": 0,
      "last_error": null,
      "created_at": "2026-02-23T02:36:32.969842+00:00",
      "updated_at": "2026-02-25T18:54:27.704763+00:00",
      "finalized_at": null
    },
    {
      "pipeline_id": "20260224T023256Z-33163cdd",
      "status": "summarize_running",
      "interest_job_name": "batches/o0klbuazna6ypumya3vx2ara39sgeefjiwdb",
      "summarize_job_name": "batches/uxdlxl9xeli19ppt2e4utkeiyihn6f56d5r1",
      "papers": [
        {
          "paper_id": "http://arxiv.org/abs/2602.18657v1",
          "entry_id": "http://arxiv.org/abs/2602.18657v1",
          "title": "DSLean: A Framework for Type-Correct Interoperability Between Lean 4 and External DSLs",
          "summary": "Domain-specific languages (DSLs) mediate interactions between interactive proof assistants and external automation, but translating between the prover's internal representation and such DSLs is a tedious engineering chore. To simplify this task, we present DSLean, a framework for bidirectional translation between expressions in the Lean proof assistant and external syntax. DSLean requires only a specification of an external language and its Lean equivalents, abstracting away meta-level implementation details. We demonstrate DSLean's capabilities by implementing three new automation tactics, providing access to external solvers for interval arithmetic, ordinary differential equations, and ring ideal membership.",
          "authors": [
            "Tate Rowney",
            "Riyaz Ahuja",
            "Jeremy Avigad",
            "Sean Welleck"
          ],
          "published": "2026-02-20T23:22:12+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18654v1",
          "entry_id": "http://arxiv.org/abs/2602.18654v1",
          "title": "Corrigendum and addendum to \"Fixed-point-free elements of iterated monodromy groups\" [Trans. of the American Mathematical Society Vol. 367, No. 3 (2015), 2023-2049]",
          "summary": "In this note we document a gap in an argument in the above paper, and point to new work in the literature giving a complete proof of the main result.",
          "authors": [
            "Jorge Fariña-Asategui",
            "Rafe Jones",
            "Santiago Radi"
          ],
          "published": "2026-02-20T23:10:01+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18632v1",
          "entry_id": "http://arxiv.org/abs/2602.18632v1",
          "title": "Mixed jeu de taquin and a problem of Soojin Cho",
          "summary": "Serrano (2010) introduced the shifted plactic monoid, governing Haiman's (1989) mixed insertion algorithm, as a type B analogue of the classical plactic monoid that connects jeu de taquin of Young tableaux with the Robinson-Schensted-Knuth insertion algorithm. Serrano proposed a corresponding definition of skew shifted plactic Schur functions. Cho (2013) disproved Serrano's conjecture regarding this definition, by showing that the functions do not live in the desired ring and hence cannot provide an algebraic interpretation of tableau rectification or of the corresponding structure coefficients. Cho asked for a new definition with particular properties. We introduce such a definition and prove that it behaves as desired. We also introduce a new jeu de taquin theory that computes mixed insertion.",
          "authors": [
            "Santiago Estupiñán-Salamanca",
            "Oliver Pechenik"
          ],
          "published": "2026-02-20T21:55:41+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18621v1",
          "entry_id": "http://arxiv.org/abs/2602.18621v1",
          "title": "The Sandpile Group of a Cone Over a Bi-Coconut Tree",
          "summary": "The sandpile group of a connected graph is a finite abelian group whose cardinality is the number of spanning trees in the graph. We compute the spanning tree number and sandpile group structure for the cone over a bi-coconut tree, generalizing work of Reiner and Smith on the cone over a coconut tree. We also answer one of their questions, by exhibiting a family of trees whose sandpile groups are all cyclic but their number of leaves grows without bound.",
          "authors": [
            "Dorian Smith"
          ],
          "published": "2026-02-20T21:26:12+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18612v1",
          "entry_id": "http://arxiv.org/abs/2602.18612v1",
          "title": "A note on a cyclotomic-friendly application of RSK",
          "summary": "We give a combinatorial realization of a level-$\\ell$ Robinson-Schensted-Knuth correspondence conjectured to exist by Song and Wang for cyclotomic Schur categories. We show that cyclotomic basis elements can be canonically reorganized into flagged block composition matrices encoding families of biwords, so that the correspondence is obtained by applying the classical RSK correspondence componentwise. This perspective identifies the level-$\\ell$ correspondence as an iteration of classical RSK, specializing to the usual correspondence when $\\ell=1$ and behaving naturally under restriction to lower levels.",
          "authors": [
            "Holden Eriksson"
          ],
          "published": "2026-02-20T21:07:03+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18587v1",
          "entry_id": "http://arxiv.org/abs/2602.18587v1",
          "title": "A Structural Fixed-Point Principle in Kunen's Theorem on Quasigroups",
          "summary": "Kunen proved that a quasigroup satisfying a Moufang-type identity ($N1$) must be a loop. We reformulate the argument in the category $\\mathbf{Set}$ as a fixed-point extraction principle. From $N1$ one canonically obtains an idempotent endomorphism $j:G\\to G$. Its fixed-point object $\\mathrm{Fix}(j)=\\mathrm{Eq}(j,\\mathrm{id}_G)$ splits off as a retract. The $N1$-symmetry forces $j$ to coequalize the (regular) translation action, hence $j$ factors through the terminal object. Thus $\\mathrm{Fix}(j)\\cong 1$, yielding a unique global identity element. This provides a conceptual reformulation of Kunen's original algebraic proof \\cite{Kunen}.",
          "authors": [
            "Takao Inoué"
          ],
          "published": "2026-02-20T19:52:49+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18427v1",
          "entry_id": "http://arxiv.org/abs/2602.18427v1",
          "title": "Polytopes of alternating sign matrices with dihedral-subgroup symmetry",
          "summary": "We investigate the convex hulls of the eight dihedral symmetry classes of $n \\times n$ alternating sign matrices, i.e., ASMs invariant under a subgroup of the symmetry group of the square. Extending the prefix-sum description of the ASM polytope, we develop a uniform core--assembly framework: each symmetry class is encoded by a set of core positions and an affine assembly map that reconstructs the full matrix from its core. This reduction transfers polyhedral questions to lower-dimensional core polytopes, which are better suited to the tool set of polyhedral combinatorics, while retaining complete information about the original symmetry class. For the vertical, vertical--horizontal, half-turn, diagonal, diagonal--antidiagonal, and total symmetry classes, we give explicit polynomial-size linear inequality descriptions of the associated polytopes. In these cases, we also determine the dimension and provide facet descriptions. The quarter-turn symmetry class behaves differently: the natural relaxation admits fractional vertices, and we need to extend the system with a structured family of parity-type Chvátal--Gomory inequalities to obtain the quarter-turn symmetric ASM polytope. Our framework leads to efficient algorithms for computing minimum-cost ASMs in each symmetry class and provides a direct link between the combinatorics of symmetric ASMs and tools from polyhedral combinatorics and combinatorial optimization.",
          "authors": [
            "Péter Madarasi"
          ],
          "published": "2026-02-20T18:48:42+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18409v1",
          "entry_id": "http://arxiv.org/abs/2602.18409v1",
          "title": "Unifying approach to uniform expressivity of graph neural networks",
          "summary": "The expressive power of Graph Neural Networks (GNNs) is often analysed via correspondence to the Weisfeiler-Leman (WL) algorithm and fragments of first-order logic. Standard GNNs are limited to performing aggregation over immediate neighbourhoods or over global read-outs. To increase their expressivity, recent attempts have been made to incorporate substructural information (e.g. cycle counts and subgraph properties). In this paper, we formalize this architectural trend by introducing Template GNNs (T-GNNs), a generalized framework where node features are updated by aggregating over valid template embeddings from a specified set of graph templates. We propose a corresponding logic, Graded template modal logic (GML(T)), and generalized notions of template-based bisimulation and WL algorithm. We establish an equivalence between the expressive power of T-GNNs and GML(T), and provide a unifying approach for analysing GNN expressivity: we show how standard AC-GNNs and its recent variants can be interpreted as instantiations of T-GNNs.",
          "authors": [
            "Huan Luo",
            "Jonni Virtema"
          ],
          "published": "2026-02-20T18:18:48+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18402v1",
          "entry_id": "http://arxiv.org/abs/2602.18402v1",
          "title": "Domination and packing in graphs",
          "summary": "The dominating number $γ(G)$ of a graph $G$ is the minimum size of a vertex set whose closed neighborhoods cover all vertices of $G$, while the packing number $ρ(G)$ is the maximum size of a vertex set whose closed neighborhoods are pairwise disjoint. In this paper we investigate graph classes $\\mathcal{G}$ for which the ratio $γ(G)/ρ(G)$ is bounded by a constant $c_{\\mathcal{G}}$ for every $G \\in \\mathcal{G}$. Our main result is an improved upper bound on this ratio for planar graphs. We also extend the list of graph classes admitting a bounded ratio by showing this for chordal bipartite graphs and for homogeneously orderable graphs. In addition, we provide a simple, direct proof for trees.",
          "authors": [
            "Ákos Dúcz",
            "Anna Gujgiczer"
          ],
          "published": "2026-02-20T18:10:27+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18398v1",
          "entry_id": "http://arxiv.org/abs/2602.18398v1",
          "title": "A Jump in the Codegree Turán Densities of Long Tight Cycles",
          "summary": "We study the codegree Turán density of $\\mathcal{C}_\\ell^r$, the $r$-uniform hypergraph tight cycle of length $\\ell$. A result of Han, Lo, and Sanhueza-Matamala states that if $\\ell$ is sufficiently large and $r/\\gcd(r,\\ell)$ is even, then the codegree Turán density of $\\mathcal{C}_\\ell^r$ is $1/2$. We prove that whenever the latter assumption is not satisfied, there is a significant drop in the codegree Turán density. That is, if $\\ell$ is sufficiently large and $r/\\gcd(r,\\ell)$ is odd, then the codegree Turán density of $\\mathcal{C}_\\ell^r$ can be at most $1/3$. Moreover, this bound is tight for infinitely many uniformities $r$ and all sufficiently large $\\ell$ in the corresponding residue classes modulo $r$. Our proof makes use of a group-theoretic connection between Turán-type theorems for tight cycles and ``oriented colorings'' of the edge set of a hypergraph.",
          "authors": [
            "József Balogh",
            "Haoran Luo",
            "Maya Sankar"
          ],
          "published": "2026-02-20T18:02:54+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18390v1",
          "entry_id": "http://arxiv.org/abs/2602.18390v1",
          "title": "Dichotomy for Axiomatising Inclusion Dependencies on K-Databases",
          "summary": "A relation consisting of tuples annotated by an element of a monoid K is called a K-relation. A K-database is a collection of K-relations. In this paper, we study entailment of inclusion dependencies over K-databases, where K is a positive commutative monoid. We establish a dichotomy regarding the axiomatisation of the entailment of inclusion dependencies over K-databases, based on whether the monoid K is weakly absorptive or weakly cancellative. We establish that, if the monoid is weakly cancellative then the standard axioms of inclusion dependencies are sound and complete for the implication problem. If the monoid is not weakly cancellative, it is weakly absorptive and the standard axioms of inclusion dependencies together with the weak symmetry axiom are sound and complete for the implication problem. In addition, we establish that the so-called balance axiom is further required, if one stipulates that the joint weights of each K-relation of a K-database need to be the same; this generalises the notion of a K-relation being a distribution. In conjunction with the balance axiom, weak symmetry axiom boils down to symmetry.",
          "authors": [
            "Miika Hannula",
            "Teymur Ismikhanov",
            "Jonni Virtema"
          ],
          "published": "2026-02-20T17:54:39+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18373v1",
          "entry_id": "http://arxiv.org/abs/2602.18373v1",
          "title": "Magnetic Killing tensors and first integrals of the magnetic flow",
          "summary": "In this work we introduce a new family of symmetric tensors generalizing Killing tensors, that we call magnetic Killing symmetric tensors. We make use of them to construct first integrals for the magnetic flow associated to a given magnetic field. We apply the results to prove integrability of some invariant magnetic flows (either exact or non-exact) on some 2-step nilmanifolds: the Kodaira-Thurston manifold and Heisenberg nilmanifolds of higher dimensions.",
          "authors": [
            "Andrei Moroianu",
            "Gabriela Ovando"
          ],
          "published": "2026-02-20T17:28:48+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18366v1",
          "entry_id": "http://arxiv.org/abs/2602.18366v1",
          "title": "Entropy Density of Ergodic Nonadapted Measures for Markov Interval Maps",
          "summary": "Given a uniformly expanding transitive Markov interval map, we show that within the set of ergodic measures the set of nonadapted ergodic measures is residual in with respect to the topology induced by the $\\overline{d}$-metric. This set of measures is also shown to be path connected in many cases.",
          "authors": [
            "Łukasz Krzywoń"
          ],
          "published": "2026-02-20T17:19:07+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18362v1",
          "entry_id": "http://arxiv.org/abs/2602.18362v1",
          "title": "Generating minimal redundant and maximal irredundant sets in incidence graphs",
          "summary": "It has been proved by Boros and Makino that there is no output-polynomial-time algorithm enumerating the minimal redundant sets or the maximal irredundant sets of a hypergraph, unless P=NP. The same question was left open for graphs, with only a few tractable cases known to date. In this paper, we focus on graph classes that capture incidence relations such as bipartite, co-bipartite, and split graphs. Concerning maximal irredundant sets, we show that the problem on co-bipartite graphs is as hard as in general graphs and tractable in split and strongly orderable graphs, the latter being a generalization of chordal bipartite graphs. As for minimal redundant sets enumeration, we first show that the problem is intractable in split and co-bipartite graphs, answering the aforementioned open question, and that it is tractable on $(C_3,C_5,C_6,C_8)$-free graphs, a class of graphs incomparable to strongly orderable graphs, and which also generalizes chordal bipartite graphs.",
          "authors": [
            "Emanuel Castelo",
            "Jérémie Chalopin",
            "Oscar Defrain",
            "Simon Vilmin"
          ],
          "published": "2026-02-20T17:14:38+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18325v1",
          "entry_id": "http://arxiv.org/abs/2602.18325v1",
          "title": "On constructing small subgraphs in the budget-constrained random graph process",
          "summary": "Consider the budget-constrained random graph process introduced by Frieze, Krivelevich and Michaeli, where each time an edge is offered through the (standard) random graph process we must irrevocably decide whether to \"purchase\" this edge or not, with our goal being to construct a graph which satisfies some property within a given time $t$ and while purchasing at most $b$ edges. We consider the problem of constructing graphs containing certain fixed small subgraphs.\n  We provide an optimal strategy for building a graph which contains a copy of $K_4$, showing that budget $b=ω(\\max\\{n^8/t^5,n^2/t\\})$ suffices and that if $b=o(\\max\\{n^8/t^5,n^2/t\\})$ then no strategy can a.a.s. produce a graph containing a copy of $K_4$. This resolves a problem raised by Iľkovič, León and Shu. More generally, we obtain analogously tight results for containing a wheel of any fixed size, or a graph consisting of a tree plus one additional universal vertex. We also tackle the problem of constructing graphs containing a copy of $K_5$, obtaining both lower and upper bounds on the optimal budget, though a gap remains in this case.",
          "authors": [
            "Sylwia Antoniuk",
            "Alberto Espuny Díaz",
            "Kalina Petrova",
            "Miloš Stojaković"
          ],
          "published": "2026-02-20T16:32:14+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18316v1",
          "entry_id": "http://arxiv.org/abs/2602.18316v1",
          "title": "Ramsey theory of low-degree semialgebraic relations",
          "summary": "We prove that hypergraphs defined by low-degree polynomial inequalities contain large homogeneous subsets. Formally, let $H$ be an $r$-uniform hypergraph on $N$ vertices that is semialgebraic of constant description complexity, and each defining polynomial has degree at most $D$. Then $H$ contains a clique or an independent set of size $n$, where $N\\leq \\mbox{tw}_{3D^3}(n)$.",
          "authors": [
            "Azem Adibelli",
            "István Tomon"
          ],
          "published": "2026-02-20T16:14:36+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18310v1",
          "entry_id": "http://arxiv.org/abs/2602.18310v1",
          "title": "Recoverable systems and the maximal hard-core model on the triangular lattice",
          "summary": "In a previous paper (arXiv:2510.19746), we have studied the maximal hard-code model on the square lattice ${\\mathbb Z}^2$ from the perspective of recoverable systems. Here we extend this study to the case of the triangular lattice ${\\mathbb A}$. The following results are obtained:\n  (1) We derive bounds on the capacity of the associated recoverable system on ${\\mathbb A}$;\n  (2) We show non-uniqueness of Gibbs measures in the high-activity regime;\n  (3) We characterize extremal periodic Gibbs measures for sufficiently low values of activity.",
          "authors": [
            "Geyang Wang",
            "Alexander Barg",
            "Navin Kashyap"
          ],
          "published": "2026-02-20T16:09:02+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18305v1",
          "entry_id": "http://arxiv.org/abs/2602.18305v1",
          "title": "On A. V. Anisimov's problem for finding a polynomial algorithm checking inclusion of context-free languages in group languages",
          "summary": "The work investigates the problem of whether a context-free language is a subset of a group language. A.~V. Anisimov has shown that the problem of determining the unambiguity of finite automata is a special case of this problem. Then the question of finding polynomial algorithm verifying the inclusion of context-free languages in group languages naturally arises. The article focuses on this open problem. For the purpose, the paper describes an unconventional method of description of context-free languages, namely a representation with the help of a finite digraph whose arcs are labelled with a specially defined monoid $\\mathcal{U}$. Also, we define a semiring $\\mathcal{S}_\\mathcal{U}$ whose elements are the set $2^\\mathcal{U}$ of all subsets of $\\mathcal{U}$ and with operations - product and union of the elements of $2^\\mathcal{U}$. The described algorithm executes no more than $O(n^3)$ operations in $\\mathcal{S}_\\mathcal{U}$.",
          "authors": [
            "Krasimir Yordzhev"
          ],
          "published": "2026-02-20T16:01:19+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18302v1",
          "entry_id": "http://arxiv.org/abs/2602.18302v1",
          "title": "Dynamical GCD Problems and a Variant of the Dynamical Mordell-Lang Conjecture",
          "summary": "In \\cite{NZ25}, the authors resolved the rational function analogue of the finiteness results for greatest common divisors of iterates of polynomials established in \\cite{HT17}. These results may be viewed as dynamical generalizations of a classical problem concerning upper bounds for the greatest common divisors (GCDs) of two integer sequences studied by Bugeaud, Corvaja, and Zannier. The most delicate case arises when the maps involved are automorphisms, where the methods of \\cite{NZ25} and \\cite{HT17} rely heavily on Diophantine approximation and asymptotic analysis.\n  In the present paper, we develop an alternative approach to the automorphism case. This method is more powerful, allowing us to give complete answers to the further questions posed in \\cite{HT17}. In particular, we strengthen the main theorem of \\cite{HT17} and provide an alternative proof of the main theorem of \\cite{NZ25} in the automorphism setting.\n  Moreover, we relate this dynamical GCD problem to a special case of a higher-dimensional generalization of the Dynamical Mordell--Lang Conjecture proposed by Junyi Xie. We establish this generalized conjecture when the dynamics arise from algebraic group actions. In addition, we resolve the corresponding special case associated with dynamical GCD questions when the maps involved are polynomials.",
          "authors": [
            "She Yang",
            "Xiao Zhong"
          ],
          "published": "2026-02-20T15:59:24+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18295v1",
          "entry_id": "http://arxiv.org/abs/2602.18295v1",
          "title": "Towards a Higher-Order Bialgebraic Denotational Semantics",
          "summary": "The bialgebraic abstract GSOS framework by Turi and Plotkin provides an elegant categorical approach to modelling the operational and denotational semantics of programming and process languages. In abstract GSOS, bisimilarity is always a congruence, and it coincides with denotational equivalence. This saves the language designer from intricate, ad-hoc reasoning to establish these properties. The bialgebraic perspective on operational semantics in the style of abstract GSOS has recently been extended to higher-order languages, preserving compositionality of bisimilarity. However, a categorical understanding of bialgebraic denotational semantics according to Turi and Plotkin's original vision has so far been missing in the higher-order setting. In the present paper, we develop a theory of adequate denotational semantics in higher-order abstract GSOS. The denotational models are parametric in an appropriately chosen semantic domain in the form of a locally final coalgebra for a behaviour bifunctor, whose construction is fully decoupled from the syntax of the language. Our approach captures existing accounts of denotational semantics such as semantic domains built via general step-indexing, previously introduced on a per-language basis, and is shown to be applicable to a wide range of different higher-order languages, e.g. simply typed and untyped languages, or languages with computational effects such as probabilistic or non-deterministic branching.",
          "authors": [
            "Sergey Goncharov",
            "Marco Peressotti",
            "Stelios Tsampas",
            "Henning Urbat",
            "Stefano Volpe"
          ],
          "published": "2026-02-20T15:46:53+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18244v1",
          "entry_id": "http://arxiv.org/abs/2602.18244v1",
          "title": "Chromatic Index of Signed Generalized Book Graphs and Signed Complete Graphs",
          "summary": "A signed graph $(G,σ)$ consists of a graph $G$ and the signature $σ: E(G) \\rightarrow \\{+1,-1\\}$. An incidence of $G$ is a pair $(v,e)$, where $v$ is one of the end vertices of an edge $e \\in E(G)$. A proper $q$-edge coloring $γ$ of signed graph $(G,σ)$ is an assignment of colors to incidences satisfying that $γ(v,e) = - σ(e) γ(w,e)$ for every edge $e=vw$ and for any two incidences $(v,e)$ and $(v,f)$, involving the same vertex, $γ(v,e) \\neq γ(v,f)$. The chromatic index of a signed graph $(G,σ)$, denoted by $χ'(G,σ)$, is the minimum number $q$ for which $(G,σ)$ has a proper $q$-edge coloring. In this paper, we determine the chromatic index of signed generalized book graphs. We also determine the chromatic index of signed complete graphs of order up to six.",
          "authors": [
            "Deepak Sehrawat",
            "Rohit"
          ],
          "published": "2026-02-20T14:28:41+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18240v1",
          "entry_id": "http://arxiv.org/abs/2602.18240v1",
          "title": "Complexity lower bounds for succinct binary structures of bounded clique-width with restrictions",
          "summary": "We present a Rice-like complexity lower bound for any MSO-definable problem on binary structures succinctly encoded by circuits. This work extends the framework recently developed as a counterpoint to Courcelle's theorem for graphs encoded by circuits, in two interplaying directions: (1) by allowing multiple binary relations, and (2) by restricting the interpretation of new symbols. Depending on the pair of an MSO problem $ψ$ and an MSO restriction $χ$, the problem is proven to be NP-hard or coNP-hard or P-hard, as long as $ψ$ is non-trivial on structures satisfying $χ$ with bounded clique-width. Indeed, there are P-complete problems (for logspace reductions) in our extended context. Finally, we strengthen a previous result on the necessity to parameterize the notion of non-triviality, hence supporting the choice of clique-width.",
          "authors": [
            "Colin Geniet",
            "Aliénor Goubault-Larrecq",
            "Kévin Perrot"
          ],
          "published": "2026-02-20T14:25:28+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18238v1",
          "entry_id": "http://arxiv.org/abs/2602.18238v1",
          "title": "A Dichotomy Theorem for Automatic Structures",
          "summary": "The field of constraint satisfaction problems (CSPs) studies homomorphism problems between relational structures where the target structure is fixed. Classifying the complexity of these problems has been a central quest of the field, notably when both sides are finite structures. In this paper, we study the generalization where the input is an automatic structure -- potentially infinite, but describable by finite automata. We prove a striking dichotomy: homomorphism problems over automatic structures are either decidable in non-deterministic logarithmic space (NL), or undecidable. We show that structures for which the problem is decidable are exactly those with finite duality, which is a classical property of target structures asserting that the existence of a homomorphism into them can be characterized by the absence of a finite set of obstructions in the source structure. Notably, this property precisely characterizes target structures whose homomorphism problem is definable in first-order logic, which is well-known to be decidable over automatic structures. We also consider a natural variant of the problem. While automatic structures are finitely describable, homomorphisms from them into finite structures need not be. This leads to the notion of regular homomorphism, where the homomorphism itself must be describable by finite automata. Remarkably, we prove that this variant exhibits the same dichotomy, with the same characterization for decidability.",
          "authors": [
            "Antoine Cuvelier",
            "Rémi Morvan"
          ],
          "published": "2026-02-20T14:24:54+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18235v1",
          "entry_id": "http://arxiv.org/abs/2602.18235v1",
          "title": "Coloring Questions on Axis-Parallel Rectangles and Arithmetic Progressions",
          "summary": "We present an explicit family of hypergraphs with arbitrarily large uniformity and chromatic number that admit realizations in both geometric and number-theoretic settings. As an application, we give a new proof of a theorem of Chen, Pach, Szegedy, and Tardos. They showed that for any constants $c,k\\ge1$, there exists a finite point set $P$ in the plane with the following property: for every coloring of $P$ with $c$ colors, there is an axis-parallel rectangle containing at least $k$ points, all of the same color. Their original proof is probabilistic; we present an explicit construction. Moreover, in the case $k=2$, we show that one can even realize a graph that has arbitrarily large girth and chromatic number simultaneously. We also answer a question of Pálvölgyi on coloring sets of integers with respect to certain finite arithmetic progressions. Finally, we give an application to coloring partially ordered sets.",
          "authors": [
            "Gábor Damásdi"
          ],
          "published": "2026-02-20T14:22:23+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18220v1",
          "entry_id": "http://arxiv.org/abs/2602.18220v1",
          "title": "Dyer groups have the falsification by fellow-traveller property",
          "summary": "This paper is devoted to the study of the falsification by fellow-traveller property (FFTP) in Dyer groups. We exhibit a finite generating set for which the associated Cayley graph is a locally finite mediangle graph, and leverage its properties to prove that Dyer groups have the FFTP. It follows that Dyer groups have finitely many cone types, emphasising their role in providing a unified approach to Coxeter groups and graph products of cyclic groups.",
          "authors": [
            "Megan Howarth"
          ],
          "published": "2026-02-20T13:59:30+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18197v1",
          "entry_id": "http://arxiv.org/abs/2602.18197v1",
          "title": "An embedding version of Rubin's theorem",
          "summary": "Rubin's theorem asserts that if $Γ\\curvearrowright X$ and $Δ\\curvearrowright Y$ are Rubin actions, then any group isomorphism $Γ\\cong Δ$ induces an equivariant homeomorphism $Y\\cong X$. We provide an embedding version of Rubin's theorem highlighting group embeddings that induce a spatial equivariant map of a certain form. We further showcase instances of such embeddings between generalized Brin-Thompson groups.",
          "authors": [
            "Jan Gundelach"
          ],
          "published": "2026-02-20T13:14:59+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18143v1",
          "entry_id": "http://arxiv.org/abs/2602.18143v1",
          "title": "History-Constrained Systems",
          "summary": "We study verification problems for history-constrained systems (HCS), a model of guarded computation that uses nested systems. An outer system describes the process architecture in which a sequence of actions represents the communication between sub-systems through a global bus. Actions are either permitted or blocked locally by guards; these guards read and decide based on the sequence of actions so far in the global bus.\n  When HCS have both the outer systems and the local guard controllers modelled by finite automata, we show they have the same expressive power as regular languages and finite automata, but they are exponentially more succinct. We also analyse games on this model, representing the interaction between environment and controller, and show that solving such games is EXPTIME-complete, where the lower bound already holds for reachability/safety games and the upper bound holds for any $ω$-regular winning condition. Finally, we consider HCS with guards of greater expressive power, Vector Addition Systems with States (VASS). We show that with deterministic coverability-VASS guards the reachability problem is EXPSPACE-complete, while with reachability-VASS the problem is undecidable.",
          "authors": [
            "Louwe B. Kuijer",
            "David Purser",
            "Henry Sinclair-Banks",
            "Patrick Totzke"
          ],
          "published": "2026-02-20T11:05:03+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18121v1",
          "entry_id": "http://arxiv.org/abs/2602.18121v1",
          "title": "On Large Induced Outerplanar Subgraphs in $2$-Outerplanar Graphs",
          "summary": "Borradaile, Le and Sherman-Bennett [Graphs and Combinatorics, 2017] proved that every $n$-vertex $2$-outerplane graph has a set of at least $2n/3$ vertices that induces an outerplane graph. We identify a major flaw in their proof and recover their result with a different, and unfortunately much more complex, proof.",
          "authors": [
            "Marco D'Elia",
            "Fabrizio Frati"
          ],
          "published": "2026-02-20T10:21:10+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18040v1",
          "entry_id": "http://arxiv.org/abs/2602.18040v1",
          "title": "On Translating Epistemic Operators in a Logic of Awareness",
          "summary": "Awareness-Based Indistinguishability Logic (henceforth, AIL) is an extension of Epistemic Logic by introducing the notion of awareness, distinguishing explicit knowledge from implicit knowledge. In this framework, each of these notions is represented by a modal operator. On the other hand, HMS models, developed in the economics literature, also provide a formalization of those notions. Nevertheless, the behavior of the epistemic operators in AIL within HMS models has yet to be explored. In this paper, we define a transformation of an AIL model into an HMS model and then prove that a translation between the fragments of the language of AIL preserves truth under this transformation. As a result, we clarify the semantic role of an epistemic operator in AIL, which is induced by awareness and is essential to defining explicit knowledge, within HMS models. Furthermore, we demonstrate the differences in the implicit knowledge captured by AIL and HMS models. This work lays the groundwork for a comparative analysis between the model classes.",
          "authors": [
            "Yudai Kubono"
          ],
          "published": "2026-02-20T07:43:18+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18033v1",
          "entry_id": "http://arxiv.org/abs/2602.18033v1",
          "title": "On the Category-Theoretic Independence of Meaning, Object, Name and Existence",
          "summary": "We prove a category-theoretic independence theorem for four fundamental notions: meaning, object, name, and existence. Working in a Lawvere-style categorical semantics and in particular in toposes, we show that these notions occupy distinct structural levels (object, morphism, element, and internal logical level) and are not uniformly recoverable from one another.\n  The key separation arises between internal existence and global naming. Using a concrete example in the topos $\\mathbf{Sh}(S^1)$-the sheaf of local sections of a nontrivial covering-we exhibit an object that is internally inhabited but admits no global element.\n  These results provide a precise structural basis for treating geometric universes as foundational frameworks for information networks.",
          "authors": [
            "Takao Inoué"
          ],
          "published": "2026-02-20T07:23:50+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18027v1",
          "entry_id": "http://arxiv.org/abs/2602.18027v1",
          "title": "Refined conjugate generation in sporadic groups",
          "summary": "Given an automorphism $x$ of order bigger than $2$ of a sporadic simple group $S$, we show that there are at most $3$ conjugates of $x$ required to generate a subgroup of order divisible by a fixed prime divisor $r$ of $|S|$. The only exception is the case where $S=Suz$, $x$ is in class $3A$, $r=11$, and then the required number of generators is $4$.",
          "authors": [
            "Danila O. Revin",
            "Andrei V. Zavarnitsine"
          ],
          "published": "2026-02-20T06:49:20+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18529v1",
          "entry_id": "http://arxiv.org/abs/2602.18529v1",
          "title": "Global Attractors for Dissipative Flows on Degenerate Constraint Manifolds",
          "summary": "A class of dissipative dynamical systems evolving on smooth constraint hypersurfaces endowed with degenerate induced bilinear forms is studied. The intrinsic evolution is generated by constraint--preserving vector fields on manifolds whose tangent bundles admit a nontrivial null distribution associated with the degeneracy of the induced structure. In this indefinite setting, the absence of coercive Lyapunov functionals prevents the direct application of classical attractor theory developed for Riemannian phase spaces. Dissipation is instead characterized relative to functionals that are compatible with the null distribution and exhibit decay exclusively in directions transverse to the associated foliation. Under suitable involutivity and regularity assumptions on the null distribution, all bounded trajectories are shown to be asymptotically confined to invariant leaves of the corresponding foliation. Asymptotic compactness of the intrinsic evolution is then established without coercivity by reducing the dynamics to a projected semiflow on the quotient manifold determined by the characteristic distribution. In the presence of a bounded absorbing set and continuous semiflow structure, the intrinsic evolution admits a compact global attractor saturated by the null leaves, whose effective asymptotic dynamics are governed by a compact invariant subset of the reduced phase space. Furthermore, when the compatible functional satisfies a Morse--type nondegeneracy condition in directions transverse to the null distribution and the induced transversal linearization admits no center spectrum, the projected semiflow possesses no neutral directions. The resulting framework provides a mechanism by which constraint--induced degeneracy enforces effective dimensional reduction in dissipative geometric evolution systems.",
          "authors": [
            "Prasanta Sahoo"
          ],
          "published": "2026-02-20T06:39:46+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17983v1",
          "entry_id": "http://arxiv.org/abs/2602.17983v1",
          "title": "From Trees to Tripods: Proof of $K(π,1)$ for Artin groups with $ABI$-type spherical parabolics",
          "summary": "We reduce the $K(π,1)$-conjecture for all Artin groups with tree Coxeter diagrams to properties of Artin groups with tripod-shaped Coxeter diagrams. Combining this reduction theorem and properties of braid groups in previous works of Charney, Crisp-McCammond, Haettel and the second named author, we deduce that the $K(π,1)$-conjecture holds for every Artin group whose spherical parabolic subgroups avoid type $D_n$ ($n \\ge 4$) and the exceptional types.\n  The reduction theorem relies on producing a ``tower'' of injective metric spaces from a single Artin group. The construction of such a tower relies on two ingredients of independent interests: a notion of combinatorial convexity and a Bestvina-type inequality, in certain injective orthoscheme complexes. These ingredients further rely on the use of structural properties of bi-Helly graphs (also known as absolute bipartite retracts) developed in joint work of the first named author with Munro.",
          "authors": [
            "Nima Hoda",
            "Jingyin Huang"
          ],
          "published": "2026-02-20T04:35:27+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17982v1",
          "entry_id": "http://arxiv.org/abs/2602.17982v1",
          "title": "Bestvina metric and tree reduction for $K(π,1)$-conjecture",
          "summary": "We reduce the $K(π,1)$-conjecture for all Artin groups to properties of Artin groups whose Coxeter diagrams are trees, from which we deduce new classes of Artin groups satisfying the $K(π,1)$-conjecture. This relies on constructing actions of Artin groups on Bestvina complexes of suitable Garside groupoids.",
          "authors": [
            "Jingyin Huang"
          ],
          "published": "2026-02-20T04:35:10+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17963v1",
          "entry_id": "http://arxiv.org/abs/2602.17963v1",
          "title": "Statistical Ensemble Deviation Estimates for Nearly Integrable Hamiltonian Systems",
          "summary": "This paper studies quantitative deviation bounds for statistical ensembles evolving under the one-parameter flow of a nearly integrable Hamiltonian system. Combining Nekhoroshev-type stability estimates with phase-mixing arguments, we obtain, for any observable $G$, an explicit upper bound on the deviation of the ensemble average $\\langle G\\rangle_t$ from its angular average $\\langle \\left\\langle G \\right\\rangle_θ\\rangle_{0}$ over exponentially long time scales. The bound separates contributions from the resonant neighborhood via a probability-mass term, and from the nonresonant region via a traceable $1/t$ mixing constant $C_G$, a high-frequency Fourier tail, and an explicit normal-form remainder error.",
          "authors": [
            "Xinyu Liu",
            "Yong Li"
          ],
          "published": "2026-02-20T03:41:06+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17946v1",
          "entry_id": "http://arxiv.org/abs/2602.17946v1",
          "title": "The Turán number of Berge paths",
          "summary": "A Berge path of length $k$ in an $r$-uniform hypergraph is a collection of $k$ hyperedges $h_1,\\dots,h_k$ and $k+1$ vertices $v_1,\\dots,v_{k+1}$ such that $v_i, v_{i+1}\\in h_i$ for each $1\\le i\\le k$. Győri, Katona and Lemons [\\textit{European J. Combin. 58 (2016) 238--246}] generalized the Erdős-Gallai theorem to Berge paths and established bounds for the Turán number of Berge paths. However, these bounds are sharp only when some divisibility conditions hold. Gy\\H ori, Lemons, Salia and Zamora [\\textit{J. Combin. Theory Ser. B 148 (2021) 239--250}] determined the exact value of the Turán number of Berge paths in the case $k\\le r$. In this paper, we settle the final open case $k>r$, thereby completing the determination of the Turán number of Berge paths.",
          "authors": [
            "Xin Cheng",
            "Dániel Gerbner",
            "Hilal Hama Karim",
            "Shujing Miao",
            "Junpeng Zhou"
          ],
          "published": "2026-02-20T02:46:20+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17943v1",
          "entry_id": "http://arxiv.org/abs/2602.17943v1",
          "title": "Hypersphere-Based Restricting Conditions for Colorings of the Euclidean Space",
          "summary": "We investigate colorings of the Euclidean space \\(\\mathbb{R}^n\\) in which the color of a point \\(p\\) is determined by monochromatic configurations of points lying on hyperspheres centered at \\(p\\). We consider two types of conditions: those based on the cardinality of the forcing sets and admissible radii, and those based on certain geometric properties of simplices, such as shape, edge lengths, or volumes, for colorings using countably (finite or infinite) many colors. Our main objective is to determine whether a given condition forces the coloring to be monochromatic or not. Examples constructed using existing results show that, for conditions based on shapes, additional regularity assumptions on color classes are necessary. Accordingly, we study colorings that are somewhere comeager.",
          "authors": [
            "Gabriel Istrate",
            "Catalin Zara"
          ],
          "published": "2026-02-20T02:30:30+00:00"
        }
      ],
      "interested_paper_ids": [
        "http://arxiv.org/abs/2602.18657v1",
        "http://arxiv.org/abs/2602.18654v1",
        "http://arxiv.org/abs/2602.18632v1",
        "http://arxiv.org/abs/2602.18612v1",
        "http://arxiv.org/abs/2602.18366v1",
        "http://arxiv.org/abs/2602.18310v1",
        "http://arxiv.org/abs/2602.18305v1",
        "http://arxiv.org/abs/2602.18302v1",
        "http://arxiv.org/abs/2602.18295v1",
        "http://arxiv.org/abs/2602.18240v1",
        "http://arxiv.org/abs/2602.18238v1",
        "http://arxiv.org/abs/2602.18220v1",
        "http://arxiv.org/abs/2602.18197v1",
        "http://arxiv.org/abs/2602.18143v1",
        "http://arxiv.org/abs/2602.17983v1",
        "http://arxiv.org/abs/2602.17982v1"
      ],
      "summaries": {},
      "sent_paper_ids": [],
      "notification_sent": false,
      "retry_count": 0,
      "last_error": null,
      "created_at": "2026-02-24T02:32:56.453182+00:00",
      "updated_at": "2026-02-25T18:54:27.798676+00:00",
      "finalized_at": null
    },
    {
      "pipeline_id": "20260225T023407Z-2b67afef",
      "status": "interest_running",
      "interest_job_name": "batches/3t61aqnyon1u62anggy4h2x2d3es9gn3p6tp",
      "summarize_job_name": null,
      "papers": [
        {
          "paper_id": "http://arxiv.org/abs/2602.18921v1",
          "entry_id": "http://arxiv.org/abs/2602.18921v1",
          "title": "Constructing (Co)inductive Types via Large Sizes",
          "summary": "To ensure decidability and consistency of its type theory, a proof assistant should only accept terminating recursive functions and productive corecursive functions. Most proof assistants enforce this through syntactic conditions, which can be restrictive and non-modular. Sized types are a type-based alternative where (co)inductive types are annotated with additional size information. Well-founded induction on sizes can then be used to prove termination and productivity. An implementation of sized types exists in Agda, but it is currently inconsistent due to the addition of a largest size. We investigate an alternative approach, where intensional type theory is extended with a large type of sizes and parametric quantifiers over sizes. We show that inductive and coinductive types can be constructed in this theory, which improves on earlier work where this was only possible for the finitely-branching inductive types. The consistency of the theory is justified by an impredicative realisability model, which interprets the type of sizes as an uncountable ordinal.",
          "authors": [
            "Benno van den Berg",
            "Bastiaan Laarakker",
            "Daniël Otten"
          ],
          "published": "2026-02-21T18:24:37+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18864v1",
          "entry_id": "http://arxiv.org/abs/2602.18864v1",
          "title": "Constructions of two-dimensional optical orthogonal codes of weight three",
          "summary": "The study of optical orthogonal codes has been motivated by an application in an optical code-division multiple access system. This paper focuses on optimal two-dimensional optical orthogonal codes with autocorrelation and cross-correlation both equal to $1$. By examining the structures of $n$-cyclic group divisible packings and semi-cyclic incomplete holey group divisible designs, we present new combinatorial constructions for two-dimensional $(m\\times n,k,1)$-optical orthogonal codes. As a consequence, the exact number of codewords of an optimal two-dimensional $(m\\times n,3,1)$-optical orthogonal code is determined for any positive integers $m$ and $n$.",
          "authors": [
            "Xiuling Shan",
            "Lidong Wang",
            "Yanxun Chang",
            "Xiaomiao Wang"
          ],
          "published": "2026-02-21T15:06:30+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18844v1",
          "entry_id": "http://arxiv.org/abs/2602.18844v1",
          "title": "When Agda met Vampire",
          "summary": "Dependently-typed proof assistants furnish expressive foundations for mechanised mathematics and verified software. However, automation for these systems has been either modest in scope or complex in implementation. We aim to improve the situation by integrating proof assistants with automated theorem provers (ATPs) in a simple way, while preserving the correctness guarantees of the former. A central difficulty arises from the fact that most ATPs operate in classical first-order logic, whereas these proof assistants are grounded in constructive dependent type theory. We identify an expressive fragment of both languages -- essentially equational Horn -- that admits sound, straightforward translations in both directions. The approach produces a prototype system for Agda forwarding proof obligations to the ATP Vampire, then transforming the resulting classical proof into a constructive proof term that Agda can type-check. The prototype automatically derives proofs concerning the properties of a complex field equipped with roots of unity, which took professional Agda developers two full days to complete. The required engineering effort is modest, and we anticipate that the methodology will extend readily to other ATPs and proof assistants.",
          "authors": [
            "Artjoms Šinkarovs",
            "Michael Rawson"
          ],
          "published": "2026-02-21T14:19:56+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18841v1",
          "entry_id": "http://arxiv.org/abs/2602.18841v1",
          "title": "Slow-fast system in Rosales-Majda combustion model with fractional order kinetics",
          "summary": "We consider traveling wave solutions of a one-dimensional model for detonation waves derived by Rosales and Majda, when the reaction order $α$ belongs to $[0,1)$. The chemical kinetics is a simplified Arrhenius law or a Heaviside function. The model in the reaction zone is a slow-fast dynamical system for a vector representing temperature and mass fraction, which depends on the velocity $c$ and small viscosity $β$. Our goal in this paper is to study the bifurcation diagram in the $(β,c)$ parameter space and identify the nature of the trajectories corresponding to viscous shock waves. The demonstrations are based on a variety of techniques including the Poincaré-Bendixson theorem and the Fenichel theory. Theoretical results are confirmed by numerical computations.",
          "authors": [
            "Claude-Michel Brauner",
            "Jinlong Jing",
            "Robert Roussarie"
          ],
          "published": "2026-02-21T14:06:40+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18839v1",
          "entry_id": "http://arxiv.org/abs/2602.18839v1",
          "title": "Profinite groups with restricted centralizers of powers",
          "summary": "A group $G$ is said to have restricted centralizers if for every $x\\in G$ the centralizer $C_G(x)$ either is finite or has finite index in $G$. Shalev showed that a profinite group with restricted centralizers is virtually abelian. Here we take interest in profinite groups $G$ for which there is an integer $n$ such that $C_G(x^n)$ is either finite or open whenever $x\\in G$. It is shown that such a group $G$ has an open normal subgroup $T$ with the property that $G/Z(T)$ has finite exponent.",
          "authors": [
            "Cristina Acciarri",
            "Pavel Shumyatsky"
          ],
          "published": "2026-02-21T13:58:23+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18836v1",
          "entry_id": "http://arxiv.org/abs/2602.18836v1",
          "title": "Big Ramsey combinatorics of the Cantor set and a simple proof of Blass' perfect set theorem",
          "summary": "In this paper we present a simple approach to big Ramsey combinatorics of the Cantor set $2^ω$. Using Infinite Dual Ramsey Theorem of Carlson and Simpson, we show that $2^ω$, viewed as a topological space, has finite big Ramsey degrees. We then examine several natural topological first-order structures arising from the Cantor set and prove that each of them inherits finite big Ramsey degrees. As a consequence, we obtain a simple proof of Blass' perfect set theorem, although our method does not recover the sharp bound $(n-1)!$ for the number of colors. We also show that the complete Boolean algebra on countably many atoms has finite big Ramsey degrees, in contrast with the recent result showing that the countable atomless Boolean algebra does not have big Ramsey degrees.",
          "authors": [
            "Dragan Mašulović"
          ],
          "published": "2026-02-21T13:46:31+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18829v1",
          "entry_id": "http://arxiv.org/abs/2602.18829v1",
          "title": "On the decidability of the integrability of finite groups",
          "summary": "An integral of a group $G$ is a group $H$ whose commutator subgroup is isomorphic to $G$. In this paper, we prove that the integrability of a finite group is a decidable problem.",
          "authors": [
            "Sathasivam Kalithasan",
            "Viji Z. Thomas"
          ],
          "published": "2026-02-21T13:04:55+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18826v1",
          "entry_id": "http://arxiv.org/abs/2602.18826v1",
          "title": "Coxeter planes as fixed points of Verlinde fusion rings",
          "summary": "For the Coxeter groups of ADE type, we provide a construction of their Coxeter planes as fixed points of actions of hypergroups associated to Verlinde fusion rings. This builds upon the well-known ADE classification of $\\mathbb{Z}_+$-modules over these fusion rings.",
          "authors": [
            "Max Boyle",
            "Edmund Heng"
          ],
          "published": "2026-02-21T12:58:47+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18805v1",
          "entry_id": "http://arxiv.org/abs/2602.18805v1",
          "title": "Finite basis problem for varieties of algebraic systems",
          "summary": "This is a survey on the finite basis problem for varieties of algebraic systems. Our exposition is in two directions:\n  (i) We give numerous examples of varieties which are not finitely based.\n  (ii) We give examples of important varieties with the property that they and their subvarieties are finitely based.\n  A special attention is paid on the varieties of semigroups, groups, associative, Lie and other nonassociative algebras.",
          "authors": [
            "Vesselin Drensky"
          ],
          "published": "2026-02-21T11:34:09+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18771v1",
          "entry_id": "http://arxiv.org/abs/2602.18771v1",
          "title": "A $B$-Restricted Clique Polynomial and Connections to Tanner's Inequality",
          "summary": "Let $G$ be a finite simple graph and $B \\subseteq V(G)$.\n  We study the \\emph{$B$-restricted clique polynomial} $C_B(G;x)$, including its weighted version allowing vertex multiplicities, as a versatile tool to capture structural properties of vertex subsets.\n  First, we develop a complete deletion theory for $C_B(G;x)$, including vertex and edge recurrences that generalize classical clique polynomial results.\n  These recurrences yield monotonicity principles for the largest negative root $ζ_G(B)$: it is monotone under induced subgraphs and reverse-monotone under spanning subgraphs.\n  Consequently, we derive explicit bounds on $B$-independence numbers, chromatic numbers, $B$-girth, and Hamiltonicity constraints, showing that $ζ_G(B)$ serves as a unifying local invariant.\n  Next, we connect $B$-clique polynomials to spectral graph theory.\n  For $(n,d,λ)$-graphs, spectral techniques, including the Expander Mixing Lemma and Tanner's inequality, provide uniform bounds on $B$-restricted clique coefficients, demonstrating that clique growth within $B$ is naturally controlled by the spectral gap.\n  Finally, we show that weighted $B$-clique polynomials encode \\emph{homomorphism constraints}.\n  Specifically, if $f: G \\to H$ is a surjective homomorphism mapping $B_G$ onto $B_H$, then $ζ_G(B_G) \\ge ζ_H(B_H)$, yielding a local \\emph{no-homomorphism criterion} based on $B$-roots.\n  Overall, $C_B(G;x)$ provides a unified framework capturing combinatorial, spectral, and homomorphic information in vertex-restricted analysis, highlighting its power for both global and local structural insights.",
          "authors": [
            "Hossein Teimoori Faal"
          ],
          "published": "2026-02-21T09:46:56+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18767v1",
          "entry_id": "http://arxiv.org/abs/2602.18767v1",
          "title": "Nazrin: Atomic Tactics for Graph Neural Networks for Theorem Proving in Lean 4",
          "summary": "In Machine-Assisted Theorem Proving, a theorem proving agent searches for a sequence of expressions and tactics that can prove a conjecture in a proof assistant.\n  In this work, we introduce several novel concepts and capabilities to address obstacles faced by machine-assisted theorem proving. We first present a set of \\textbf{atomic tactics}, a small finite set of tactics capable of proving any provable statement in Lean. We then introduce a \\textbf{transposing atomization} algorithm which turns arbitrary proof expressions into a series of atomic tactics. We next introduce the \\textbf{ExprGraph} data structure, which provides a succinct representation for Lean expressions. Finally, we present the \\textbf{Nazrin Prover}, a graph neural network-based theorem proving agent using atomic tactics and ExprGraph. Nazrin circumvents many challenges faced by existing proving agents by exclusively dispatching atomic tactics, and it is robust enough to both train and evaluate on consumer-grade hardware. We demonstrate the potential of tools like Nazrin using theorems from Lean's standard library and from Mathlib.",
          "authors": [
            "Leni Aniva",
            "Iori Oikawa",
            "David Dill",
            "Clark Barrett"
          ],
          "published": "2026-02-21T09:12:51+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18760v1",
          "entry_id": "http://arxiv.org/abs/2602.18760v1",
          "title": "Locating-dominating coalitions in graphs",
          "summary": "A set $D$ of vertices in a graph $G = (V, E)$ is a locating-dominating set (LD-set) if it is dominating and every two vertices $u$, $v$ of $V\\setminus D$ satisfy $N(u) \\cap D \\neq N(v) \\cap D$. Two disjoint sets $A,B\\subset V(G)$ form a locating-dominating coalition (for short, an LD-coalition) in $G$ if none of them is an LD-set in $G$ but their union $A\\cup B$ is an LD-set. A locating-dominating coalition partition (for short, an LDC-partition) is a vertex partition $Π$ such that every set of $Π$ is not an LD-set in $G,$ but forms an LD-coalition with another set of $Π$. The locating-domination coalition number of $G$, denoted by $C_{L}(G),$ equals the maximum cardinality of an LDC-partition of $G$. Our purpose in this paper is to initiate the study of locating-dominating coalitions in graphs. We first investigate the existence of LDC-partitions. We also obtain lower and upper bounds on $C_{L}(G)$. We characterize connected graphs $G$ of order $n\\ge 3$ satisfying $C_L(G) = n,$ as well as those trees $T$ such that $C_L(T)=n-1$. In addition, we determine the exact values of $C_L(G)$ for some classes of graphs. Moreover, we investigate the computational complexity of the decision problem associated with locating-dominating coalition partitions. To the best of our knowledge, this is the first work that addresses the algorithmic complexity of a decision problem related to coalition partitions, not only for this locating-dominating model but for coalition partitions in general.",
          "authors": [
            "M. Chellali",
            "A. A. Dobrynin",
            "F. Foucaud",
            "H. Golmohammadi",
            "J. C. Valenzuela-Tripodoro"
          ],
          "published": "2026-02-21T08:57:52+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18723v1",
          "entry_id": "http://arxiv.org/abs/2602.18723v1",
          "title": "What Distributed Computing Got Wrong: The Category Mistake That Turned Design Choices into Laws of Nature",
          "summary": "The foundational impossibility results of distributed computing -- the Fischer-Lynch-Paterson theorem, the Two Generals Problem, the CAP theorem -- are widely understood as discoveries about the physical limits of coordination. This paper argues that they are nothing of the sort. They are consequences of a category mistake: treating Forward-In-Time-Only (FITO) information flow as a law of nature rather than recognizing it as a design choice inherited from Shannon's channel model and Lamport's happened-before relation. We develop this argument in six steps. First, we introduce the category mistake framework from Ryle through Spekkens' ontic/epistemic distinction in quantum foundations. Second, we identify FITO as the hidden axiom that unifies the classical impossibility results. Third, we apply Spekkens' Leibnizian principle to show that FITO-based models contain surplus ontological structure. Fourth, we develop the counterfactual: what changes when FITO is dropped. Fifth, we demonstrate that the impossibility theorems are theorems about FITO systems, not about physics. Sixth, we sketch the transactional alternative -- bilateral interactions that dissolve the apparent impossibilities by replacing unidirectional message passing with atomic bilateral transactions. The implication is that distributed computing has spent fifty years optimizing within the wrong design space.",
          "authors": [
            "Paul Borrill"
          ],
          "published": "2026-02-21T05:16:56+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.18701v1",
          "entry_id": "http://arxiv.org/abs/2602.18701v1",
          "title": "Higher-order circuits",
          "summary": "We write down a series of basic laws for (strict) higher-order circuit diagrams. More precisely, we define higher-order circuit theories in terms of: (a) nesting, (b) temporal and spatial composition, and (c) equivalence between lower-order bipartite processes and higher-order bipartite states. In category-theoretic terms, these laws are expressed using enrichment and cotensors in symmetric polycategories, along with a frobenius-like coherence between them. We describe how these laws capture the salient features of higher-order quantum theory, and discover an upper bound for higher-order circuits: any higher-order circuit theory embeds into the theory of strong profunctors.",
          "authors": [
            "Matt Wilson"
          ],
          "published": "2026-02-21T03:12:34+00:00"
        }
      ],
      "interested_paper_ids": [],
      "summaries": {},
      "sent_paper_ids": [],
      "notification_sent": false,
      "retry_count": 0,
      "last_error": null,
      "created_at": "2026-02-25T02:34:07.046547+00:00",
      "updated_at": "2026-02-25T18:34:35.766559+00:00",
      "finalized_at": null
    }
  ]
}