{
  "schema_version": 1,
  "jobs": [
    {
      "pipeline_id": "20260222T142657Z-15ae7fc3",
      "status": "interest_running",
      "interest_job_name": "batches/91opddsfdc7yx0kvn032jk0wqlx5xg5bf8eq",
      "summarize_job_name": null,
      "papers": [
        {
          "paper_id": "http://arxiv.org/abs/2602.17661v1",
          "entry_id": "http://arxiv.org/abs/2602.17661v1",
          "title": "Dehn quandles of surfaces and their bounded cohomology",
          "summary": "We introduce new families of quandles that serve as invariants for classifying closed orientable surfaces. These families generalize the classical Dehn quandle and are defined, respectively, on isotopy classes of unoriented closed curves and on integral weighted multicurves. We establish their fundamental algebraic properties and construct a natural quandle covering that relates them. We then analyze their metric properties, showing that these quandles are unbounded with respect to the quandle metric. Next, we compute their second bounded quandle cohomology, proving it to be infinite-dimensional. We also establish a version of the Gromov Mapping Theorem, showing that the natural map from an abelian quandle extension onto the original quandle induces an injection on bounded quandle cohomology in every dimension. Finally, inspired by recent developments in quandle rings, we analyze idempotents in the integral quandle rings arising from the classical Dehn quandle of a surface.",
          "authors": [
            "Pankaj Kapari",
            "Deepanshi Saraf",
            "Mahender Singh"
          ],
          "published": "2026-02-19T18:59:36+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17637v1",
          "entry_id": "http://arxiv.org/abs/2602.17637v1",
          "title": "On Sets of Monochromatic Objects in Bicolored Point Sets",
          "summary": "Let $P$ be a set of $n$ points in the plane, not all on a line, each colored \\emph{red} or \\emph{blue}. The classical Motzkin--Rabin theorem guarantees the existence of a \\emph{monochromatic} line. Motivated by the seminal work of Green and Tao (2013) on the Sylvester-Gallai theorem, we investigate the quantitative and structural properties of monochromatic geometric objects, such as lines, circles, and conics.\n  We first show that if no line contains more than three points, then for all sufficiently large $n$ there are at least $n^{2}/24 - O(1)$ monochromatic lines. We then show a converse of a theorem of Jamison (1986): Given $n\\ge 6$ blue points and $n$ red points, if the blue points lie on a conic and every line through two blue points contains a red point, then all red points are collinear. We also settle the smallest nontrivial case of a conjecture of Milićević (2018) by showing that if we have $5$ blue points with no three collinear and $5$ red points, if the blue points lie on a conic and every line through two blue points contains a red point, then all $10$ points lie on a cubic curve. Further, we analyze the random setting and show that, for any non-collinear set of $n\\ge 10$ points independently colored red or blue, the expected number of monochromatic lines is minimized by the \\emph{near-pencil} configuration. Finally, we examine monochromatic circles and conics, and exhibit several natural families in which no such monochromatic objects exist.",
          "authors": [
            "Sujoy Bhore",
            "Konrad Swanepoel"
          ],
          "published": "2026-02-19T18:50:35+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17631v1",
          "entry_id": "http://arxiv.org/abs/2602.17631v1",
          "title": "The Hidden Nature of Non-Markovianity",
          "summary": "The theory of open quantum systems served as a tool to prepare entanglement at the beginning stage of quantum technology and more recently provides an important tool for state preparation. Dynamics given by time dependent Lindbladians are Markovian and lead to decoherence, decay of correlation and convergence to equilibrium. In contrast Non-Markovian evolutions can outperform their Markovian counterparts by enhancing memory. In this letter we compare the trajectories of Markovian and Non-Markovian evolutions starting from a fixed initial value. It turns out that under mild assumptions every trajectory can be obtained from a family of time dependent Lindbladians. Hence Non-Markovianity is invisible if single trajectories are concerned.",
          "authors": [
            "Jihong Cai",
            "Advith Govindarajan",
            "Marius Junge"
          ],
          "published": "2026-02-19T18:47:28+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17567v1",
          "entry_id": "http://arxiv.org/abs/2602.17567v1",
          "title": "Canonical labelling of random regular graphs",
          "summary": "We prove that whenever $d=d(n)\\to\\infty$ and $n-d\\to\\infty$ as $n\\to\\infty$, then with high probability for any non-trivial initial colouring, the colour refinement algorithm distinguishes all vertices of the random regular graph $\\mathcal{G}_{n,d}$. This, in particular, implies that with high probability $\\mathcal{G}_{n,d}$ admits a canonical labelling computable in time $O(\\min\\{n^ω,nd^2+nd\\log n\\})$, where $ω<2.372$ is the matrix multiplication exponent.",
          "authors": [
            "Mikhail Isaev",
            "Tamás Makai",
            "Brendan McKay",
            "Pawel Pralat",
            "Jane Tan",
            "Maksim Zhukovskii"
          ],
          "published": "2026-02-19T17:23:31+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17562v1",
          "entry_id": "http://arxiv.org/abs/2602.17562v1",
          "title": "On the Linearization of Flat Multi-Input Systems via Prolongations",
          "summary": "We examine when differentially flat nonlinear control systems with more than two inputs can be rendered static feedback linearizable by prolongations of suitably chosen inputs after applying a static input transformation. Building on the structure of the time derivatives of a flat output, we derive sufficient conditions that guarantee such prolongations yield a static feedback linearizable system. In the two-input case, prior work established precise links between relative degrees, the highest derivative orders occurring in a flat parameterization, and the minimal dimension of a linearizing dynamic extension, leading to necessary and sufficient criteria for systems that become static feedback linearizable after at most two prolongations of such suitably chosen inputs. This work extends this analysis to systems with more than two inputs and derives particular results for the three-input case.",
          "authors": [
            "Georg Hartl",
            "Conrad Gstöttner",
            "Markus Schöberl"
          ],
          "published": "2026-02-19T17:17:59+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17530v1",
          "entry_id": "http://arxiv.org/abs/2602.17530v1",
          "title": "Provably Explaining Neural Additive Models",
          "summary": "Despite significant progress in post-hoc explanation methods for neural networks, many remain heuristic and lack provable guarantees. A key approach for obtaining explanations with provable guarantees is by identifying a cardinally-minimal subset of input features which by itself is provably sufficient to determine the prediction. However, for standard neural networks, this task is often computationally infeasible, as it demands a worst-case exponential number of verification queries in the number of input features, each of which is NP-hard.\n  In this work, we show that for Neural Additive Models (NAMs), a recent and more interpretable neural network family, we can efficiently generate explanations with such guarantees. We present a new model-specific algorithm for NAMs that generates provably cardinally-minimal explanations using only a logarithmic number of verification queries\n  in the number of input features, after a parallelized preprocessing step with logarithmic runtime in the required precision is applied to each small univariate NAM component.\n  Our algorithm not only makes the task of obtaining cardinally-minimal explanations feasible, but even outperforms existing algorithms designed to find the relaxed variant of subset-minimal explanations - which may be larger and less informative but easier to compute - despite our algorithm solving a much more difficult task.\n  Our experiments demonstrate that, compared to previous algorithms, our approach provides provably smaller explanations than existing works and substantially reduces the computation time. Moreover, we show that our generated provable explanations offer benefits that are unattainable by standard sampling-based techniques typically used to interpret NAMs.",
          "authors": [
            "Shahaf Bassan",
            "Yizhak Yisrael Elboher",
            "Tobias Ladner",
            "Volkan Şahin",
            "Jan Kretinsky",
            "Matthias Althoff",
            "Guy Katz"
          ],
          "published": "2026-02-19T16:42:29+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17506v1",
          "entry_id": "http://arxiv.org/abs/2602.17506v1",
          "title": "Scattering in the Positive Energy Isosceles Three-Body Problem",
          "summary": "In the three-body problem with positive energy, solutions which avoid triple collision have the property that the size of the triangle formed by the bodies tends to infinity as $t\\rightarrow \\pm\\infty$. Furthermore, the triangles have well-defined asymptotic shapes $s_\\pm$. The scattering problems asks which asymptotic shape $s_+$ can occur for a given choice of $s_-$. Previous work shows that this can be viewed as the problem of finding heteroclinic orbits connecting equilibrium points on a boundary manifold ``at infinity'' and some results were obtained for solutions which avoid collisions. The goal of this paper is to study the scattering effect of binary and near-triple collisions in a simple setting -- the isosceles three-body problem. The details depend on the mass parameters but in many cases, a fixed isosceles initial shape $s_-$ scatters to essentially all possible isosceles shapes $s_+$.",
          "authors": [
            "Richard Moeckel"
          ],
          "published": "2026-02-19T16:21:22+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17482v1",
          "entry_id": "http://arxiv.org/abs/2602.17482v1",
          "title": "Compiling Quantum Lambda-Terms into Circuits via the Geometry of Interaction",
          "summary": "We present an algorithm turning any term of a linear quantum $λ$-calculus into a quantum circuit. The essential ingredient behind the proposed algorithm is Girard's geometry of interaction, which, differently from its well-known uses from the literature, is here leveraged to perform as much of the classical computation as possible, at the same time producing a circuit that, when evaluated, performs all the quantum operations in the underlying $λ$-term. We identify higher-order control flow as the primary obstacle towards efficient solutions to the problem at hand. Notably, geometry of interaction proves sufficiently flexible to enable efficient compilation in many cases, while still supporting a total compilation procedure. Finally, we characterize through a type system those $λ$-terms for which compilation can be performed efficiently.",
          "authors": [
            "Kostia Chardonnet",
            "Ugo Dal Lago",
            "Naohiko Hoshino",
            "Paolo Pistone"
          ],
          "published": "2026-02-19T15:50:47+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17480v1",
          "entry_id": "http://arxiv.org/abs/2602.17480v1",
          "title": "Directed type theory, with a twist",
          "summary": "In recent years, Homotopy Type Theory (HoTT) has had great success both as a foundation of mathematics and as internal language to reason about $\\infty$-groupoids (a.k.a. spaces). However, in many areas of mathematics and computer science, it is often the case that it is categories, not groupoids, which are the more important structures to consider. For this reason, multiple directed type theories have been proposed, i.e., theories whose semantics are based on categories. In this paper, we present a new such type theory, Twisted Type Theory (TTT). It features a novel ``twisting'' operation on types: given a type that depends both contravariantly and covariantly on some variables, its twist is a new type that depends only covariantly on the same variables. To provide the semantics of this operation, we introduce the notion of dependent 2-sided fibrations (D2SFibs), which generalize Street's notion of 2-sided fibrations. We develop the basic theory of D2SFibs, as well as characterize them through a straightening-unstraightening theorem. With these results in hand, we introduce a new elimination rule for Hom-types. We argue that our syntax and semantics satisfy key features that allow reasoning in a HoTT-like style, which allows us to mimic the proof techniques of that setting. We end the paper by exemplifying this, and use TTT to reason about categories, giving a syntactic proof of Yoneda's lemma.",
          "authors": [
            "Fernando Rafael Chu Rivera",
            "Paige Randall North"
          ],
          "published": "2026-02-19T15:48:43+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17459v1",
          "entry_id": "http://arxiv.org/abs/2602.17459v1",
          "title": "Uniform Set Systems with Uniform Witnesses",
          "summary": "Frankl--Pach and Erdős conjectured that any $(d+1)$-uniform set family $\\mathcal{F}\\subseteq \\binom{[n]}{d+1}$ with VC-dimension at most $d$ has size at most $\\binom{n-1}{d}$ when $n$ is sufficiently large. Ahlswede and Khachatrian showed that the conjecture is false by giving a counterexample of size $\\binom{n-1}{d}+\\binom{n-4}{d-2}$.\n  For a set family $\\mathcal{F}\\subseteq \\binom{[n]}{d+1}$, the condition that its VC-dimension is at most $d$ can be reformulated as follows: for any $F\\in\\mathcal{F}$, there exists a set $B_F\\subseteq F$ such that $F\\cap F'\\neq B_F$ for all $F'\\in\\mathcal{F}$. In this direction, the first author, Xu, Yip, and Zhang conjectured that the bound $\\binom{n-1}{d}$ holds if we further assume that $|B_F|=s$ for every $F\\in \\mathcal{F}$ and for some fixed $0\\leq s\\leq d$.\n  The case $s=0$ is exactly the Erdős--Ko--Rado theorem, and the cases $s\\in \\{1,d\\}$ were proved in the paper by the first author, Xu, Yip, and Zhang. In this short note, we show that the conjecture holds when $s\\leq d/2$, and the maximal constructions are stars. Moreover, we construct non-star set families of size $\\binom{n-1}{d}$ satisfying the condition for $d/2<s\\leq d-1$, which suggests that the problem is substantially different in these cases.",
          "authors": [
            "Ting-Wei Chao",
            "Zixuan Xu",
            "Dmitrii Zakharov"
          ],
          "published": "2026-02-19T15:25:56+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17444v1",
          "entry_id": "http://arxiv.org/abs/2602.17444v1",
          "title": "Design of low-energy transfers in cislunar space using sequences of lobe dynamics",
          "summary": "Dynamical structures in the circular restricted three-body problem (CR3BP) are fundamental for designing low-energy transfers, as they aid in analyzing phase space transport and designing desirable trajectories. This study focuses on lobe dynamics to exploit local chaotic transport around celestial bodies, and proposes a new method for systematically designing low-energy transfers by combining multiple lobe dynamics. A graph-based framework is constructed to explore possible transfer paths between departure and arrival orbits, reducing the complexity of the combinatorial optimization problem for designing fuel-efficient transfers. Based on this graph, low-energy transfer trajectories are constructed by connecting chaotic orbits within lobes. The resulting optimal trajectory in the Earth--Moon CR3BP is then converted into an optimal transfer in the bicircular restricted four-body problem using multiple shooting. The obtained transfer is compared with existing optimal solutions to demonstrate the effectiveness of the proposed method.",
          "authors": [
            "Naoki Hiraiwa",
            "Mai Bando",
            "Yuzuru Sato",
            "Shinji Hokamoto"
          ],
          "published": "2026-02-19T15:12:22+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17412v1",
          "entry_id": "http://arxiv.org/abs/2602.17412v1",
          "title": "On problems of Erdős and Baumann-Briggs on minimising the density of $s$-cliques in graphs with forbidden subgraphs",
          "summary": "Using flag algebras, we prove that the minimum density of $8$-cliques in a large graph without an independent set of size $3$ is $491411/268435456+o(1)$, thus resolving a new case of an old problem of Erdős [Magyar Tud. Akad. Mat. Kutató Int. Közl. 7 (1962) 459-464]. Also, we establish some other results of this type; for example, we show that the minimum $s$-clique density in a large graph with no independent set of size 3 nor an induced 5-cycle is $2^{1-s}+o(1)$ when $s=4,5,6$. For each of these results, we also describe the structure of all extremal and almost extremal graphs of large order $n$.\n  These results are applied to give an asymptotic solution to a number of cases of the problem of Baumann and Briggs [Electronic J Comb 32 (2025) P1.22] which asks for the minimum number of $s$-cliques in an $n$-vertex graph in which every $k$-set spans a $t$-clique.",
          "authors": [
            "Levente Bodnár",
            "Oleg Pikhurko"
          ],
          "published": "2026-02-19T14:42:49+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17411v1",
          "entry_id": "http://arxiv.org/abs/2602.17411v1",
          "title": "Cohomological and quasi-isometric diversity of groups with property $R_\\infty$",
          "summary": "How rich is the collection of groups with a given prominent property? In this work we approach this question for property~$R_\\infty$, which says that every automorphism $\\varphi$ of a given group has infinitely many orbits under the $\\varphi$-twisted conjugation action $(g,x) \\mapsto gx\\varphi(g)^{-1}$. Generalising the soluble groups of Herbert Abels to a large family over many integral domains, we prove that most such groups have property~$R_\\infty$ drawing from a classical result of Levchuk and a swift observation by Jabara. Within the broad programme of cataloguing finitely generated groups up to quasi-isometry, our groups can then be separated by finiteness properties and cohomological dimension whilst having~$R_\\infty$. Abandoning finite presentability, we establish that property~$R_\\infty$ is very abundant in a strong sense: there are uncountably many finitely generated groups (which can all be chosen to be amenable or non-amenable) that have~$R_\\infty$ and are pairwise not quasi-isometric. The proofs vary in flavour. On the amenable side we use carefully constructed quotients of Abels' groups and a general strategy for quasi-isometric diversity established by Minasyan, Osin, and Witzel. For the non-amenable constructions we rely on modifications of Leary's type $\\mathtt{FP}$ groups, further cohomological arguments, and recent powerful criteria for~$R_\\infty$ due to Iveson, Martino, Sgobbi, Wong, and Fournier-Facio.",
          "authors": [
            "Karel Dekimpe",
            "Paula M. Lins de Araujo",
            "Yuri Santos Rego"
          ],
          "published": "2026-02-19T14:39:28+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17401v1",
          "entry_id": "http://arxiv.org/abs/2602.17401v1",
          "title": "On a Quadratic Relation Between Stanley-Wilf Limits and Füredi-Hajnal Limits",
          "summary": "For a permutation matrix $P$, let $s_P$ denote its Stanley-Wilf limit, the exponential growth rate of the number of $n\\times n$ permutation matrices avoiding $P$. Let $c_P$ denote its Füredi-Hajnal limit, which is the limit $\\displaystyle \\lim_{n \\to \\infty} \\text{ex}(n,P)/n$ where $\\text{ex}(n,P)$ is the maximum number of ones in an $n\\times n$ $0$-$1$ matrix avoiding $P$. Cibulka proved the universal quadratic bound $s_P\\leq 2.88\\,c_P^2$. In this note we improve the constants in Cibulka's result through a so-called ``block contraction\" argument. Defining \\[ F(c)=\\inf_{t\\in\\mathbb{N}} \\frac{(t!)^{1/t}\\,15^{\\,c/t}}{c}, \\] for $c>0$, this leads us to the revised inequality $s_P\\leq F(c_P)\\,c_P^2$. In particular, $F(c)=\\log 15+o(1) \\approx 2.70805\\ldots +o(1)$ as $c\\to\\infty$, and the constant improves $2.88$ once $c_P \\geq 17$.",
          "authors": [
            "Mohamed Omar"
          ],
          "published": "2026-02-19T14:29:30+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17346v1",
          "entry_id": "http://arxiv.org/abs/2602.17346v1",
          "title": "Partial Optimality in the Preordering Problem",
          "summary": "Preordering is a generalization of clustering and partial ordering with applications in bioinformatics and social network analysis. Given a finite set $V$ and a value $c_{ab} \\in \\mathbb{R}$ for every ordered pair $ab$ of elements of $V$, the preordering problem asks for a preorder $\\lesssim$ on $V$ that maximizes the sum of the values of those pairs $ab$ for which $a \\lesssim b$. Building on the state of the art in solving this NP-hard problem partially, we contribute new partial optimality conditions and efficient algorithms for deciding these conditions. In experiments with real and synthetic data, these new conditions increase, in particular, the fraction of pairs $ab$ for which it is decided efficiently that $a \\not\\lesssim b$ in an optimal preorder.",
          "authors": [
            "David Stein",
            "Jannik Irmai",
            "Bjoern Andres"
          ],
          "published": "2026-02-19T13:29:09+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17309v1",
          "entry_id": "http://arxiv.org/abs/2602.17309v1",
          "title": "Some Remarks on Marginal Code Languages",
          "summary": "A prefix code L satisfies the condition that no word of L is a proper prefix of another word of L. Recently, Ko, Han and Salomaa relaxed this condition by allowing a word of L to be a proper prefix of at most k words of L, for some `margin' k, introducing thus the class of k-prefix-free languages, as well as the similar classes of k-suffix-free and k-infix-free languages. Here we unify the definitions of these three classes of languages into one uniform definition in two ways: via the method of partial orders and via the method of transducers. Thus, for any known class of code-related languages definable via the transducer method, one gets a marginal version of that class. Building on the techniques of Ko, Han and Salomaa, we discuss the \\emph{uniform} satisfaction and maximality problems for marginal classes of languages.",
          "authors": [
            "Stavros Konstantinidis"
          ],
          "published": "2026-02-19T12:19:43+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17301v1",
          "entry_id": "http://arxiv.org/abs/2602.17301v1",
          "title": "Grothendieck Topologies and Sheaf-Theoretic Foundations of Cryptographic Security: Attacker Models and $Σ$-Protocols as the First Step",
          "summary": "Cryptographic security is traditionally formulated using game-based or simulation-based definitions. In this paper, we propose a structural reformulation of cryptographic security based on Grothendieck topologies and sheaf theory.\n  Our key idea is to model attacker observations as a Grothendieck site, where covering families represent admissible decompositions of partial information determined by efficient simulation. Within this framework, protocol transcripts naturally form sheaves, and security properties arise as geometric conditions.\n  As a first step, we focus on $Σ$-protocols. We show that the transcript structure of any $Σ$-protocol defines a torsor in the associated topos of sheaves. Local triviality of this torsor corresponds to zero-knowledge, while the absence of global sections reflects soundness. A concrete analysis of the Schnorr $Σ$-protocol is provided to illustrate the construction.\n  This sheaf-theoretic perspective offers a conceptual explanation of simulation-based security and suggests a geometric foundation for further cryptographic abstractions.",
          "authors": [
            "Takao Inoué"
          ],
          "published": "2026-02-19T12:11:35+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17286v1",
          "entry_id": "http://arxiv.org/abs/2602.17286v1",
          "title": "Comparing Numbers of Diagonal Subsemigroups and Congruences for Semigroups",
          "summary": "Given a semigroup $S$, a diagonal subsemigroup $ρ$ is defined to be a reflexive and compatible relation on $S$, i.e. a subsemigroup of the direct square $S\\times S$ containing the diagonal $\\{ (s,s)\\colon s\\in S\\}$. When $S$ is finite, we define the DSC coefficient $χ(S)$ to be the ratio of the number of congruences to the number of diagonal subsemigroups. In a previous work we observed that $χ(S) = 1$ if and only if $S$ is a group. Here we show that for any rational $α$ with $0 < α\\leq 1$, there exists a semigroup with $χ(S) = α$. We do this by utilizing the Rees matrix construction and adapting the congruence classification of such semigroups to describe their diagonal subsemigroups.",
          "authors": [
            "Callum Barber",
            "Nik Ruškuc"
          ],
          "published": "2026-02-19T11:46:06+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17276v1",
          "entry_id": "http://arxiv.org/abs/2602.17276v1",
          "title": "RLGT: A reinforcement learning framework for extremal graph theory",
          "summary": "Reinforcement learning (RL) is a subfield of machine learning that focuses on developing models that can autonomously learn optimal decision-making strategies over time. In a recent pioneering paper, Wagner demonstrated how the Deep Cross-Entropy RL method can be applied to tackle various problems from extremal graph theory by reformulating them as combinatorial optimization problems. Subsequently, many researchers became interested in refining and extending the framework introduced by Wagner, thereby creating various RL environments specialized for graph theory. Moreover, a number of problems from extremal graph theory were solved through the use of RL. In particular, several inequalities concerning the Laplacian spectral radius of graphs were refuted, new lower bounds were obtained for certain Ramsey numbers, and contributions were made to the Turán-type extremal problem in which the forbidden structures are cycles of length three and four. Here, we present Reinforcement Learning for Graph Theory (RLGT), a novel RL framework that systematizes the previous work and provides support for both undirected and directed graphs, with or without loops, and with an arbitrary number of edge colors. The framework efficiently represents graphs and aims to facilitate future RL-based research in extremal graph theory through optimized computational performance and a clean and modular design.",
          "authors": [
            "Ivan Damnjanović",
            "Uroš Milivojević",
            "Irena Đorđević",
            "Dragan Stevanović"
          ],
          "published": "2026-02-19T11:25:22+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17253v1",
          "entry_id": "http://arxiv.org/abs/2602.17253v1",
          "title": "Symmetric (co)homology polytopes",
          "summary": "Symmetric edge polytopes are a recent and well-studied family of centrally symmetric polytopes arising from graphs. In this paper, we introduce a generalization of this family to arbitrary simplicial complexes. We show how topological properties of a simplicial complex can be translated into geometric properties of such polytopes, and vice versa. We study the integer decomposition property, facets and reflexivity of these polytopes. Using Gröbner basis techniques, we obtain a (not necessarily unimodular) triangulation of these polytopes. Due to the tools we use, most of our results hold in the more general setting of arbitrary centrally symmetric polytopes.",
          "authors": [
            "Torben Donzelmann",
            "Thiago Holleben",
            "Martina Juhnke"
          ],
          "published": "2026-02-19T10:57:00+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17242v1",
          "entry_id": "http://arxiv.org/abs/2602.17242v1",
          "title": "TAPO-Structured Description Logic for Information Behavior: Procedural and Oracle-Based Extensions",
          "summary": "We introduce \\emph{TAPO-Structured Description Logic} (TAPO--DL), a formal extension of classical description logic designed to model \\emph{information behavior} as a structured, dynamic process.\n  TAPO--DL extends the standard T--Box/A--Box architecture with two additional layers: a \\emph{Procedural Box} (P--Box), which supports concept-driven, imperative-style programs such as conditional and iterative actions, and an \\emph{Oracle Box} (O--Box), which formalizes controlled interaction with external information sources. While the terminological and assertional components capture static conceptual and factual knowledge, the procedural and oracle-based components enable the explicit representation of information-generating actions and external validation.\n  We provide a unified semantic framework for TAPO--DL based on a co-generative, sheaf-theoretic interpretation, in which local informational states are modeled as sections and informational stability corresponds to the existence of coherent global structures. Within this setting, informational truth is characterized as stability under repeated agentive interaction rather than correspondence to a fixed global state.\n  By integrating description logic with procedural dynamics, oracle-based reasoning, and sheaf-theoretic semantics, TAPO--DL offers a principled formal framework for analyzing information behavior in contexts involving interaction, uncertainty, and contextuality.",
          "authors": [
            "Takao Inoué"
          ],
          "published": "2026-02-19T10:43:21+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17240v1",
          "entry_id": "http://arxiv.org/abs/2602.17240v1",
          "title": "Serre depth and local cohomology",
          "summary": "We introduce a fundamental homological invariant, called \\emph{Serre depth}, which stratifies Serre's conditions in the same way that depth stratifies the Cohen-Macaulay property. We study the Serre depths of modules over arbitrary Noetherian local rings and over standard graded algebras over a field, extending the polynomial ring case due to Muta and Terai. Under mild hypotheses, we show that the $r$-th Serre depth of a finitely generated module $M$ measures the deviation of $M$ from satisfying Serre's condition $(S_r)$. The main results of the paper can be summarized as follows:\n  (i) We establish the basic properties of Serre depth and prove that it is invariant under completion.\n  (ii) If the base ring $R$ is a homomorphic image of a Gorenstein ring, we show that a finitely generated $R$-module $M$ is equidimensional and satisfies $(S_r)$ if and only if its $r$-th Serre depth equals its Krull dimension. Analogous statements are obtained for schemes.\n  (iii) For a homogeneous ideal in a standard graded polynomial ring over a field, we compare its Serre depths with those of its initial ideal.\n  (iv) We characterize the Serre depths of a monomial ideal in terms of its skeletons and prove that the Serre depths of sufficiently large powers of a monomial ideal stabilize; the proof uses Presburger arithmetic.",
          "authors": [
            "Antonino Ficarra"
          ],
          "published": "2026-02-19T10:37:30+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17237v1",
          "entry_id": "http://arxiv.org/abs/2602.17237v1",
          "title": "Disjunction Composition of BDD Transition Systems for Model-Based Testing",
          "summary": "We introduce a compositional approach to model-based test generation in Behavior-Driven Development (BDD). BDD is an agile methodology in which system behavior is specified through textual scenarios that, in our approach, are translated into transition systems used for model-based testing. This paper formally defines disjunction composition, to combine BDD transition systems that represent alternative system behaviors. Disjunction composition allows for modeling and testing the integrated behavior while ensuring that the testing power of the original set of scenarios is preserved. This is proved using a symbolic semantics for BDD transition systems, with the property that the symbolic equivalence of two BDD transition systems guarantees that they fail the same test cases. Also, we demonstrate the potential of disjunction composition by applying the composition in an industrial case study.",
          "authors": [
            "Tannaz Zameni",
            "Petra van den Bos",
            "Arend Rensink"
          ],
          "published": "2026-02-19T10:33:50+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17236v1",
          "entry_id": "http://arxiv.org/abs/2602.17236v1",
          "title": "Characterization of tangent quasicircles and quasiannuli",
          "summary": "We give a necessary and sufficient condition so that a pair of disjoint Jordan regions in the sphere can be quasiconformally mapped to a pair of disks. As a consequence, we obtain a simple characterization that involves Lipschitz functions for the case that one of the Jordan regions is a half-plane. We apply these results to prove that all polynomial cusps are quasiconformally equivalent and that a quasisymmetric embedding of the union of two disjoint disks extends to a quasiconformal map of the sphere, quantitatively. Also, in combination with previous work of the author, we obtain a new characterization of compact sets that are quasiconformally equivalent to Schottky sets.",
          "authors": [
            "Dimitrios Ntalampekos"
          ],
          "published": "2026-02-19T10:30:48+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17210v1",
          "entry_id": "http://arxiv.org/abs/2602.17210v1",
          "title": "Bilateral parking procedures",
          "summary": "We introduce the class of bilateral parking procedures on the integer line. While cars try to park in the nearest available spot to their right in the classical case, we consider more general parking rules that allow cars to use the nearest available spot to their left. We show that for a natural subclass of local procedures, the number of corresponding parking functions of length $r$ is always equal to $(r+1)^{r-1}$. The setting can be extended to probabilistic procedures, in which the decision to park left or right is random. We finally describe how bilateral procedures can naturally be encoded by certain labeled binary forests, whose combinatorics shed light on several results from the literature.",
          "authors": [
            "Philippe Nadeau"
          ],
          "published": "2026-02-19T10:02:09+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17179v1",
          "entry_id": "http://arxiv.org/abs/2602.17179v1",
          "title": "Multispecies inhomogeneous $t$-PushTASEP with general capacity",
          "summary": "We study an $n$-species $t$-PushTASEP, an integrable long-range stochastic process, on a one-dimensional periodic lattice with inhomogeneities $x_1,\\ldots,x_L$ and arbitrary capacity $l$ at each lattice site. The Markov matrix is identified with an alternating sum of commuting transfer matrices over all fundamental representations of $U_t(\\widehat{sl}_{n+1})$. Stationary probabilities are expressed in a matrix product form involving a fusion of quantized corner transfer matrices for the strange five-vertex model introduced by Okado, Scrimshaw, and the second author. The resulting partition function, which serves as the normalization factor of the stationary probabilities, is obtained from the $l=1$ case by a finite plethystic substitution of length $l$.",
          "authors": [
            "Arvind Ayyer",
            "Atsuo Kuniba"
          ],
          "published": "2026-02-19T08:52:26+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17142v1",
          "entry_id": "http://arxiv.org/abs/2602.17142v1",
          "title": "Generating Rely-Guarantee Conditions with the Conditional-Writes Domain",
          "summary": "Abstract interpretation has been shown to be a promising technique for the thread-modular verification of concurrent programs. Central to this is the generation of interferences, in the form of rely-guarantee conditions, conforming to a user-chosen structure. In this work, we introduce one such structure called the conditional-writes domain, designed for programs where it suffices to establish only the conditions under which particular variables are written to by each thread. We formalise our analysis within a novel abstract interpretation framework that is highly modular and can be easily extended to capture other structures for rely-guarantee conditions. We formalise two versions of our approach and evaluate their implementations on a simple programming language.",
          "authors": [
            "James Tobler",
            "Graeme Smith"
          ],
          "published": "2026-02-19T07:34:25+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17089v1",
          "entry_id": "http://arxiv.org/abs/2602.17089v1",
          "title": "Synergizing Transport-Based Generative Models and Latent Geometry for Stochastic Closure Modeling",
          "summary": "Diffusion models recently developed for generative AI tasks can produce high-quality samples while still maintaining diversity among samples to promote mode coverage, providing a promising path for learning stochastic closure models. Compared to other types of generative AI models, such as GANs and VAEs, the sampling speed is known as a key disadvantage of diffusion models. By systematically comparing transport-based generative models on a numerical example of 2D Kolmogorov flows, we show that flow matching in a lower-dimensional latent space is suited for fast sampling of stochastic closure models, enabling single-step sampling that is up to two orders of magnitude faster than iterative diffusion-based approaches. To control the latent space distortion and thus ensure the physical fidelity of the sampled closure term, we compare the implicit regularization offered by a joint training scheme against two explicit regularizers: metric-preserving (MP) and geometry-aware (GA) constraints. Besides offering a faster sampling speed, both explicitly and implicitly regularized latent spaces inherit the key topological information from the lower-dimensional manifold of the original complex dynamical system, which enables the learning of stochastic closure models without demanding a huge amount of training data.",
          "authors": [
            "Xinghao Dong",
            "Huchen Yang",
            "Jin-long Wu"
          ],
          "published": "2026-02-19T05:24:00+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.16993v1",
          "entry_id": "http://arxiv.org/abs/2602.16993v1",
          "title": "Neural codes via homological invariants of polarized neural ideals",
          "summary": "For a neural code $\\mathcal{C}\\subseteq\\mathbb{F}_2^n$, polarizing the canonical form generators of the neural ideal $J_{\\mathcal{C}}$ yields a squarefree monomial ideal $\\mathcal{P}(J_{\\mathcal{C}})\\subset k[x_1,\\dots,x_n,y_1,\\dots,y_n]$, the polarized neural ideal, and an associated simplicial complex $Δ_{\\mathcal{C}}$, the polar complex. We study the graded invariants $\\operatorname{pd}(\\mathcal{P}(J_{\\mathcal{C}}))$ and $\\operatorname{reg}(\\mathcal{P}(J_{\\mathcal{C}}))$ via the topology of $Δ_{\\mathcal{C}}$, showing that simple geometric features of the Hamming cube $\\mathbb{F}_2^n$ (with Hamming distance) organize their extremal behavior. We prove $\\operatorname{reg}(\\mathcal{P}(J_{\\mathcal{C}}))\\le 2n-1$, with equality precisely when $\\mathcal{C}$ is obtained from $\\mathbb{F}_2^n$ by deleting an antipodal pair. Using connectedness properties of induced subcomplexes of $Δ_{\\mathcal{C}}$, we obtain $\\operatorname{pd}(\\mathcal{P}(J_{\\mathcal{C}}))\\le 2n-3$, and we give an explicit family of codes attaining equality, each consisting of antipodal pairs. At the opposite end, we identify the cube geometry behind the smallest values: $\\operatorname{reg}(\\mathcal{P}(J_{\\mathcal{C}}))=1$ forces $\\mathcal{C}$ to be a coordinate subcube of $\\mathbb{F}_2^n$, while $\\operatorname{pd}(\\mathcal{P}(J_{\\mathcal{C}}))=0$ forces $\\mathcal{C}$ to be the complement of one. Finally, we construct families realizing large regions of the $(\\operatorname{pd},\\operatorname{reg})$-plot for fixed $n$.",
          "authors": [
            "Selvi Kara",
            "Ellie Lew"
          ],
          "published": "2026-02-19T01:37:44+00:00"
        }
      ],
      "interested_paper_ids": [],
      "summaries": {},
      "sent_paper_ids": [],
      "notification_sent": false,
      "retry_count": 0,
      "last_error": null,
      "created_at": "2026-02-22T14:26:57.007907+00:00",
      "updated_at": "2026-02-23T08:41:44.963563+00:00",
      "finalized_at": null
    },
    {
      "pipeline_id": "20260223T023632Z-04906c7c",
      "status": "interest_running",
      "interest_job_name": "batches/1mm4e2c460i9ega61utz5gadwk64bcpauuyf",
      "summarize_job_name": null,
      "papers": [
        {
          "paper_id": "http://arxiv.org/abs/2602.17859v1",
          "entry_id": "http://arxiv.org/abs/2602.17859v1",
          "title": "A discrete view of Gromov's filling area conjecture",
          "summary": "A compact metric surface $M$ isometrically fills a closed metric curve $C$ if $\\partial M=C$ and $d_M(x,y)=d_C(x,y)$ for every $x,y\\in C=\\partial M$; that is, $M$ does not introduce any ``shortcuts'' between points on its boundary. Gromov's filling area conjecture in differential geometry from 1983 asserts that among all compact, orientable Riemannian surfaces which isometrically fill the Riemannian circle, the one with the smallest surface area is the hemisphere. Gromov demonstrated that this is indeed the case if $M$ is homeomorphic to the disk. While Gromov's conjecture has since been verified in some other cases, the full conjecture remains unresolved.\n  In this paper, we consider a discrete analogue of Gromov's problem, which is likely natural to those who study graph embeddings on arbitrary surfaces. Using standard graph-theoretic tools, such as Menger's theorem, we obtain reasonable asymptotic bounds on this discrete variant. We then demonstrate how these discrete bounds can be translated to the continuous setting, showing that any isometric filling of the Riemannian circle of length $2π$ has surface area at least $1.36π$ (the hemisphere has surface area $2π$). This appears to be the first quantitative lower-bound on Gromov's problem that applies to arbitrary isometric fillings.",
          "authors": [
            "Joseph Briggs",
            "Chris Wells"
          ],
          "published": "2026-02-19T21:46:25+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17852v1",
          "entry_id": "http://arxiv.org/abs/2602.17852v1",
          "title": "Mean-field dynamics of attractive resource interaction: From uniform to aggregated states",
          "summary": "We introduce and study a nonlinear discrete dynamical system describing the evolution of a resource distribution among interacting agents. The model generalizes several classical mean-field and opinion-dynamics frameworks and is defined on the standard simplex, where each coordinate evolves according to an interaction rule depending on pairwise preference functions. We provide a complete analytical description of the long-term behavior of the system.",
          "authors": [
            "Oksana Satur"
          ],
          "published": "2026-02-19T21:36:00+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17833v1",
          "entry_id": "http://arxiv.org/abs/2602.17833v1",
          "title": "Periodic orbits of reversible Lagrangian systems without self-intersections and Mañé genericity",
          "summary": "Bernard [3] showed that a Mañé generic convex Hamiltonian has only non-degenerate periodic orbits on a given energy level. We show that one can use this result to prove that for a generic potential the prime periodic orbits of fixed energy of a Lagrangian system of classical type on a compact manifold of dimension $n\\ge 3$ do not have self-intersections and do not intersect each other.",
          "authors": [
            "Hans-Bert Rademacher"
          ],
          "published": "2026-02-19T20:53:43+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17788v1",
          "entry_id": "http://arxiv.org/abs/2602.17788v1",
          "title": "Enumeration of Nilpotent Loops by Orbit Counting",
          "summary": "We study central extensions of nilpotent loops by elementary abelian $p$-groups using normalized cocycles. By introducing an affine automorphism group acting on the full cocycle space, we obtain a direct correspondence between affine orbits and isomorphism classes of central extensions. This framework yields an efficient orbit-counting method for enumerating nilpotent loops. We reproduce the known results for orders less than 24, and enumerate the nilpotent loops of order 24 with center of size at least 3.",
          "authors": [
            "Fariha Iftikhar",
            "Gábor P. Nagy"
          ],
          "published": "2026-02-19T19:45:59+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17661v1",
          "entry_id": "http://arxiv.org/abs/2602.17661v1",
          "title": "Dehn quandles of surfaces and their bounded cohomology",
          "summary": "We introduce new families of quandles that serve as invariants for classifying closed orientable surfaces. These families generalize the classical Dehn quandle and are defined, respectively, on isotopy classes of unoriented closed curves and on integral weighted multicurves. We establish their fundamental algebraic properties and construct a natural quandle covering that relates them. We then analyze their metric properties, showing that these quandles are unbounded with respect to the quandle metric. Next, we compute their second bounded quandle cohomology, proving it to be infinite-dimensional. We also establish a version of the Gromov Mapping Theorem, showing that the natural map from an abelian quandle extension onto the original quandle induces an injection on bounded quandle cohomology in every dimension. Finally, inspired by recent developments in quandle rings, we analyze idempotents in the integral quandle rings arising from the classical Dehn quandle of a surface.",
          "authors": [
            "Pankaj Kapari",
            "Deepanshi Saraf",
            "Mahender Singh"
          ],
          "published": "2026-02-19T18:59:36+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17637v1",
          "entry_id": "http://arxiv.org/abs/2602.17637v1",
          "title": "On Sets of Monochromatic Objects in Bicolored Point Sets",
          "summary": "Let $P$ be a set of $n$ points in the plane, not all on a line, each colored \\emph{red} or \\emph{blue}. The classical Motzkin--Rabin theorem guarantees the existence of a \\emph{monochromatic} line. Motivated by the seminal work of Green and Tao (2013) on the Sylvester-Gallai theorem, we investigate the quantitative and structural properties of monochromatic geometric objects, such as lines, circles, and conics.\n  We first show that if no line contains more than three points, then for all sufficiently large $n$ there are at least $n^{2}/24 - O(1)$ monochromatic lines. We then show a converse of a theorem of Jamison (1986): Given $n\\ge 6$ blue points and $n$ red points, if the blue points lie on a conic and every line through two blue points contains a red point, then all red points are collinear. We also settle the smallest nontrivial case of a conjecture of Milićević (2018) by showing that if we have $5$ blue points with no three collinear and $5$ red points, if the blue points lie on a conic and every line through two blue points contains a red point, then all $10$ points lie on a cubic curve. Further, we analyze the random setting and show that, for any non-collinear set of $n\\ge 10$ points independently colored red or blue, the expected number of monochromatic lines is minimized by the \\emph{near-pencil} configuration. Finally, we examine monochromatic circles and conics, and exhibit several natural families in which no such monochromatic objects exist.",
          "authors": [
            "Sujoy Bhore",
            "Konrad Swanepoel"
          ],
          "published": "2026-02-19T18:50:35+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17631v1",
          "entry_id": "http://arxiv.org/abs/2602.17631v1",
          "title": "The Hidden Nature of Non-Markovianity",
          "summary": "The theory of open quantum systems served as a tool to prepare entanglement at the beginning stage of quantum technology and more recently provides an important tool for state preparation. Dynamics given by time dependent Lindbladians are Markovian and lead to decoherence, decay of correlation and convergence to equilibrium. In contrast Non-Markovian evolutions can outperform their Markovian counterparts by enhancing memory. In this letter we compare the trajectories of Markovian and Non-Markovian evolutions starting from a fixed initial value. It turns out that under mild assumptions every trajectory can be obtained from a family of time dependent Lindbladians. Hence Non-Markovianity is invisible if single trajectories are concerned.",
          "authors": [
            "Jihong Cai",
            "Advith Govindarajan",
            "Marius Junge"
          ],
          "published": "2026-02-19T18:47:28+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17752v1",
          "entry_id": "http://arxiv.org/abs/2602.17752v1",
          "title": "A logical approach to concentration",
          "summary": "Concentration results say that a sequence of random variables becomes progressively concentrated around the mean. Such results are common in the study of functions of random graphs. We introduce a real-valued logic with various aggregate operators on graphs, including summation, and prove that every term in the language, seen as a random variable on random graphs within the classical Erdős-Rényi random graph model, is concentrated. We prove this for dense and sparse variants of Erdős-Rényi graphs. On the one hand, our results extend the line of work originating with Fagin and Glebskii et al. on zero-one laws for dense random graphs, as well as the zero-one law of Shelah and Spencer for sparse random graphs. On the other hand, they can be seen as a meta-theorem for inferring concentration results on random graphs, and we give examples of such applications.",
          "authors": [
            "Michael Benedikt",
            "Maksim Zhukovskii"
          ],
          "published": "2026-02-19T18:40:49+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17567v1",
          "entry_id": "http://arxiv.org/abs/2602.17567v1",
          "title": "Canonical labelling of random regular graphs",
          "summary": "We prove that whenever $d=d(n)\\to\\infty$ and $n-d\\to\\infty$ as $n\\to\\infty$, then with high probability for any non-trivial initial colouring, the colour refinement algorithm distinguishes all vertices of the random regular graph $\\mathcal{G}_{n,d}$. This, in particular, implies that with high probability $\\mathcal{G}_{n,d}$ admits a canonical labelling computable in time $O(\\min\\{n^ω,nd^2+nd\\log n\\})$, where $ω<2.372$ is the matrix multiplication exponent.",
          "authors": [
            "Mikhail Isaev",
            "Tamás Makai",
            "Brendan McKay",
            "Pawel Pralat",
            "Jane Tan",
            "Maksim Zhukovskii"
          ],
          "published": "2026-02-19T17:23:31+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17562v1",
          "entry_id": "http://arxiv.org/abs/2602.17562v1",
          "title": "On the Linearization of Flat Multi-Input Systems via Prolongations",
          "summary": "We examine when differentially flat nonlinear control systems with more than two inputs can be rendered static feedback linearizable by prolongations of suitably chosen inputs after applying a static input transformation. Building on the structure of the time derivatives of a flat output, we derive sufficient conditions that guarantee such prolongations yield a static feedback linearizable system. In the two-input case, prior work established precise links between relative degrees, the highest derivative orders occurring in a flat parameterization, and the minimal dimension of a linearizing dynamic extension, leading to necessary and sufficient criteria for systems that become static feedback linearizable after at most two prolongations of such suitably chosen inputs. This work extends this analysis to systems with more than two inputs and derives particular results for the three-input case.",
          "authors": [
            "Georg Hartl",
            "Conrad Gstöttner",
            "Markus Schöberl"
          ],
          "published": "2026-02-19T17:17:59+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17530v1",
          "entry_id": "http://arxiv.org/abs/2602.17530v1",
          "title": "Provably Explaining Neural Additive Models",
          "summary": "Despite significant progress in post-hoc explanation methods for neural networks, many remain heuristic and lack provable guarantees. A key approach for obtaining explanations with provable guarantees is by identifying a cardinally-minimal subset of input features which by itself is provably sufficient to determine the prediction. However, for standard neural networks, this task is often computationally infeasible, as it demands a worst-case exponential number of verification queries in the number of input features, each of which is NP-hard.\n  In this work, we show that for Neural Additive Models (NAMs), a recent and more interpretable neural network family, we can efficiently generate explanations with such guarantees. We present a new model-specific algorithm for NAMs that generates provably cardinally-minimal explanations using only a logarithmic number of verification queries\n  in the number of input features, after a parallelized preprocessing step with logarithmic runtime in the required precision is applied to each small univariate NAM component.\n  Our algorithm not only makes the task of obtaining cardinally-minimal explanations feasible, but even outperforms existing algorithms designed to find the relaxed variant of subset-minimal explanations - which may be larger and less informative but easier to compute - despite our algorithm solving a much more difficult task.\n  Our experiments demonstrate that, compared to previous algorithms, our approach provides provably smaller explanations than existing works and substantially reduces the computation time. Moreover, we show that our generated provable explanations offer benefits that are unattainable by standard sampling-based techniques typically used to interpret NAMs.",
          "authors": [
            "Shahaf Bassan",
            "Yizhak Yisrael Elboher",
            "Tobias Ladner",
            "Volkan Şahin",
            "Jan Kretinsky",
            "Matthias Althoff",
            "Guy Katz"
          ],
          "published": "2026-02-19T16:42:29+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17506v1",
          "entry_id": "http://arxiv.org/abs/2602.17506v1",
          "title": "Scattering in the Positive Energy Isosceles Three-Body Problem",
          "summary": "In the three-body problem with positive energy, solutions which avoid triple collision have the property that the size of the triangle formed by the bodies tends to infinity as $t\\rightarrow \\pm\\infty$. Furthermore, the triangles have well-defined asymptotic shapes $s_\\pm$. The scattering problems asks which asymptotic shape $s_+$ can occur for a given choice of $s_-$. Previous work shows that this can be viewed as the problem of finding heteroclinic orbits connecting equilibrium points on a boundary manifold ``at infinity'' and some results were obtained for solutions which avoid collisions. The goal of this paper is to study the scattering effect of binary and near-triple collisions in a simple setting -- the isosceles three-body problem. The details depend on the mass parameters but in many cases, a fixed isosceles initial shape $s_-$ scatters to essentially all possible isosceles shapes $s_+$.",
          "authors": [
            "Richard Moeckel"
          ],
          "published": "2026-02-19T16:21:22+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17482v1",
          "entry_id": "http://arxiv.org/abs/2602.17482v1",
          "title": "Compiling Quantum Lambda-Terms into Circuits via the Geometry of Interaction",
          "summary": "We present an algorithm turning any term of a linear quantum $λ$-calculus into a quantum circuit. The essential ingredient behind the proposed algorithm is Girard's geometry of interaction, which, differently from its well-known uses from the literature, is here leveraged to perform as much of the classical computation as possible, at the same time producing a circuit that, when evaluated, performs all the quantum operations in the underlying $λ$-term. We identify higher-order control flow as the primary obstacle towards efficient solutions to the problem at hand. Notably, geometry of interaction proves sufficiently flexible to enable efficient compilation in many cases, while still supporting a total compilation procedure. Finally, we characterize through a type system those $λ$-terms for which compilation can be performed efficiently.",
          "authors": [
            "Kostia Chardonnet",
            "Ugo Dal Lago",
            "Naohiko Hoshino",
            "Paolo Pistone"
          ],
          "published": "2026-02-19T15:50:47+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17480v1",
          "entry_id": "http://arxiv.org/abs/2602.17480v1",
          "title": "Directed type theory, with a twist",
          "summary": "In recent years, Homotopy Type Theory (HoTT) has had great success both as a foundation of mathematics and as internal language to reason about $\\infty$-groupoids (a.k.a. spaces). However, in many areas of mathematics and computer science, it is often the case that it is categories, not groupoids, which are the more important structures to consider. For this reason, multiple directed type theories have been proposed, i.e., theories whose semantics are based on categories. In this paper, we present a new such type theory, Twisted Type Theory (TTT). It features a novel ``twisting'' operation on types: given a type that depends both contravariantly and covariantly on some variables, its twist is a new type that depends only covariantly on the same variables. To provide the semantics of this operation, we introduce the notion of dependent 2-sided fibrations (D2SFibs), which generalize Street's notion of 2-sided fibrations. We develop the basic theory of D2SFibs, as well as characterize them through a straightening-unstraightening theorem. With these results in hand, we introduce a new elimination rule for Hom-types. We argue that our syntax and semantics satisfy key features that allow reasoning in a HoTT-like style, which allows us to mimic the proof techniques of that setting. We end the paper by exemplifying this, and use TTT to reason about categories, giving a syntactic proof of Yoneda's lemma.",
          "authors": [
            "Fernando Rafael Chu Rivera",
            "Paige Randall North"
          ],
          "published": "2026-02-19T15:48:43+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17459v1",
          "entry_id": "http://arxiv.org/abs/2602.17459v1",
          "title": "Uniform Set Systems with Uniform Witnesses",
          "summary": "Frankl--Pach and Erdős conjectured that any $(d+1)$-uniform set family $\\mathcal{F}\\subseteq \\binom{[n]}{d+1}$ with VC-dimension at most $d$ has size at most $\\binom{n-1}{d}$ when $n$ is sufficiently large. Ahlswede and Khachatrian showed that the conjecture is false by giving a counterexample of size $\\binom{n-1}{d}+\\binom{n-4}{d-2}$.\n  For a set family $\\mathcal{F}\\subseteq \\binom{[n]}{d+1}$, the condition that its VC-dimension is at most $d$ can be reformulated as follows: for any $F\\in\\mathcal{F}$, there exists a set $B_F\\subseteq F$ such that $F\\cap F'\\neq B_F$ for all $F'\\in\\mathcal{F}$. In this direction, the first author, Xu, Yip, and Zhang conjectured that the bound $\\binom{n-1}{d}$ holds if we further assume that $|B_F|=s$ for every $F\\in \\mathcal{F}$ and for some fixed $0\\leq s\\leq d$.\n  The case $s=0$ is exactly the Erdős--Ko--Rado theorem, and the cases $s\\in \\{1,d\\}$ were proved in the paper by the first author, Xu, Yip, and Zhang. In this short note, we show that the conjecture holds when $s\\leq d/2$, and the maximal constructions are stars. Moreover, we construct non-star set families of size $\\binom{n-1}{d}$ satisfying the condition for $d/2<s\\leq d-1$, which suggests that the problem is substantially different in these cases.",
          "authors": [
            "Ting-Wei Chao",
            "Zixuan Xu",
            "Dmitrii Zakharov"
          ],
          "published": "2026-02-19T15:25:56+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17444v1",
          "entry_id": "http://arxiv.org/abs/2602.17444v1",
          "title": "Design of low-energy transfers in cislunar space using sequences of lobe dynamics",
          "summary": "Dynamical structures in the circular restricted three-body problem (CR3BP) are fundamental for designing low-energy transfers, as they aid in analyzing phase space transport and designing desirable trajectories. This study focuses on lobe dynamics to exploit local chaotic transport around celestial bodies, and proposes a new method for systematically designing low-energy transfers by combining multiple lobe dynamics. A graph-based framework is constructed to explore possible transfer paths between departure and arrival orbits, reducing the complexity of the combinatorial optimization problem for designing fuel-efficient transfers. Based on this graph, low-energy transfer trajectories are constructed by connecting chaotic orbits within lobes. The resulting optimal trajectory in the Earth--Moon CR3BP is then converted into an optimal transfer in the bicircular restricted four-body problem using multiple shooting. The obtained transfer is compared with existing optimal solutions to demonstrate the effectiveness of the proposed method.",
          "authors": [
            "Naoki Hiraiwa",
            "Mai Bando",
            "Yuzuru Sato",
            "Shinji Hokamoto"
          ],
          "published": "2026-02-19T15:12:22+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17412v2",
          "entry_id": "http://arxiv.org/abs/2602.17412v2",
          "title": "On problems of Erdős and Baumann-Briggs on minimising the density of $s$-cliques in graphs with forbidden subgraphs",
          "summary": "Using flag algebras, we prove that the minimum density of $8$-cliques in a large graph without an independent set of size $3$ is $491411/268435456+o(1)$, thus resolving a new case of an old problem of Erdős [Magyar Tud. Akad. Mat. Kutató Int. Közl. 7 (1962) 459-464]. Also, we establish some other results of this type; for example, we show that the minimum $s$-clique density in a large graph with no independent set of size 3 nor an induced 5-cycle is $2^{1-s}+o(1)$ when $s=4,5,6$. For each of these results, we also describe the structure of all extremal and almost extremal graphs of large order $n$.\n  These results are applied to give an asymptotic solution to a number of cases of the problem of Baumann and Briggs [Electronic J Comb 32 (2025) P1.22] which asks for the minimum number of $s$-cliques in an $n$-vertex graph in which every $k$-set spans a $t$-clique.",
          "authors": [
            "Levente Bodnár",
            "Oleg Pikhurko"
          ],
          "published": "2026-02-19T14:42:49+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17411v1",
          "entry_id": "http://arxiv.org/abs/2602.17411v1",
          "title": "Cohomological and quasi-isometric diversity of groups with property $R_\\infty$",
          "summary": "How rich is the collection of groups with a given prominent property? In this work we approach this question for property~$R_\\infty$, which says that every automorphism $\\varphi$ of a given group has infinitely many orbits under the $\\varphi$-twisted conjugation action $(g,x) \\mapsto gx\\varphi(g)^{-1}$. Generalising the soluble groups of Herbert Abels to a large family over many integral domains, we prove that most such groups have property~$R_\\infty$ drawing from a classical result of Levchuk and a swift observation by Jabara. Within the broad programme of cataloguing finitely generated groups up to quasi-isometry, our groups can then be separated by finiteness properties and cohomological dimension whilst having~$R_\\infty$. Abandoning finite presentability, we establish that property~$R_\\infty$ is very abundant in a strong sense: there are uncountably many finitely generated groups (which can all be chosen to be amenable or non-amenable) that have~$R_\\infty$ and are pairwise not quasi-isometric. The proofs vary in flavour. On the amenable side we use carefully constructed quotients of Abels' groups and a general strategy for quasi-isometric diversity established by Minasyan, Osin, and Witzel. For the non-amenable constructions we rely on modifications of Leary's type $\\mathtt{FP}$ groups, further cohomological arguments, and recent powerful criteria for~$R_\\infty$ due to Iveson, Martino, Sgobbi, Wong, and Fournier-Facio.",
          "authors": [
            "Karel Dekimpe",
            "Paula M. Lins de Araujo",
            "Yuri Santos Rego"
          ],
          "published": "2026-02-19T14:39:28+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17401v1",
          "entry_id": "http://arxiv.org/abs/2602.17401v1",
          "title": "On a Quadratic Relation Between Stanley-Wilf Limits and Füredi-Hajnal Limits",
          "summary": "For a permutation matrix $P$, let $s_P$ denote its Stanley-Wilf limit, the exponential growth rate of the number of $n\\times n$ permutation matrices avoiding $P$. Let $c_P$ denote its Füredi-Hajnal limit, which is the limit $\\displaystyle \\lim_{n \\to \\infty} \\text{ex}(n,P)/n$ where $\\text{ex}(n,P)$ is the maximum number of ones in an $n\\times n$ $0$-$1$ matrix avoiding $P$. Cibulka proved the universal quadratic bound $s_P\\leq 2.88\\,c_P^2$. In this note we improve the constants in Cibulka's result through a so-called ``block contraction\" argument. Defining \\[ F(c)=\\inf_{t\\in\\mathbb{N}} \\frac{(t!)^{1/t}\\,15^{\\,c/t}}{c}, \\] for $c>0$, this leads us to the revised inequality $s_P\\leq F(c_P)\\,c_P^2$. In particular, $F(c)=\\log 15+o(1) \\approx 2.70805\\ldots +o(1)$ as $c\\to\\infty$, and the constant improves $2.88$ once $c_P \\geq 17$.",
          "authors": [
            "Mohamed Omar"
          ],
          "published": "2026-02-19T14:29:30+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17346v1",
          "entry_id": "http://arxiv.org/abs/2602.17346v1",
          "title": "Partial Optimality in the Preordering Problem",
          "summary": "Preordering is a generalization of clustering and partial ordering with applications in bioinformatics and social network analysis. Given a finite set $V$ and a value $c_{ab} \\in \\mathbb{R}$ for every ordered pair $ab$ of elements of $V$, the preordering problem asks for a preorder $\\lesssim$ on $V$ that maximizes the sum of the values of those pairs $ab$ for which $a \\lesssim b$. Building on the state of the art in solving this NP-hard problem partially, we contribute new partial optimality conditions and efficient algorithms for deciding these conditions. In experiments with real and synthetic data, these new conditions increase, in particular, the fraction of pairs $ab$ for which it is decided efficiently that $a \\not\\lesssim b$ in an optimal preorder.",
          "authors": [
            "David Stein",
            "Jannik Irmai",
            "Bjoern Andres"
          ],
          "published": "2026-02-19T13:29:09+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17309v1",
          "entry_id": "http://arxiv.org/abs/2602.17309v1",
          "title": "Some Remarks on Marginal Code Languages",
          "summary": "A prefix code L satisfies the condition that no word of L is a proper prefix of another word of L. Recently, Ko, Han and Salomaa relaxed this condition by allowing a word of L to be a proper prefix of at most k words of L, for some `margin' k, introducing thus the class of k-prefix-free languages, as well as the similar classes of k-suffix-free and k-infix-free languages. Here we unify the definitions of these three classes of languages into one uniform definition in two ways: via the method of partial orders and via the method of transducers. Thus, for any known class of code-related languages definable via the transducer method, one gets a marginal version of that class. Building on the techniques of Ko, Han and Salomaa, we discuss the \\emph{uniform} satisfaction and maximality problems for marginal classes of languages.",
          "authors": [
            "Stavros Konstantinidis"
          ],
          "published": "2026-02-19T12:19:43+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17301v1",
          "entry_id": "http://arxiv.org/abs/2602.17301v1",
          "title": "Grothendieck Topologies and Sheaf-Theoretic Foundations of Cryptographic Security: Attacker Models and $Σ$-Protocols as the First Step",
          "summary": "Cryptographic security is traditionally formulated using game-based or simulation-based definitions. In this paper, we propose a structural reformulation of cryptographic security based on Grothendieck topologies and sheaf theory.\n  Our key idea is to model attacker observations as a Grothendieck site, where covering families represent admissible decompositions of partial information determined by efficient simulation. Within this framework, protocol transcripts naturally form sheaves, and security properties arise as geometric conditions.\n  As a first step, we focus on $Σ$-protocols. We show that the transcript structure of any $Σ$-protocol defines a torsor in the associated topos of sheaves. Local triviality of this torsor corresponds to zero-knowledge, while the absence of global sections reflects soundness. A concrete analysis of the Schnorr $Σ$-protocol is provided to illustrate the construction.\n  This sheaf-theoretic perspective offers a conceptual explanation of simulation-based security and suggests a geometric foundation for further cryptographic abstractions.",
          "authors": [
            "Takao Inoué"
          ],
          "published": "2026-02-19T12:11:35+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17286v1",
          "entry_id": "http://arxiv.org/abs/2602.17286v1",
          "title": "Comparing Numbers of Diagonal Subsemigroups and Congruences for Semigroups",
          "summary": "Given a semigroup $S$, a diagonal subsemigroup $ρ$ is defined to be a reflexive and compatible relation on $S$, i.e. a subsemigroup of the direct square $S\\times S$ containing the diagonal $\\{ (s,s)\\colon s\\in S\\}$. When $S$ is finite, we define the DSC coefficient $χ(S)$ to be the ratio of the number of congruences to the number of diagonal subsemigroups. In a previous work we observed that $χ(S) = 1$ if and only if $S$ is a group. Here we show that for any rational $α$ with $0 < α\\leq 1$, there exists a semigroup with $χ(S) = α$. We do this by utilizing the Rees matrix construction and adapting the congruence classification of such semigroups to describe their diagonal subsemigroups.",
          "authors": [
            "Callum Barber",
            "Nik Ruškuc"
          ],
          "published": "2026-02-19T11:46:06+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17276v1",
          "entry_id": "http://arxiv.org/abs/2602.17276v1",
          "title": "RLGT: A reinforcement learning framework for extremal graph theory",
          "summary": "Reinforcement learning (RL) is a subfield of machine learning that focuses on developing models that can autonomously learn optimal decision-making strategies over time. In a recent pioneering paper, Wagner demonstrated how the Deep Cross-Entropy RL method can be applied to tackle various problems from extremal graph theory by reformulating them as combinatorial optimization problems. Subsequently, many researchers became interested in refining and extending the framework introduced by Wagner, thereby creating various RL environments specialized for graph theory. Moreover, a number of problems from extremal graph theory were solved through the use of RL. In particular, several inequalities concerning the Laplacian spectral radius of graphs were refuted, new lower bounds were obtained for certain Ramsey numbers, and contributions were made to the Turán-type extremal problem in which the forbidden structures are cycles of length three and four. Here, we present Reinforcement Learning for Graph Theory (RLGT), a novel RL framework that systematizes the previous work and provides support for both undirected and directed graphs, with or without loops, and with an arbitrary number of edge colors. The framework efficiently represents graphs and aims to facilitate future RL-based research in extremal graph theory through optimized computational performance and a clean and modular design.",
          "authors": [
            "Ivan Damnjanović",
            "Uroš Milivojević",
            "Irena Đorđević",
            "Dragan Stevanović"
          ],
          "published": "2026-02-19T11:25:22+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17741v1",
          "entry_id": "http://arxiv.org/abs/2602.17741v1",
          "title": "On the Vertex Seidel Energy of Graphs",
          "summary": "We introduce the vertex Seidel energy via the diagonal entries of the absolute Seidel matrix. We establish a spectral formula, compute exact values for several graph families, derive bounds, and present a Coulson-type integral representation for analytical study of this invariant. We also show that vertex Seidel energy is invariant under Seidel switching and complementation.",
          "authors": [
            "Kalpesh M. Popat",
            "Enide Andrade"
          ],
          "published": "2026-02-19T10:58:11+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17253v1",
          "entry_id": "http://arxiv.org/abs/2602.17253v1",
          "title": "Symmetric (co)homology polytopes",
          "summary": "Symmetric edge polytopes are a recent and well-studied family of centrally symmetric polytopes arising from graphs. In this paper, we introduce a generalization of this family to arbitrary simplicial complexes. We show how topological properties of a simplicial complex can be translated into geometric properties of such polytopes, and vice versa. We study the integer decomposition property, facets and reflexivity of these polytopes. Using Gröbner basis techniques, we obtain a (not necessarily unimodular) triangulation of these polytopes. Due to the tools we use, most of our results hold in the more general setting of arbitrary centrally symmetric polytopes.",
          "authors": [
            "Torben Donzelmann",
            "Thiago Holleben",
            "Martina Juhnke"
          ],
          "published": "2026-02-19T10:57:00+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17242v1",
          "entry_id": "http://arxiv.org/abs/2602.17242v1",
          "title": "TAPO-Structured Description Logic for Information Behavior: Procedural and Oracle-Based Extensions",
          "summary": "We introduce \\emph{TAPO-Structured Description Logic} (TAPO--DL), a formal extension of classical description logic designed to model \\emph{information behavior} as a structured, dynamic process.\n  TAPO--DL extends the standard T--Box/A--Box architecture with two additional layers: a \\emph{Procedural Box} (P--Box), which supports concept-driven, imperative-style programs such as conditional and iterative actions, and an \\emph{Oracle Box} (O--Box), which formalizes controlled interaction with external information sources. While the terminological and assertional components capture static conceptual and factual knowledge, the procedural and oracle-based components enable the explicit representation of information-generating actions and external validation.\n  We provide a unified semantic framework for TAPO--DL based on a co-generative, sheaf-theoretic interpretation, in which local informational states are modeled as sections and informational stability corresponds to the existence of coherent global structures. Within this setting, informational truth is characterized as stability under repeated agentive interaction rather than correspondence to a fixed global state.\n  By integrating description logic with procedural dynamics, oracle-based reasoning, and sheaf-theoretic semantics, TAPO--DL offers a principled formal framework for analyzing information behavior in contexts involving interaction, uncertainty, and contextuality.",
          "authors": [
            "Takao Inoué"
          ],
          "published": "2026-02-19T10:43:21+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17240v1",
          "entry_id": "http://arxiv.org/abs/2602.17240v1",
          "title": "Serre depth and local cohomology",
          "summary": "We introduce a fundamental homological invariant, called \\emph{Serre depth}, which stratifies Serre's conditions in the same way that depth stratifies the Cohen-Macaulay property. We study the Serre depths of modules over arbitrary Noetherian local rings and over standard graded algebras over a field, extending the polynomial ring case due to Muta and Terai. Under mild hypotheses, we show that the $r$-th Serre depth of a finitely generated module $M$ measures the deviation of $M$ from satisfying Serre's condition $(S_r)$. The main results of the paper can be summarized as follows:\n  (i) We establish the basic properties of Serre depth and prove that it is invariant under completion.\n  (ii) If the base ring $R$ is a homomorphic image of a Gorenstein ring, we show that a finitely generated $R$-module $M$ is equidimensional and satisfies $(S_r)$ if and only if its $r$-th Serre depth equals its Krull dimension. Analogous statements are obtained for schemes.\n  (iii) For a homogeneous ideal in a standard graded polynomial ring over a field, we compare its Serre depths with those of its initial ideal.\n  (iv) We characterize the Serre depths of a monomial ideal in terms of its skeletons and prove that the Serre depths of sufficiently large powers of a monomial ideal stabilize; the proof uses Presburger arithmetic.",
          "authors": [
            "Antonino Ficarra"
          ],
          "published": "2026-02-19T10:37:30+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17237v1",
          "entry_id": "http://arxiv.org/abs/2602.17237v1",
          "title": "Disjunction Composition of BDD Transition Systems for Model-Based Testing",
          "summary": "We introduce a compositional approach to model-based test generation in Behavior-Driven Development (BDD). BDD is an agile methodology in which system behavior is specified through textual scenarios that, in our approach, are translated into transition systems used for model-based testing. This paper formally defines disjunction composition, to combine BDD transition systems that represent alternative system behaviors. Disjunction composition allows for modeling and testing the integrated behavior while ensuring that the testing power of the original set of scenarios is preserved. This is proved using a symbolic semantics for BDD transition systems, with the property that the symbolic equivalence of two BDD transition systems guarantees that they fail the same test cases. Also, we demonstrate the potential of disjunction composition by applying the composition in an industrial case study.",
          "authors": [
            "Tannaz Zameni",
            "Petra van den Bos",
            "Arend Rensink"
          ],
          "published": "2026-02-19T10:33:50+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17236v1",
          "entry_id": "http://arxiv.org/abs/2602.17236v1",
          "title": "Characterization of tangent quasicircles and quasiannuli",
          "summary": "We give a necessary and sufficient condition so that a pair of disjoint Jordan regions in the sphere can be quasiconformally mapped to a pair of disks. As a consequence, we obtain a simple characterization that involves Lipschitz functions for the case that one of the Jordan regions is a half-plane. We apply these results to prove that all polynomial cusps are quasiconformally equivalent and that a quasisymmetric embedding of the union of two disjoint disks extends to a quasiconformal map of the sphere, quantitatively. Also, in combination with previous work of the author, we obtain a new characterization of compact sets that are quasiconformally equivalent to Schottky sets.",
          "authors": [
            "Dimitrios Ntalampekos"
          ],
          "published": "2026-02-19T10:30:48+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17210v1",
          "entry_id": "http://arxiv.org/abs/2602.17210v1",
          "title": "Bilateral parking procedures",
          "summary": "We introduce the class of bilateral parking procedures on the integer line. While cars try to park in the nearest available spot to their right in the classical case, we consider more general parking rules that allow cars to use the nearest available spot to their left. We show that for a natural subclass of local procedures, the number of corresponding parking functions of length $r$ is always equal to $(r+1)^{r-1}$. The setting can be extended to probabilistic procedures, in which the decision to park left or right is random. We finally describe how bilateral procedures can naturally be encoded by certain labeled binary forests, whose combinatorics shed light on several results from the literature.",
          "authors": [
            "Philippe Nadeau"
          ],
          "published": "2026-02-19T10:02:09+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17179v1",
          "entry_id": "http://arxiv.org/abs/2602.17179v1",
          "title": "Multispecies inhomogeneous $t$-PushTASEP with general capacity",
          "summary": "We study an $n$-species $t$-PushTASEP, an integrable long-range stochastic process, on a one-dimensional periodic lattice with inhomogeneities $x_1,\\ldots,x_L$ and arbitrary capacity $l$ at each lattice site. The Markov matrix is identified with an alternating sum of commuting transfer matrices over all fundamental representations of $U_t(\\widehat{sl}_{n+1})$. Stationary probabilities are expressed in a matrix product form involving a fusion of quantized corner transfer matrices for the strange five-vertex model introduced by Okado, Scrimshaw, and the second author. The resulting partition function, which serves as the normalization factor of the stationary probabilities, is obtained from the $l=1$ case by a finite plethystic substitution of length $l$.",
          "authors": [
            "Arvind Ayyer",
            "Atsuo Kuniba"
          ],
          "published": "2026-02-19T08:52:26+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17142v1",
          "entry_id": "http://arxiv.org/abs/2602.17142v1",
          "title": "Generating Rely-Guarantee Conditions with the Conditional-Writes Domain",
          "summary": "Abstract interpretation has been shown to be a promising technique for the thread-modular verification of concurrent programs. Central to this is the generation of interferences, in the form of rely-guarantee conditions, conforming to a user-chosen structure. In this work, we introduce one such structure called the conditional-writes domain, designed for programs where it suffices to establish only the conditions under which particular variables are written to by each thread. We formalise our analysis within a novel abstract interpretation framework that is highly modular and can be easily extended to capture other structures for rely-guarantee conditions. We formalise two versions of our approach and evaluate their implementations on a simple programming language.",
          "authors": [
            "James Tobler",
            "Graeme Smith"
          ],
          "published": "2026-02-19T07:34:25+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.17089v1",
          "entry_id": "http://arxiv.org/abs/2602.17089v1",
          "title": "Synergizing Transport-Based Generative Models and Latent Geometry for Stochastic Closure Modeling",
          "summary": "Diffusion models recently developed for generative AI tasks can produce high-quality samples while still maintaining diversity among samples to promote mode coverage, providing a promising path for learning stochastic closure models. Compared to other types of generative AI models, such as GANs and VAEs, the sampling speed is known as a key disadvantage of diffusion models. By systematically comparing transport-based generative models on a numerical example of 2D Kolmogorov flows, we show that flow matching in a lower-dimensional latent space is suited for fast sampling of stochastic closure models, enabling single-step sampling that is up to two orders of magnitude faster than iterative diffusion-based approaches. To control the latent space distortion and thus ensure the physical fidelity of the sampled closure term, we compare the implicit regularization offered by a joint training scheme against two explicit regularizers: metric-preserving (MP) and geometry-aware (GA) constraints. Besides offering a faster sampling speed, both explicitly and implicitly regularized latent spaces inherit the key topological information from the lower-dimensional manifold of the original complex dynamical system, which enables the learning of stochastic closure models without demanding a huge amount of training data.",
          "authors": [
            "Xinghao Dong",
            "Huchen Yang",
            "Jin-long Wu"
          ],
          "published": "2026-02-19T05:24:00+00:00"
        },
        {
          "paper_id": "http://arxiv.org/abs/2602.16993v1",
          "entry_id": "http://arxiv.org/abs/2602.16993v1",
          "title": "Neural codes via homological invariants of polarized neural ideals",
          "summary": "For a neural code $\\mathcal{C}\\subseteq\\mathbb{F}_2^n$, polarizing the canonical form generators of the neural ideal $J_{\\mathcal{C}}$ yields a squarefree monomial ideal $\\mathcal{P}(J_{\\mathcal{C}})\\subset k[x_1,\\dots,x_n,y_1,\\dots,y_n]$, the polarized neural ideal, and an associated simplicial complex $Δ_{\\mathcal{C}}$, the polar complex. We study the graded invariants $\\operatorname{pd}(\\mathcal{P}(J_{\\mathcal{C}}))$ and $\\operatorname{reg}(\\mathcal{P}(J_{\\mathcal{C}}))$ via the topology of $Δ_{\\mathcal{C}}$, showing that simple geometric features of the Hamming cube $\\mathbb{F}_2^n$ (with Hamming distance) organize their extremal behavior. We prove $\\operatorname{reg}(\\mathcal{P}(J_{\\mathcal{C}}))\\le 2n-1$, with equality precisely when $\\mathcal{C}$ is obtained from $\\mathbb{F}_2^n$ by deleting an antipodal pair. Using connectedness properties of induced subcomplexes of $Δ_{\\mathcal{C}}$, we obtain $\\operatorname{pd}(\\mathcal{P}(J_{\\mathcal{C}}))\\le 2n-3$, and we give an explicit family of codes attaining equality, each consisting of antipodal pairs. At the opposite end, we identify the cube geometry behind the smallest values: $\\operatorname{reg}(\\mathcal{P}(J_{\\mathcal{C}}))=1$ forces $\\mathcal{C}$ to be a coordinate subcube of $\\mathbb{F}_2^n$, while $\\operatorname{pd}(\\mathcal{P}(J_{\\mathcal{C}}))=0$ forces $\\mathcal{C}$ to be the complement of one. Finally, we construct families realizing large regions of the $(\\operatorname{pd},\\operatorname{reg})$-plot for fixed $n$.",
          "authors": [
            "Selvi Kara",
            "Ellie Lew"
          ],
          "published": "2026-02-19T01:37:44+00:00"
        }
      ],
      "interested_paper_ids": [],
      "summaries": {},
      "sent_paper_ids": [],
      "notification_sent": false,
      "retry_count": 0,
      "last_error": null,
      "created_at": "2026-02-23T02:36:32.969842+00:00",
      "updated_at": "2026-02-23T08:41:45.040758+00:00",
      "finalized_at": null
    }
  ]
}